
&Вместо("ПроверитьКорректностьНомераСчета")
Функция pcru_ex_ПроверитьКорректностьНомераСчета(ТекущийОбъект, Отказ, ВыводитьСообщения)

	//РазрешитьПовторноеИспользованиеНомеровСчетовАналитическогоУчета = БНФООбщегоНазначенияНФОПовтИсп.РазрешитьПовторноеИспользованиеНомеровСчетовАналитическогоУчета();
    РазрешитьПовторноеИспользованиеНомеровСчетовАналитическогоУчета = Истина;
	Код = ТекущийОбъект.Код;

	Если НЕ СтроковыеФункцииКлиентСервер.ТолькоЦифрыВСтроке(СокрП(Код)) Тогда
		Если ВыводитьСообщения Тогда
			ТекстСообщения = НСтр("ru = 'Код счета аналитического учета %1 содержит нецифровые символы!'"); 
			ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСообщения, СокрЛП(Код));
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, ТекущийОбъект, "Код", "Объект", Отказ);		
		Иначе
			Отказ = Истина;
		КонецЕсли;	
	КонецЕсли;

	Если НЕ РазрешитьПовторноеИспользованиеНомеровСчетовАналитическогоУчета И НЕ Справочники.БНФОСчетаАналитическогоУчета.УникальныйКод(ТекущийОбъект, Код) Тогда
		Если ВыводитьСообщения Тогда
			ТекстСообщения = НСтр("ru = 'Код счета аналитического учета %1 не уникален!'"); 
			ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСообщения, СокрЛП(Код));
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, ТекущийОбъект, "Код", "Объект", Отказ);
		Иначе
			Отказ = Истина;
		КонецЕсли;	
	КонецЕсли;

	Использовать25СимволовВСчетахАналитическогоУчета = БНФООбщегоНазначенияНФОПовтИсп.Использовать25СимволовВСчетахАналитическогоУчета();

	Если НЕ Использовать25СимволовВСчетахАналитическогоУчета И СтрДлина(СокрЛП(Код)) <> 20 Тогда

		Если ВыводитьСообщения Тогда
			ТекстСообщения = НСтр("ru = 'Код счета аналитического учета %1 имеет недопустимую длину (допускается 20 символов)!'"); 
			ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСообщения, СокрЛП(Код));
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, ТекущийОбъект, "Код", "Объект", Отказ);
		Иначе
			Отказ = Истина;
		КонецЕсли;

	КонецЕсли;

	Если Использовать25СимволовВСчетахАналитическогоУчета И СтрДлина(СокрЛП(Код)) <> 20 И СтрДлина(СокрЛП(Код)) <> 25 Тогда

		Если ВыводитьСообщения Тогда
			ТекстСообщения = НСтр("ru = 'Код счета аналитического учета %1 имеет недопустимую длину (допускается 20 или 25 символов)!'"); 
			ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСообщения, СокрЛП(Код));
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, ТекущийОбъект, "Код", "Объект", Отказ);		
		Иначе
			Отказ = Истина;
		КонецЕсли;
	КонецЕсли;

	Возврат Отказ;

КонецФункции
