
&НаСервере
Процедура СверитьНаСервере()
	//ЭтаФорма.СверкаСчетов.Очистить();
	//Запрос = Новый Запрос;
	//Запрос.Текст = "ВЫБРАТЬ
	//|	ПОДСТРОКА(dbo_Proficredit_X_G_L_Correspondence_Entry.Debit_Account_No_, 1, 5) КАК НАВДТ,
	//|	ПОДСТРОКА(dbo_Proficredit_X_G_L_Correspondence_Entry.Credit_Account_No_, 1, 5) КАК НАВКТ,
	//|	СУММА(dbo_Proficredit_X_G_L_Correspondence_Entry.Amount) КАК СУММАНАВ
	//|ИЗ
	//|	ВнешнийИсточникДанных.NAV.Таблица.dbo_Proficredit_X_G_L_Correspondence_Entry КАК dbo_Proficredit_X_G_L_Correspondence_Entry
	//|ГДЕ
	//|	dbo_Proficredit_X_G_L_Correspondence_Entry.Posting_Date >= &Posting_Date1
	//|	И dbo_Proficredit_X_G_L_Correspondence_Entry.Posting_Date <= &Posting_Date2
	//|
	//|СГРУППИРОВАТЬ ПО
	//|	ПОДСТРОКА(dbo_Proficredit_X_G_L_Correspondence_Entry.Debit_Account_No_, 1, 5),
	//|	ПОДСТРОКА(dbo_Proficredit_X_G_L_Correspondence_Entry.Credit_Account_No_, 1, 5)";
	//Запрос.УстановитьПараметр("Posting_Date1",ЭтаФорма.Дата1 );
	//Запрос.УстановитьПараметр("Posting_Date2",ЭтаФорма.Дата2 );
	//Выборка = Запрос.Выполнить().Выбрать();
	//Пока Выборка.Следующий() Цикл
	//	СтрокаТЧ =    ЭтаФорма.СверкаСчетов.Добавить();
	//	СтрокаТЧ.НАВДТ  =   Выборка.НАВДТ;
	//	СтрокаТЧ.НАВКТ  =   Выборка.НАВКТ;
	//	СтрокаТЧ.СУММАНАВ  =   Выборка.СУММАНАВ;
	//	Запрос2 = Новый Запрос;
	//	Запрос2.Текст = "ВЫБРАТЬ
	//	|	СУММА(БНФОБанковский.Сумма) КАК Сумма1С
	//	|ИЗ
	//	|	РегистрБухгалтерии.БНФОБанковский КАК БНФОБанковский
	//	|ГДЕ
	//	|	БНФОБанковский.Период >= &Posting_Date1
	//	|	и БНФОБанковский.Период <= &Posting_Date2
	//	|	И БНФОБанковский.СчетДт.Код = &Код1
	//	|	И БНФОБанковский.СчетКт.Код = &Код2";
	//	Запрос2.УстановитьПараметр("Posting_Date1",ЭтаФорма.Дата1 );
	//	Запрос2.УстановитьПараметр("Posting_Date2",КонецДня(ЭтаФорма.Дата2) );
	//	Запрос2.УстановитьПараметр("Код1",Выборка.НАВДТ );
	//	Запрос2.УстановитьПараметр("Код2", Выборка.НАВКТ);
	//	Выборка2 = Запрос2.Выполнить().Выбрать();
	//	Пока Выборка2.Следующий() Цикл
	//		СтрокаТЧ.Сумма1С  =   Выборка2.Сумма1С;
	//		
	//	КонецЦикла;
	//	СтрокаТЧ.СуммаДельта	= СтрокаТЧ.СУММАНАВ - СтрокаТЧ.Сумма1С;
	//КонецЦикла;
	//
	//
	//
	//
	//ЭтаФорма.СверкаСчетовПоДатам.Очистить();
	//Запрос = Новый Запрос;
	//Запрос.Текст = "ВЫБРАТЬ
	//               |	ПОДСТРОКА(dbo_Proficredit_X_G_L_Correspondence_Entry.Debit_Account_No_, 1, 5) КАК НАВДТ,
	//               |	ПОДСТРОКА(dbo_Proficredit_X_G_L_Correspondence_Entry.Credit_Account_No_, 1, 5) КАК НАВКТ,
	//               |	dbo_Proficredit_X_G_L_Correspondence_Entry.Posting_Date КАК Дата,
	//               |	СУММА(dbo_Proficredit_X_G_L_Correspondence_Entry.Amount) КАК СУММАНАВ
	//               |ИЗ
	//               |	ВнешнийИсточникДанных.NAV.Таблица.dbo_Proficredit_X_G_L_Correspondence_Entry КАК dbo_Proficredit_X_G_L_Correspondence_Entry
	//               |ГДЕ
	//               |	dbo_Proficredit_X_G_L_Correspondence_Entry.Posting_Date >= &Posting_Date1
	//               |	И dbo_Proficredit_X_G_L_Correspondence_Entry.Posting_Date <= &Posting_Date2
	//               |
	//               |СГРУППИРОВАТЬ ПО
	//               |	ПОДСТРОКА(dbo_Proficredit_X_G_L_Correspondence_Entry.Debit_Account_No_, 1, 5),
	//               |	ПОДСТРОКА(dbo_Proficredit_X_G_L_Correspondence_Entry.Credit_Account_No_, 1, 5),
	//               |	dbo_Proficredit_X_G_L_Correspondence_Entry.Posting_Date
	//               |
	//               |УПОРЯДОЧИТЬ ПО
	//               |	Дата";
	//Запрос.УстановитьПараметр("Posting_Date1",ЭтаФорма.Дата1 );
	//Запрос.УстановитьПараметр("Posting_Date2",КонецДня(ЭтаФорма.Дата2));
	//Выборка = Запрос.Выполнить().Выбрать();
	//Пока Выборка.Следующий() Цикл
	//	СтрокаТЧ =    ЭтаФорма.СверкаСчетовПоДатам.Добавить();
	//	СтрокаТЧ.НАВДТ  =   Выборка.НАВДТ;
	//	СтрокаТЧ.НАВКТ  =   Выборка.НАВКТ;
	//	СтрокаТЧ.Дата  =   Выборка.Дата;
	//	СтрокаТЧ.СУММАНАВ  =   Выборка.СУММАНАВ;
	//	Запрос2 = Новый Запрос;
	//	Запрос2.Текст = "ВЫБРАТЬ
	//	|	СУММА(БНФОБанковский.Сумма) КАК Сумма1С
	//	|ИЗ
	//	|	РегистрБухгалтерии.БНФОБанковский КАК БНФОБанковский
	//	|ГДЕ
	//	|	БНФОБанковский.Период >= &Posting_Date1
	//    |   И БНФОБанковский.Период <= &Posting_Date2
	//	|	И БНФОБанковский.СчетДт.Код = &Код1
	//	|	И БНФОБанковский.СчетКт.Код = &Код2";
	//	Запрос2.УстановитьПараметр("Posting_Date1",НачалоДня(Выборка.Дата));
	//	Запрос2.УстановитьПараметр("Posting_Date2",КонецДня(Выборка.Дата));
	//	Запрос2.УстановитьПараметр("Код1",Выборка.НАВДТ );
	//	Запрос2.УстановитьПараметр("Код2", Выборка.НАВКТ);
	//	Выборка2 = Запрос2.Выполнить().Выбрать();
	//	Пока Выборка2.Следующий() Цикл
	//		СтрокаТЧ.Сумма1С  =   Выборка2.Сумма1С;
	//	КонецЦикла;
	//	СтрокаТЧ.СуммаДельта	= СтрокаТЧ.СУММАНАВ - СтрокаТЧ.Сумма1С;
	//КонецЦикла;
	
	ЭтаФорма.СверкаОстатковСчетов.Очистить();
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ПОДСТРОКА(dbo_Proficredit_X_G_L_Entry.G_L_Account_No_, 1, 5) КАК Счет,
	|	ВЫБОР
	|		КОГДА СУММА(dbo_Proficredit_X_G_L_Entry.Amount) > 0
	|			ТОГДА СУММА(dbo_Proficredit_X_G_L_Entry.Amount)
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК СуммаНавДТ,
	|	ВЫБОР
	|		КОГДА СУММА(dbo_Proficredit_X_G_L_Entry.Amount) < 0
	|			ТОГДА -СУММА(dbo_Proficredit_X_G_L_Entry.Amount)
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК СуммаНавКТ
	|ИЗ
	|	ВнешнийИсточникДанных.NAV.Таблица.dbo_Proficredit_X_G_L_Entry КАК dbo_Proficredit_X_G_L_Entry
	|ГДЕ
	|	ПОДСТРОКА(dbo_Proficredit_X_G_L_Entry.G_L_Account_No_, 1, 5) В (""47416"", ""47422"", ""48801"", ""48802"", ""48803"", ""48807"", ""48808"", ""48810"", ""49401"", ""49402"", ""49407"", ""49408"", ""49410"", ""60324"")
	|	И dbo_Proficredit_X_G_L_Entry.Posting_Date <= &Posting_Date
	|
	|СГРУППИРОВАТЬ ПО
	|	ПОДСТРОКА(dbo_Proficredit_X_G_L_Entry.G_L_Account_No_, 1, 5)";
	Запрос.УстановитьПараметр("Posting_Date",КонецДня(ЭтаФорма.Дата2) );
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Запрос1 = Новый Запрос;
		Запрос1.Текст = "ВЫБРАТЬ
		|	БНФОБанковскийОстатки.Счет КАК Счет,
		|	БНФОБанковскийОстатки.СуммаОстатокДт КАК Сумма1СДТ,
		|	БНФОБанковскийОстатки.СуммаОстатокКт КАК Сумма1СКТ
		|ИЗ
		|	РегистрБухгалтерии.БНФОБанковский.Остатки(&Posting_Date, Счет.Код = &Код, , ) КАК БНФОБанковскийОстатки";
		Запрос1.УстановитьПараметр("Posting_Date",КонецДня(ЭтаФорма.Дата2) );
		Запрос1.УстановитьПараметр("Код",Выборка.Счет );
		Выборка1 = Запрос1.Выполнить().Выбрать();
		Пока Выборка1.Следующий() Цикл
			НоваяСтрока                = ЭтаФорма.СверкаОстатковСчетов.Добавить();
			НоваяСтрока.Счет           =  Выборка.Счет;
			НоваяСтрока.СуммаНавДТ     =  Выборка.СуммаНавДТ;
			НоваяСтрока.СуммаНавКТ     =  Выборка.СуммаНавКТ;
			НоваяСтрока.Сумма1СДТ      =  Выборка1.Сумма1СДТ;
			НоваяСтрока.Сумма1СКТ      =  Выборка1.Сумма1СКТ;
			НоваяСтрока.СуммаДельтаДТ  =  Выборка.СуммаНавДТ - Выборка1.Сумма1СДТ;
			НоваяСтрока.СуммаДельтаКТ  =  Выборка.СуммаНавКТ - Выборка1.Сумма1СКТ;
		КонецЦикла;
	КонецЦикла;
	
	
	ЭтаФорма.СверкаОборотовСчетов.Очистить();
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ПОДСТРОКА(dbo_Proficredit_X_G_L_Entry.G_L_Account_No_, 1, 5) КАК Счет,
	|	СУММА(dbo_Proficredit_X_G_L_Entry.Amount) КАК Сумма,
	|	СУММА(dbo_Proficredit_X_G_L_Entry.Debit_Amount) КАК СуммаНавДТ,
	|	СУММА(dbo_Proficredit_X_G_L_Entry.Credit_Amount) КАК СуммаНавКТ
	|ИЗ
	|	ВнешнийИсточникДанных.NAV.Таблица.dbo_Proficredit_X_G_L_Entry КАК dbo_Proficredit_X_G_L_Entry
	|ГДЕ
	|	ПОДСТРОКА(dbo_Proficredit_X_G_L_Entry.G_L_Account_No_, 1, 5) В (""71001"", ""71002"", ""71005"", ""71006"", ""71201"", ""71202"", ""71501"", ""71502"", ""71801"", ""71701"", ""71702"")
	|	И dbo_Proficredit_X_G_L_Entry.Posting_Date <= &Posting_Date2
	|	И dbo_Proficredit_X_G_L_Entry.Posting_Date >= &Posting_Date1
	|
	|СГРУППИРОВАТЬ ПО
	|	ПОДСТРОКА(dbo_Proficredit_X_G_L_Entry.G_L_Account_No_, 1, 5)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Счет";
	Запрос.УстановитьПараметр("Posting_Date1",ЭтаФорма.Дата1 );
	Запрос.УстановитьПараметр("Posting_Date2",КонецДня(ЭтаФорма.Дата2) );
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Запрос1 = Новый Запрос;
		Запрос1.Текст = "ВЫБРАТЬ
		|	БНФОБанковскийОбороты.Счет КАК Счет,
		|	БНФОБанковскийОбороты.СуммаОборот КАК СуммаОборот,
		|	БНФОБанковскийОбороты.СуммаОборотДт КАК Сумма1СДТ,
		|	БНФОБанковскийОбороты.СуммаОборотКт КАК Сумма1СКТ
		|ИЗ
		|	РегистрБухгалтерии.БНФОБанковский.Обороты(&ДАТА1, &ДАТА2, , Счет.Код = &Код, ,Субконто1.Код <> ""00-000255"" или Субконто1.Код <> ""00-000233"", , ) КАК БНФОБанковскийОбороты";
		Запрос1.УстановитьПараметр("ДАТА1",ЭтаФорма.Дата1);
		Запрос1.УстановитьПараметр("ДАТА2",КонецДня(ЭтаФорма.Дата2) );
		Запрос1.УстановитьПараметр("Код",Выборка.Счет );
		Выборка1 = Запрос1.Выполнить().Выбрать();
		Пока Выборка1.Следующий() Цикл
			НоваяСтрока                = ЭтаФорма.СверкаОборотовСчетов.Добавить();
			НоваяСтрока.Счет           =  Выборка.Счет;
			НоваяСтрока.СуммаНавДТ     =  Выборка.СуммаНавДТ;
			НоваяСтрока.СуммаНавКТ     =  Выборка.СуммаНавКТ;
			НоваяСтрока.Сумма1СДТ      =  Выборка1.Сумма1СДТ;
			НоваяСтрока.Сумма1СКТ      =  Выборка1.Сумма1СКТ;
			НоваяСтрока.СуммаДельтаДТ  =  Выборка.СуммаНавДТ - Выборка1.Сумма1СДТ;
			НоваяСтрока.СуммаДельтаКТ  =  Выборка.СуммаНавКТ - Выборка1.Сумма1СКТ;
		КонецЦикла;
	КонецЦикла;
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура Сверить(Команда)
	СверитьНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	//УстановитьПривилегированныйРежим(Истина);	
	//Параметры = ВнешниеИсточникиДанных.NAV.ПолучитьОбщиеПараметрыСоединения();
	//Параметры.АутентификацияСтандартная = Истина;
	//Параметры.ИмяПользователя = "1c_test";
	//Параметры.Пароль = "tset_c1";
	//Параметры.СтрокаСоединения = "DRIVER={SQL Server};SERVER=RUSPBSQLPROD\CRMRU;Trusted_Connection=yes;DATABASE=PROFICREDIT;LANGUAGE=русский;APP=1С Reglament Job";
	//Параметры.СУБД = "MSDASQL.1";
	//ВнешниеИсточникиДанных.NAV.УстановитьОбщиеПараметрыСоединения(Параметры);
	//ВнешниеИсточникиДанных.NAV.УстановитьПараметрыСоединенияПользователя(ИмяПользователя(), Параметры);
	//ВнешниеИсточникиДанных.NAV.УстановитьПараметрыСоединенияСеанса(Параметры);
	//ВнешниеИсточникиДанных.NAV.УстановитьСоединение();   
	
КонецПроцедуры

&НаКлиенте
Процедура Дата1ПриИзменении(Элемент)
	ЭтаФорма.Дата2 = КонецМесяца(ЭтаФорма.дата1);
КонецПроцедуры
