
//&Вместо("ПолучитьРасчетПоТранспортномуНалогу")
//Функция pcru_ex_ПолучитьРасчетПоТранспортномуНалогу(Организация, ПериодРасчета)
//		РеквизитыОрганизации = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Организация, "РегистрацияВНалоговомОргане");
//	
//	ГодовойРасчет = КонецКвартала(ПериодРасчета) = КонецГода(ПериодРасчета);
//	
//	ДатаНачалаПериодаОтчета = ?(ГодовойРасчет, НачалоГода(ПериодРасчета), НачалоКвартала(ПериодРасчета));
//	ДатаКонцаПериодаОтчета = КонецКвартала(ПериодРасчета);
//	
//	ТаблицаРасчетТранспортногоНалога = ПустаяСправкаРасчет("РасчетТранспортногоНалога");
//	
//	ЭтоНеЮрЛицо = НЕ ОбщегоНазначенияБПВызовСервераПовтИсп.ЭтоЮрЛицо(Организация);
//	
//	Если Месяц(ПериодРасчета)%3 <> 0 ИЛИ ЭтоНеЮрЛицо Тогда
//		Возврат ТаблицаРасчетТранспортногоНалога;
//	КонецЕсли;
//	
//	НетТСЗарегистрированныхВРеестреСистемыПлатон = Истина;
//	
//	Запрос = Новый Запрос;
//	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
//	Запрос.УстановитьПараметр("Организация", Организация);
//	Запрос.УстановитьПараметр("ПериодРасчета", ПериодРасчета);
//	Запрос.УстановитьПараметр("ОсновнойНалоговыйОрган", РеквизитыОрганизации.РегистрацияВНалоговомОргане);
//	
//	ТекстОбъединяющегоЗапроса = "";
//	
//	Период = ДатаНачалаПериодаОтчета;
//	
//	Пока Период <= ДатаКонцаПериодаОтчета Цикл
//		
//		// С 2016 года, если регистрация ТС произошла до 15-го числа соответствующего месяца включительно
//		// или снятие транспортного средства с регистрации (снятие с учета, исключение из государственного
//		// судового реестра и так далее) произошло после 15-го числа соответствующего месяца, за полный 
//		// месяц принимается месяц регистрации (снятия с регистрации) транспортного средства.
//		
//		Если Год(Период) < 2016 Тогда
//			КонецПериода = КонецМесяца(Период);
//			КонецПрошлогоПериода = НачалоМесяца(Период) - 1;
//		Иначе
//			КонецПериода = Дата(Год(Период), Месяц(Период), 15, 23, 59, 59);
//			КонецПрошлогоПериода = КонецПериода;
//		КонецЕсли;
//		
//		Запрос.УстановитьПараметр("КонецПрошлогоПериода", КонецПрошлогоПериода);
//		Запрос.УстановитьПараметр("НачалоМесяца", НачалоМесяца(Период));
//		Запрос.УстановитьПараметр("КонецПериода", КонецПериода);
//		
//		Запрос.Текст = 
//		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
//		|	РегистрацияТранспортныхСредствСрезПоследних.Период КАК Период,
//		|	РегистрацияТранспортныхСредствСрезПоследних.Организация КАК Организация,
//		|	РегистрацияТранспортныхСредствСрезПоследних.ОсновноеСредство КАК ОсновноеСредство
//		|ПОМЕСТИТЬ ВТ_РегистрацииНаКонецПрошлогоПериода
//		|ИЗ
//		|	РегистрСведений.РегистрацияТранспортныхСредств.СрезПоследних(&КонецПрошлогоПериода, Организация = &Организация) КАК РегистрацияТранспортныхСредствСрезПоследних
//		|ГДЕ
//		|	РегистрацияТранспортныхСредствСрезПоследних.ВключатьВНалоговуюБазу
//		|
//		|ИНДЕКСИРОВАТЬ ПО
//		|	Организация,
//		|	ОсновноеСредство
//		|;
//		|
//		|////////////////////////////////////////////////////////////////////////////////
//		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
//		|	РегистрацияТранспортныхСредств.Период КАК Период,
//		|	РегистрацияТранспортныхСредств.Организация КАК Организация,
//		|	РегистрацияТранспортныхСредств.ОсновноеСредство КАК ОсновноеСредство
//		|ПОМЕСТИТЬ ВТ_РегистрацииВПервыйДеньМесяца
//		|ИЗ
//		|	РегистрСведений.РегистрацияТранспортныхСредств КАК РегистрацияТранспортныхСредств
//		|ГДЕ
//		|	РегистрацияТранспортныхСредств.Организация = &Организация
//		|	И РегистрацияТранспортныхСредств.Период = &НачалоМесяца
//		|	И РегистрацияТранспортныхСредств.ВключатьВНалоговуюБазу
//		|
//		|ИНДЕКСИРОВАТЬ ПО
//		|	Организация,
//		|	ОсновноеСредство
//		|;
//		|
//		|////////////////////////////////////////////////////////////////////////////////
//		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
//		|	ЕСТЬNULL(ВТ_РегистрацииВПервыйДеньМесяца.Период, ВТ_РегистрацииНаКонецПрошлогоПериода.Период) КАК Период,
//		|	ВТ_РегистрацииНаКонецПрошлогоПериода.Организация,
//		|	ВТ_РегистрацииНаКонецПрошлогоПериода.ОсновноеСредство
//		|ПОМЕСТИТЬ ВТ_СписокОсновныхСредств
//		|ИЗ
//		|	ВТ_РегистрацииНаКонецПрошлогоПериода КАК ВТ_РегистрацииНаКонецПрошлогоПериода
//		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_РегистрацииВПервыйДеньМесяца КАК ВТ_РегистрацииВПервыйДеньМесяца
//		|		ПО ВТ_РегистрацииНаКонецПрошлогоПериода.Организация = ВТ_РегистрацииВПервыйДеньМесяца.Организация
//		|			И ВТ_РегистрацииНаКонецПрошлогоПериода.ОсновноеСредство = ВТ_РегистрацииВПервыйДеньМесяца.ОсновноеСредство
//		|
//		|ОБЪЕДИНИТЬ ВСЕ
//		|
//		|ВЫБРАТЬ
//		|	РегистрацияТранспортныхСредств.Период,
//		|	РегистрацияТранспортныхСредств.Организация,
//		|	РегистрацияТранспортныхСредств.ОсновноеСредство
//		|ИЗ
//		|	РегистрСведений.РегистрацияТранспортныхСредств КАК РегистрацияТранспортныхСредств
//		|ГДЕ
//		|	РегистрацияТранспортныхСредств.Организация = &Организация
//		|	И РегистрацияТранспортныхСредств.Период МЕЖДУ &НачалоМесяца И &КонецПериода
//		|	И РегистрацияТранспортныхСредств.ВключатьВНалоговуюБазу
//		|;
//		|
//		|////////////////////////////////////////////////////////////////////////////////
//		|УНИЧТОЖИТЬ ВТ_РегистрацииНаКонецПрошлогоПериода
//		|;
//		|
//		|////////////////////////////////////////////////////////////////////////////////
//		|УНИЧТОЖИТЬ ВТ_РегистрацииВПервыйДеньМесяца
//		|;
//		|
//		|////////////////////////////////////////////////////////////////////////////////
//		|ВЫБРАТЬ
//		|	МИНИМУМ(СписокОсновныхСредств.Период) КАК Период,
//		|	СписокОсновныхСредств.Организация КАК Организация,
//		|	СписокОсновныхСредств.ОсновноеСредство КАК ОсновноеСредство
//		|ПОМЕСТИТЬ ВТ_ПериодРегистрацииТранспортныхСредств
//		|ИЗ
//		|	ВТ_СписокОсновныхСредств КАК СписокОсновныхСредств
//		|
//		|СГРУППИРОВАТЬ ПО
//		|	СписокОсновныхСредств.ОсновноеСредство,
//		|	СписокОсновныхСредств.Организация
//		|
//		|ИНДЕКСИРОВАТЬ ПО
//		|	Период,
//		|	Организация,
//		|	ОсновноеСредство
//		|;
//		|
//		|////////////////////////////////////////////////////////////////////////////////
//		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
//		|	ВТ_ПериодРегистрацииТранспортныхСредств.Период КАК ДатаРегистрационныхДанных,
//		|	ВТ_ПериодРегистрацииТранспортныхСредств.ОсновноеСредство КАК ОсновноеСредство,
//		|	РегистрацияТранспортныхСредств.РегистрационныйЗнак КАК РегистрационныйЗнак,
//		|	РегистрацияТранспортныхСредств.Марка КАК Марка,
//		|	РегистрацияТранспортныхСредств.ИдентификационныйНомер КАК ИдентификационныйНомер,
//		|	ВЫБОР
//		|		КОГДА РегистрацияТранспортныхСредств.ПостановкаНаУчетВНалоговомОргане = ЗНАЧЕНИЕ(Перечисление.ПостановкаНаУчетВНалоговомОргане.ВДругомНалоговомОргане)
//		|			ТОГДА РегистрацияТранспортныхСредств.НалоговыйОрган
//		|		ИНАЧЕ &ОсновнойНалоговыйОрган
//		|	КОНЕЦ КАК РегистрацияВНалоговомОргане,
//		|	ВЫБОР
//		|		КОГДА РегистрацияТранспортныхСредств.НалоговыйОрган = ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)
//		|			ТОГДА ЕСТЬNULL(РегистрацияТранспортныхСредств.Организация.РегистрацияВНалоговомОргане.КодПоОКТМО, """")
//		|		ИНАЧЕ РегистрацияТранспортныхСредств.КодПоОКТМО
//		|	КОНЕЦ КАК КодПоОКТМО,
//		|	РегистрацияТранспортныхСредств.КодВидаТранспортногоСредства КАК КодВидаТранспортногоСредства,
//		|	РегистрацияТранспортныхСредств.НалоговаяБаза КАК НалоговаяБаза,
//		|	РегистрацияТранспортныхСредств.ЕдиницаИзмеренияНалоговойБазы КАК ЕдиницаИзмеренияНалоговойБазы,
//		|	РегистрацияТранспортныхСредств.НалоговаяЛьгота КАК НалоговаяЛьгота,
//		|	РегистрацияТранспортныхСредств.КодНалоговойЛьготы КАК КодНалоговойЛьготы,
//		|	РегистрацияТранспортныхСредств.РегиональныйКодЛьготы КАК РегиональныйКодЛьготы,
//		|	РегистрацияТранспортныхСредств.ЛьготнаяСтавка КАК ЛьготнаяСтавка,
//		|	РегистрацияТранспортныхСредств.ПроцентУменьшения КАК ПроцентУменьшения,
//		|	РегистрацияТранспортныхСредств.СуммаУменьшения КАК СуммаУменьшения,
//		|	РегистрацияТранспортныхСредств.ЭкологическийКласс КАК ЭкологическийКласс,
//		|	ВЫБОР
//		|		КОГДА РегистрацияТранспортныхСредств.ОбщаяСобственность
//		|			ТОГДА РегистрацияТранспортныхСредств.ДоляВПравеОбщейСобственностиЧислитель
//		|		ИНАЧЕ 1
//		|	КОНЕЦ КАК ДоляВПравеОбщейСобственностиЧислитель,
//		|	ВЫБОР
//		|		КОГДА РегистрацияТранспортныхСредств.ОбщаяСобственность
//		|			ТОГДА РегистрацияТранспортныхСредств.ДоляВПравеОбщейСобственностиЗнаменатель
//		|		ИНАЧЕ 1
//		|	КОНЕЦ КАК ДоляВПравеОбщейСобственностиЗнаменатель,
//		|	РегистрацияТранспортныхСредств.ПовышающийКоэффициент КАК ПовышающийКоэффициент,
//		|	РегистрацияТранспортныхСредств.ЗарегистрированоВРеестреСистемыПлатон КАК ЗарегистрированоВРеестреСистемыПлатон,
//		|	1 КАК КоличествоМесяцев
//		|ПОМЕСТИТЬ РегистрацияТранспортныхСредств
//		|ИЗ
//		|	ВТ_ПериодРегистрацииТранспортныхСредств КАК ВТ_ПериодРегистрацииТранспортныхСредств
//		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РегистрацияТранспортныхСредств КАК РегистрацияТранспортныхСредств
//		|		ПО ВТ_ПериодРегистрацииТранспортныхСредств.Период = РегистрацияТранспортныхСредств.Период
//		|			И ВТ_ПериодРегистрацииТранспортныхСредств.Организация = РегистрацияТранспортныхСредств.Организация
//		|			И ВТ_ПериодРегистрацииТранспортныхСредств.ОсновноеСредство = РегистрацияТранспортныхСредств.ОсновноеСредство";
//		
//		Подстрока = "ПОМЕСТИТЬ РегистрацияТранспортныхСредств";
//		Запрос.Текст = СтрЗаменить(Запрос.Текст, Подстрока, Подстрока + Формат(Период, "ДФ=MM"));
//		
//		Запрос.Выполнить();
//		
//		ТекстОбъединяющегоЗапроса = ТекстОбъединяющегоЗапроса
//								  + ?(ПустаяСтрока(ТекстОбъединяющегоЗапроса), 
//									  "ВЫБРАТЬ РАЗРЕШЕННЫЕ *
//		                              |",
//									  "ОБЪЕДИНИТЬ ВСЕ
//									  |ВЫБРАТЬ *
//		                              |")
//								  + ?(ПустаяСтрока(ТекстОбъединяющегоЗапроса), 
//									  "ПОМЕСТИТЬ РегистрацияТранспортныхСредств
//									  |",
//									  "")
//								  + "ИЗ РегистрацияТранспортныхСредств" + Формат(Период, "ДФ=MM") + "
//									|";
//									
//		Запрос.Текст = 
//		"УНИЧТОЖИТЬ ВТ_СписокОсновныхСредств
//		|;
//		|
//		|////////////////////////////////////////////////////////////////////////////////
//		|УНИЧТОЖИТЬ ВТ_ПериодРегистрацииТранспортныхСредств";
//		Запрос.Выполнить();
//		
//		Период = ДобавитьМесяц(Период, 1);
//		
//	КонецЦикла;
//	
//	Запрос.Текст = ТекстОбъединяющегоЗапроса;
//	РезультатЗапроса = Запрос.Выполнить();
//	
//	РегистрыСведений.ПорядокУплатыНалоговНаМестах.СоздатьНалоговыеОрганыСУстановленнойУплатойАвансов(
//		Запрос.МенеджерВременныхТаблиц, Организация, ПериодРасчета, "ТранспортныйНалог");
//	
//	Запрос.Текст =
//	"ВЫБРАТЬ
//	|	РегистрацияТранспортныхСредств.Период КАК Период,
//	|	РегистрацияТранспортныхСредств.ОсновноеСредство КАК ОсновноеСредство
//	|ПОМЕСТИТЬ ВТ_Регистрации
//	|ИЗ
//	|	РегистрСведений.РегистрацияТранспортныхСредств КАК РегистрацияТранспортныхСредств
//	|ГДЕ
//	|	РегистрацияТранспортныхСредств.Организация = &Организация
//	|	И РегистрацияТранспортныхСредств.Период <= &ПериодРасчета
//	|	И РегистрацияТранспортныхСредств.ВидЗаписи = ЗНАЧЕНИЕ(Перечисление.ВидЗаписиОРегистрации.Регистрация)
//	|
//	|ИНДЕКСИРОВАТЬ ПО
//	|	ОсновноеСредство,
//	|	Период
//	|;
//	|
//	|////////////////////////////////////////////////////////////////////////////////
//	|ВЫБРАТЬ
//	|	РегистрацияТранспортныхСредств.Период КАК Период,
//	|	РегистрацияТранспортныхСредств.ОсновноеСредство КАК ОсновноеСредство
//	|ПОМЕСТИТЬ ВТ_Снятия
//	|ИЗ
//	|	РегистрСведений.РегистрацияТранспортныхСредств КАК РегистрацияТранспортныхСредств
//	|ГДЕ
//	|	РегистрацияТранспортныхСредств.Организация = &Организация
//	|	И РегистрацияТранспортныхСредств.Период <= &ПериодРасчета
//	|	И РегистрацияТранспортныхСредств.ВидЗаписи = ЗНАЧЕНИЕ(Перечисление.ВидЗаписиОРегистрации.СнятиеСРегистрационногоУчета)
//	|
//	|ИНДЕКСИРОВАТЬ ПО
//	|	ОсновноеСредство,
//	|	Период
//	|;
//	|
//	|////////////////////////////////////////////////////////////////////////////////
//	|ВЫБРАТЬ
//	|	ВТ_Регистрации.ОсновноеСредство КАК ОсновноеСредство,
//	|	ВТ_Регистрации.Период КАК Период,
//	|	МАКСИМУМ(ЕСТЬNULL(ВТ_Снятия.Период, ДАТАВРЕМЯ(1, 1, 1))) КАК ПериодПредыдущегоСнятия
//	|ПОМЕСТИТЬ ВТ_ПредыдущиеСнятия
//	|ИЗ
//	|	ВТ_Регистрации КАК ВТ_Регистрации
//	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Снятия КАК ВТ_Снятия
//	|		ПО ВТ_Регистрации.ОсновноеСредство = ВТ_Снятия.ОсновноеСредство
//	|			И ВТ_Регистрации.Период > ВТ_Снятия.Период
//	|
//	|СГРУППИРОВАТЬ ПО
//	|	ВТ_Регистрации.ОсновноеСредство,
//	|	ВТ_Регистрации.Период
//	|
//	|ИНДЕКСИРОВАТЬ ПО
//	|	ОсновноеСредство,
//	|	Период
//	|;
//	|
//	|////////////////////////////////////////////////////////////////////////////////
//	|ВЫБРАТЬ
//	|	ВТ_ПредыдущиеСнятия.ОсновноеСредство КАК ОсновноеСредство,
//	|	ВТ_ПредыдущиеСнятия.Период КАК Период,
//	|	МИНИМУМ(ВТ_Регистрации.Период) КАК ПериодПервоначальнойРегистрации
//	|ПОМЕСТИТЬ ВТ_ПервоначальныеРегистрации
//	|ИЗ
//	|	ВТ_ПредыдущиеСнятия КАК ВТ_ПредыдущиеСнятия
//	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_Регистрации КАК ВТ_Регистрации
//	|		ПО ВТ_ПредыдущиеСнятия.ОсновноеСредство = ВТ_Регистрации.ОсновноеСредство
//	|			И ВТ_ПредыдущиеСнятия.ПериодПредыдущегоСнятия < ВТ_Регистрации.Период
//	|
//	|СГРУППИРОВАТЬ ПО
//	|	ВТ_ПредыдущиеСнятия.ОсновноеСредство,
//	|	ВТ_ПредыдущиеСнятия.Период
//	|
//	|ИНДЕКСИРОВАТЬ ПО
//	|	ОсновноеСредство,
//	|	Период
//	|;
//	|
//	|////////////////////////////////////////////////////////////////////////////////
//	|ВЫБРАТЬ
//	|	ВТ_Регистрации.ОсновноеСредство КАК ОсновноеСредство,
//	|	ВТ_Регистрации.Период КАК Период,
//	|	МИНИМУМ(ЕСТЬNULL(ВТ_Снятия.Период, ДАТАВРЕМЯ(1, 1, 1))) КАК ПериодСнятияСУчета
//	|ПОМЕСТИТЬ ВТ_СнятияСУчета
//	|ИЗ
//	|	ВТ_Регистрации КАК ВТ_Регистрации
//	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Снятия КАК ВТ_Снятия
//	|		ПО ВТ_Регистрации.ОсновноеСредство = ВТ_Снятия.ОсновноеСредство
//	|			И ВТ_Регистрации.Период < ВТ_Снятия.Период
//	|
//	|СГРУППИРОВАТЬ ПО
//	|	ВТ_Регистрации.ОсновноеСредство,
//	|	ВТ_Регистрации.Период
//	|
//	|ИНДЕКСИРОВАТЬ ПО
//	|	ОсновноеСредство,
//	|	Период
//	|;
//	|
//	|////////////////////////////////////////////////////////////////////////////////
//	|ВЫБРАТЬ
//	|	ВТ_Регистрации.ОсновноеСредство КАК ОсновноеСредство,
//	|	ВТ_Регистрации.Период КАК Период,
//	|	МАКСИМУМ(ВТ_ПервоначальныеРегистрации.ПериодПервоначальнойРегистрации) КАК ПериодПервоначальнойРегистрации,
//	|	МАКСИМУМ(ВТ_СнятияСУчета.ПериодСнятияСУчета) КАК ПериодСнятияСУчета
//	|ПОМЕСТИТЬ ВТ_ДатыПостановкиИСнятия
//	|ИЗ
//	|	ВТ_Регистрации КАК ВТ_Регистрации
//	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ПервоначальныеРегистрации КАК ВТ_ПервоначальныеРегистрации
//	|		ПО ВТ_Регистрации.ОсновноеСредство = ВТ_ПервоначальныеРегистрации.ОсновноеСредство
//	|			И ВТ_Регистрации.Период = ВТ_ПервоначальныеРегистрации.Период
//	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_СнятияСУчета КАК ВТ_СнятияСУчета
//	|		ПО ВТ_Регистрации.ОсновноеСредство = ВТ_СнятияСУчета.ОсновноеСредство
//	|			И ВТ_Регистрации.Период = ВТ_СнятияСУчета.Период
//	|
//	|СГРУППИРОВАТЬ ПО
//	|	ВТ_Регистрации.ОсновноеСредство,
//	|	ВТ_Регистрации.Период
//	|
//	|ИНДЕКСИРОВАТЬ ПО
//	|	ОсновноеСредство,
//	|	Период
//	|;
//	|
//	|////////////////////////////////////////////////////////////////////////////////
//	|ВЫБРАТЬ
//	|	СУММА(РегистрацияТранспортныхСредств.КоличествоМесяцев) КАК КоличествоМесяцев,
//	|	РегистрацияТранспортныхСредств.ОсновноеСредство КАК ОсновноеСредство,
//	|	РегистрацияТранспортныхСредств.РегистрационныйЗнак КАК РегистрационныйЗнак,
//	|	РегистрацияТранспортныхСредств.Марка КАК Марка,
//	|	РегистрацияТранспортныхСредств.ИдентификационныйНомер КАК ИдентификационныйНомер,
//	|	РегистрацияТранспортныхСредств.РегистрацияВНалоговомОргане КАК РегистрацияВНалоговомОргане,
//	|	РегистрацияТранспортныхСредств.КодПоОКТМО КАК КодПоОКТМО,
//	|	РегистрацияТранспортныхСредств.КодВидаТранспортногоСредства КАК КодВидаТранспортногоСредства,
//	|	РегистрацияТранспортныхСредств.НалоговаяБаза КАК НалоговаяБаза,
//	|	РегистрацияТранспортныхСредств.ЕдиницаИзмеренияНалоговойБазы КАК ЕдиницаИзмеренияНалоговойБазы,
//	|	РегистрацияТранспортныхСредств.НалоговаяЛьгота КАК НалоговаяЛьгота,
//	|	РегистрацияТранспортныхСредств.КодНалоговойЛьготы КАК КодНалоговойЛьготы,
//	|	РегистрацияТранспортныхСредств.РегиональныйКодЛьготы КАК РегиональныйКодЛьготы,
//	|	РегистрацияТранспортныхСредств.ЛьготнаяСтавка КАК ЛьготнаяСтавка,
//	|	РегистрацияТранспортныхСредств.ПроцентУменьшения КАК ПроцентУменьшения,
//	|	РегистрацияТранспортныхСредств.СуммаУменьшения КАК СуммаУменьшения,
//	|	РегистрацияТранспортныхСредств.ЭкологическийКласс КАК ЭкологическийКласс,
//	|	РегистрацияТранспортныхСредств.ДоляВПравеОбщейСобственностиЧислитель КАК ДоляВПравеОбщейСобственностиЧислитель,
//	|	РегистрацияТранспортныхСредств.ДоляВПравеОбщейСобственностиЗнаменатель КАК ДоляВПравеОбщейСобственностиЗнаменатель,
//	|	РегистрацияТранспортныхСредств.ПовышающийКоэффициент КАК ПовышающийКоэффициент,
//	|	РегистрацияТранспортныхСредств.ЗарегистрированоВРеестреСистемыПлатон КАК ЗарегистрированоВРеестреСистемыПлатон
//	|ПОМЕСТИТЬ ВТ_РазличныеЗаписи
//	|ИЗ
//	|	РегистрацияТранспортныхСредств КАК РегистрацияТранспортныхСредств
//	|
//	|СГРУППИРОВАТЬ ПО
//	|	РегистрацияТранспортныхСредств.ОсновноеСредство,
//	|	РегистрацияТранспортныхСредств.РегистрационныйЗнак,
//	|	РегистрацияТранспортныхСредств.Марка,
//	|	РегистрацияТранспортныхСредств.ИдентификационныйНомер,
//	|	РегистрацияТранспортныхСредств.РегистрацияВНалоговомОргане,
//	|	РегистрацияТранспортныхСредств.КодПоОКТМО,
//	|	РегистрацияТранспортныхСредств.КодВидаТранспортногоСредства,
//	|	РегистрацияТранспортныхСредств.НалоговаяБаза,
//	|	РегистрацияТранспортныхСредств.ЕдиницаИзмеренияНалоговойБазы,
//	|	РегистрацияТранспортныхСредств.НалоговаяЛьгота,
//	|	РегистрацияТранспортныхСредств.КодНалоговойЛьготы,
//	|	РегистрацияТранспортныхСредств.РегиональныйКодЛьготы,
//	|	РегистрацияТранспортныхСредств.ЛьготнаяСтавка,
//	|	РегистрацияТранспортныхСредств.ПроцентУменьшения,
//	|	РегистрацияТранспортныхСредств.СуммаУменьшения,
//	|	РегистрацияТранспортныхСредств.ЭкологическийКласс,
//	|	РегистрацияТранспортныхСредств.ДоляВПравеОбщейСобственностиЧислитель,
//	|	РегистрацияТранспортныхСредств.ДоляВПравеОбщейСобственностиЗнаменатель,
//	|	РегистрацияТранспортныхСредств.ПовышающийКоэффициент,
//	|	РегистрацияТранспортныхСредств.ЗарегистрированоВРеестреСистемыПлатон
//	|;
//	|
//	|////////////////////////////////////////////////////////////////////////////////
//	|ВЫБРАТЬ
//	|	СУММА(ВТ_РазличныеЗаписи.КоличествоМесяцев) КАК КоличествоМесяцев,
//	|	ВТ_РазличныеЗаписи.ОсновноеСредство КАК ОсновноеСредство,
//	|	ВТ_РазличныеЗаписи.РегистрационныйЗнак КАК РегистрационныйЗнак,
//	|	ВТ_РазличныеЗаписи.Марка КАК Марка,
//	|	ВТ_РазличныеЗаписи.ИдентификационныйНомер КАК ИдентификационныйНомер,
//	|	ВТ_РазличныеЗаписи.РегистрацияВНалоговомОргане КАК РегистрацияВНалоговомОргане,
//	|	ВТ_РазличныеЗаписи.КодПоОКТМО КАК КодПоОКТМО,
//	|	ВТ_РазличныеЗаписи.КодВидаТранспортногоСредства КАК КодВидаТранспортногоСредства,
//	|	ВТ_РазличныеЗаписи.НалоговаяБаза КАК НалоговаяБаза,
//	|	ВТ_РазличныеЗаписи.ЕдиницаИзмеренияНалоговойБазы КАК ЕдиницаИзмеренияНалоговойБазы,
//	|	ВТ_РазличныеЗаписи.ЭкологическийКласс КАК ЭкологическийКласс,
//	|	ВТ_РазличныеЗаписи.ДоляВПравеОбщейСобственностиЧислитель КАК ДоляВПравеОбщейСобственностиЧислитель,
//	|	ВТ_РазличныеЗаписи.ДоляВПравеОбщейСобственностиЗнаменатель КАК ДоляВПравеОбщейСобственностиЗнаменатель,
//	|	ВТ_РазличныеЗаписи.ПовышающийКоэффициент КАК ПовышающийКоэффициент,
//	|	ВТ_РазличныеЗаписи.ЗарегистрированоВРеестреСистемыПлатон КАК ЗарегистрированоВРеестреСистемыПлатон,
//	|	СУММА(ВЫБОР
//	|			КОГДА ВТ_РазличныеЗаписи.НалоговаяЛьгота <> ЗНАЧЕНИЕ(Перечисление.ВидыНалоговыхЛьготПоТранспортномуНалогу.НеПрименяется)
//	|				ТОГДА 1
//	|			ИНАЧЕ 0
//	|		КОНЕЦ) КАК КоличествоЗаписейЛьгот
//	|ПОМЕСТИТЬ ВТ_ЗаписиБезУчетаЛьгот
//	|ИЗ
//	|	ВТ_РазличныеЗаписи КАК ВТ_РазличныеЗаписи
//	|
//	|СГРУППИРОВАТЬ ПО
//	|	ВТ_РазличныеЗаписи.ОсновноеСредство,
//	|	ВТ_РазличныеЗаписи.РегистрационныйЗнак,
//	|	ВТ_РазличныеЗаписи.Марка,
//	|	ВТ_РазличныеЗаписи.ИдентификационныйНомер,
//	|	ВТ_РазличныеЗаписи.РегистрацияВНалоговомОргане,
//	|	ВТ_РазличныеЗаписи.КодПоОКТМО,
//	|	ВТ_РазличныеЗаписи.КодВидаТранспортногоСредства,
//	|	ВТ_РазличныеЗаписи.НалоговаяБаза,
//	|	ВТ_РазличныеЗаписи.ЕдиницаИзмеренияНалоговойБазы,
//	|	ВТ_РазличныеЗаписи.ЭкологическийКласс,
//	|	ВТ_РазличныеЗаписи.ДоляВПравеОбщейСобственностиЧислитель,
//	|	ВТ_РазличныеЗаписи.ДоляВПравеОбщейСобственностиЗнаменатель,
//	|	ВТ_РазличныеЗаписи.ПовышающийКоэффициент,
//	|	ВТ_РазличныеЗаписи.ЗарегистрированоВРеестреСистемыПлатон
//	|
//	|ИНДЕКСИРОВАТЬ ПО
//	|	ОсновноеСредство
//	|;
//	|
//	|////////////////////////////////////////////////////////////////////////////////
//	|ВЫБРАТЬ
//	|	МИНИМУМ(РегистрацияТранспортныхСредств.ДатаРегистрационныхДанных) КАК ДатаРегистрационныхДанных,
//	|	СУММА(РегистрацияТранспортныхСредств.КоличествоМесяцев) КАК КоличествоМесяцевЛьготы,
//	|	ВЫБОР
//	|		КОГДА ЕСТЬNULL(ВТ_ЗаписиБезУчетаЛьгот.КоличествоМесяцев, 0) = 0
//	|			ТОГДА СУММА(РегистрацияТранспортныхСредств.КоличествоМесяцев)
//	|		ИНАЧЕ ВТ_ЗаписиБезУчетаЛьгот.КоличествоМесяцев
//	|	КОНЕЦ КАК КоличествоМесяцевВладения,
//	|	РегистрацияТранспортныхСредств.ОсновноеСредство КАК ОсновноеСредство,
//	|	РегистрацияТранспортныхСредств.РегистрационныйЗнак КАК РегистрационныйЗнак,
//	|	РегистрацияТранспортныхСредств.Марка КАК Марка,
//	|	РегистрацияТранспортныхСредств.ИдентификационныйНомер КАК ИдентификационныйНомер,
//	|	РегистрацияТранспортныхСредств.РегистрацияВНалоговомОргане КАК ИФНС,
//	|	РегистрацияТранспортныхСредств.КодПоОКТМО КАК КодПоОКТМО,
//	|	РегистрацияТранспортныхСредств.КодВидаТранспортногоСредства КАК КодВидаТранспортногоСредства,
//	|	РегистрацияТранспортныхСредств.НалоговаяБаза КАК НалоговаяБаза,
//	|	РегистрацияТранспортныхСредств.ЕдиницаИзмеренияНалоговойБазы КАК ЕдиницаИзмерения,
//	|	РегистрацияТранспортныхСредств.НалоговаяЛьгота КАК НалоговаяЛьгота,
//	|	РегистрацияТранспортныхСредств.КодНалоговойЛьготы КАК КодНалоговойЛьготы,
//	|	РегистрацияТранспортныхСредств.РегиональныйКодЛьготы КАК РегиональныйКодЛьготы,
//	|	РегистрацияТранспортныхСредств.ЛьготнаяСтавка КАК ЛьготнаяСтавка,
//	|	РегистрацияТранспортныхСредств.ПроцентУменьшения КАК ПроцентУменьшения,
//	|	РегистрацияТранспортныхСредств.СуммаУменьшения КАК СуммаУменьшения,
//	|	РегистрацияТранспортныхСредств.ЭкологическийКласс КАК ЭкологическийКласс,
//	|	РегистрацияТранспортныхСредств.ДоляВПравеОбщейСобственностиЧислитель КАК ДоляВПравеОбщейСобственностиЧислитель,
//	|	РегистрацияТранспортныхСредств.ДоляВПравеОбщейСобственностиЗнаменатель КАК ДоляВПравеОбщейСобственностиЗнаменатель,
//	|	РегистрацияТранспортныхСредств.ПовышающийКоэффициент КАК ПовышающийКоэффициент,
//	|	РегистрацияТранспортныхСредств.ЗарегистрированоВРеестреСистемыПлатон КАК ЗарегистрированоВРеестреСистемыПлатон,
//	|	ЕСТЬNULL(ВТ_ЗаписиБезУчетаЛьгот.КоличествоЗаписейЛьгот, 0) КАК КоличествоЗаписейЛьгот,
//	|	ВЫБОР
//	|		КОГДА ВТ_НалоговыеОрганыСУстановленнойУплатойАвансов.НалоговыйОрган ЕСТЬ NULL
//	|			ТОГДА ЛОЖЬ
//	|		ИНАЧЕ ИСТИНА
//	|	КОНЕЦ КАК УплачиваютсяАвансы,
//	|	ОсновныеСредства.ДатаВыпуска КАК ДатаВыпуска,
//	|	ВТ_ДатыПостановкиИСнятия.ПериодПервоначальнойРегистрации КАК ДатаРегистрации,
//	|	ВТ_ДатыПостановкиИСнятия.ПериодСнятияСУчета КАК ДатаПрекращенияРегистрации
//	|ИЗ
//	|	РегистрацияТранспортныхСредств КАК РегистрацияТранспортныхСредств
//	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ЗаписиБезУчетаЛьгот КАК ВТ_ЗаписиБезУчетаЛьгот
//	|		ПО РегистрацияТранспортныхСредств.ОсновноеСредство = ВТ_ЗаписиБезУчетаЛьгот.ОсновноеСредство
//	|			И РегистрацияТранспортныхСредств.РегистрационныйЗнак = ВТ_ЗаписиБезУчетаЛьгот.РегистрационныйЗнак
//	|			И РегистрацияТранспортныхСредств.Марка = ВТ_ЗаписиБезУчетаЛьгот.Марка
//	|			И РегистрацияТранспортныхСредств.ИдентификационныйНомер = ВТ_ЗаписиБезУчетаЛьгот.ИдентификационныйНомер
//	|			И РегистрацияТранспортныхСредств.РегистрацияВНалоговомОргане = ВТ_ЗаписиБезУчетаЛьгот.РегистрацияВНалоговомОргане
//	|			И РегистрацияТранспортныхСредств.КодПоОКТМО = ВТ_ЗаписиБезУчетаЛьгот.КодПоОКТМО
//	|			И РегистрацияТранспортныхСредств.КодВидаТранспортногоСредства = ВТ_ЗаписиБезУчетаЛьгот.КодВидаТранспортногоСредства
//	|			И РегистрацияТранспортныхСредств.НалоговаяБаза = ВТ_ЗаписиБезУчетаЛьгот.НалоговаяБаза
//	|			И РегистрацияТранспортныхСредств.ЕдиницаИзмеренияНалоговойБазы = ВТ_ЗаписиБезУчетаЛьгот.ЕдиницаИзмеренияНалоговойБазы
//	|			И РегистрацияТранспортныхСредств.ЭкологическийКласс = ВТ_ЗаписиБезУчетаЛьгот.ЭкологическийКласс
//	|			И РегистрацияТранспортныхСредств.ДоляВПравеОбщейСобственностиЧислитель = ВТ_ЗаписиБезУчетаЛьгот.ДоляВПравеОбщейСобственностиЧислитель
//	|			И РегистрацияТранспортныхСредств.ДоляВПравеОбщейСобственностиЗнаменатель = ВТ_ЗаписиБезУчетаЛьгот.ДоляВПравеОбщейСобственностиЗнаменатель
//	|			И РегистрацияТранспортныхСредств.ПовышающийКоэффициент = ВТ_ЗаписиБезУчетаЛьгот.ПовышающийКоэффициент
//	|			И (ВТ_ЗаписиБезУчетаЛьгот.КоличествоЗаписейЛьгот = 1)
//	|			И РегистрацияТранспортныхСредств.ЗарегистрированоВРеестреСистемыПлатон = ВТ_ЗаписиБезУчетаЛьгот.ЗарегистрированоВРеестреСистемыПлатон
//	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_НалоговыеОрганыСУстановленнойУплатойАвансов КАК ВТ_НалоговыеОрганыСУстановленнойУплатойАвансов
//	|		ПО РегистрацияТранспортныхСредств.РегистрацияВНалоговомОргане = ВТ_НалоговыеОрганыСУстановленнойУплатойАвансов.НалоговыйОрган
//	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ОсновныеСредства КАК ОсновныеСредства
//	|		ПО РегистрацияТранспортныхСредств.ОсновноеСредство = ОсновныеСредства.Ссылка
//	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ДатыПостановкиИСнятия КАК ВТ_ДатыПостановкиИСнятия
//	|		ПО РегистрацияТранспортныхСредств.ОсновноеСредство = ВТ_ДатыПостановкиИСнятия.ОсновноеСредство
//	|			И РегистрацияТранспортныхСредств.ДатаРегистрационныхДанных = ВТ_ДатыПостановкиИСнятия.Период
//	|
//	|СГРУППИРОВАТЬ ПО
//	|	РегистрацияТранспортныхСредств.ОсновноеСредство,
//	|	РегистрацияТранспортныхСредств.РегистрационныйЗнак,
//	|	РегистрацияТранспортныхСредств.Марка,
//	|	РегистрацияТранспортныхСредств.ИдентификационныйНомер,
//	|	РегистрацияТранспортныхСредств.РегистрацияВНалоговомОргане,
//	|	РегистрацияТранспортныхСредств.КодПоОКТМО,
//	|	РегистрацияТранспортныхСредств.КодВидаТранспортногоСредства,
//	|	РегистрацияТранспортныхСредств.НалоговаяБаза,
//	|	РегистрацияТранспортныхСредств.ЕдиницаИзмеренияНалоговойБазы,
//	|	РегистрацияТранспортныхСредств.НалоговаяЛьгота,
//	|	РегистрацияТранспортныхСредств.КодНалоговойЛьготы,
//	|	РегистрацияТранспортныхСредств.РегиональныйКодЛьготы,
//	|	РегистрацияТранспортныхСредств.ЛьготнаяСтавка,
//	|	РегистрацияТранспортныхСредств.ПроцентУменьшения,
//	|	РегистрацияТранспортныхСредств.СуммаУменьшения,
//	|	РегистрацияТранспортныхСредств.ЭкологическийКласс,
//	|	РегистрацияТранспортныхСредств.ДоляВПравеОбщейСобственностиЧислитель,
//	|	РегистрацияТранспортныхСредств.ДоляВПравеОбщейСобственностиЗнаменатель,
//	|	РегистрацияТранспортныхСредств.ПовышающийКоэффициент,
//	|	ВТ_ЗаписиБезУчетаЛьгот.КоличествоМесяцев,
//	|	ВЫБОР
//	|		КОГДА ВТ_НалоговыеОрганыСУстановленнойУплатойАвансов.НалоговыйОрган ЕСТЬ NULL
//	|			ТОГДА ЛОЖЬ
//	|		ИНАЧЕ ИСТИНА
//	|	КОНЕЦ,
//	|	ОсновныеСредства.ДатаВыпуска,
//	|	ЕСТЬNULL(ВТ_ЗаписиБезУчетаЛьгот.КоличествоЗаписейЛьгот, 0),
//	|	РегистрацияТранспортныхСредств.ЗарегистрированоВРеестреСистемыПлатон,
//	|	ВТ_ДатыПостановкиИСнятия.ПериодПервоначальнойРегистрации,
//	|	ВТ_ДатыПостановкиИСнятия.ПериодСнятияСУчета
//	|
//	|УПОРЯДОЧИТЬ ПО
//	|	ИФНС,
//	|	КодПоОКТМО,
//	|	ОсновноеСредство";
//	
//	Результат = Запрос.Выполнить();
//	
//	Если Не Результат.Пустой() Тогда
//		
//		РасчетТранспортногоНалога = Результат.Выгрузить();
//		
//		РасчетТранспортногоНалога.Колонки.Добавить("КодПоОКТМОРегиона", 
//			ОбщегоНазначения.ОписаниеТипаСтрока(8));
//		РасчетТранспортногоНалога.Колонки.Добавить("КатегорияТС", 
//			Новый ОписаниеТипов("ПеречислениеСсылка.КатегорииТранспортныхСредств"));
//		РасчетТранспортногоНалога.Колонки.Добавить("НалоговаяСтавка", 
//			ОбщегоНазначения.ОписаниеТипаЧисло(11, 2));
//		РасчетТранспортногоНалога.Колонки.Добавить("НалоговаяСтавкаЗависитОтГодаВыпускаТС", 
//			Новый ОписаниеТипов("Булево"));
//		РасчетТранспортногоНалога.Колонки.Добавить("КоличествоЛетПрошедшихСГодаВыпускаТС", 
//			ОбщегоНазначения.ОписаниеТипаЧисло(3, 0));
//		
//		Макет = РегистрыСведений.РегистрацияТранспортныхСредств.ПолучитьМакет("КодыВидовИКатегорииТС");
//		КодыВидовИКатегорииТС = ОбщегоНазначения.ПрочитатьXMLВТаблицу(Макет.ПолучитьТекст()).Данные;
//		
//		Для Каждого СтрокаРасчета Из РасчетТранспортногоНалога Цикл
//			
//			КодПоОКТМО = Лев(СтрокаРасчета.КодПоОКТМО, 3);

//			Если НЕ (КодПоОКТМО = "118" ИЛИ КодПоОКТМО = "718" ИЛИ КодПоОКТМО = "719") Тогда
//				СтрокаРасчета.КодПоОКТМОРегиона = Лев(КодПоОКТМО, 2) + "000000";
//			Иначе
//				СтрокаРасчета.КодПоОКТМОРегиона = КодПоОКТМО + "00000";
//			КонецЕсли;
//			
//			НайденнаяСтрока = КодыВидовИКатегорииТС.Найти(СтрокаРасчета.КодВидаТранспортногоСредства, "КодВида");
//			Если НайденнаяСтрока <> Неопределено Тогда
//				СтрокаРасчета.КатегорияТС = Перечисления.КатегорииТранспортныхСредств[НайденнаяСтрока.Категория];
//			КонецЕсли;
//			
//			Если ЗначениеЗаполнено(СтрокаРасчета.ДатаВыпуска) Тогда
//				СтрокаРасчета.КоличествоЛетПрошедшихСГодаВыпускаТС = 
//					Год(ДатаКонцаПериодаОтчета) - Год(СтрокаРасчета.ДатаВыпуска);
//			КонецЕсли;
//			
//		КонецЦикла;
//		
//		КолонкиДляОпределенияСтавок = "КодПоОКТМОРегиона,КатегорияТС,НалоговаяБаза,КоличествоЛетПрошедшихСГодаВыпускаТС";
//		ТаблицаДляОпределенияСтавок = РасчетТранспортногоНалога.Скопировать(,КолонкиДляОпределенияСтавок);
//		ТаблицаДляОпределенияСтавок.Свернуть(КолонкиДляОпределенияСтавок);
//		
//		Запрос = Новый Запрос;
//		Запрос.УстановитьПараметр("ТаблицаДляОпределенияСтавок", ТаблицаДляОпределенияСтавок);
//		Запрос.УстановитьПараметр("Период", ДатаКонцаПериодаОтчета);
//		
//		Запрос.Текст = 
//		"ВЫБРАТЬ
//		|	ТаблицаДляОпределенияСтавок.КодПоОКТМОРегиона,
//		|	ТаблицаДляОпределенияСтавок.КатегорияТС,
//		|	ТаблицаДляОпределенияСтавок.НалоговаяБаза,
//		|	ТаблицаДляОпределенияСтавок.КоличествоЛетПрошедшихСГодаВыпускаТС
//		|ПОМЕСТИТЬ ВТДляОпределенияСтавок
//		|ИЗ
//		|	&ТаблицаДляОпределенияСтавок КАК ТаблицаДляОпределенияСтавок
//		|;
//		|
//		|////////////////////////////////////////////////////////////////////////////////
//		|ВЫБРАТЬ
//		|	МАКСИМУМ(СтавкиТранспортногоНалога.Период) КАК Период,
//		|	СтавкиТранспортногоНалога.ОКТМО,
//		|	СтавкиТранспортногоНалога.НаименованиеОбъектаНалогообложения,
//		|	СтавкиТранспортногоНалога.МинимальноеЗначениеМощности,
//		|	СтавкиТранспортногоНалога.МаксимальноеЗначениеМощности,
//		|	СтавкиТранспортногоНалога.МинимальноеКоличествоЛетСГодаВыпускаТС,
//		|	СтавкиТранспортногоНалога.МаксимальноеКоличествоЛетСГодаВыпускаТС,
//		|	ВТДляОпределенияСтавок.НалоговаяБаза,
//		|	ВТДляОпределенияСтавок.КоличествоЛетПрошедшихСГодаВыпускаТС
//		|ПОМЕСТИТЬ ВТПоследниеСтавки
//		|ИЗ
//		|	ВТДляОпределенияСтавок КАК ВТДляОпределенияСтавок
//		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтавкиТранспортногоНалога КАК СтавкиТранспортногоНалога
//		|		ПО ВТДляОпределенияСтавок.КодПоОКТМОРегиона = СтавкиТранспортногоНалога.ОКТМО
//		|			И ВТДляОпределенияСтавок.КатегорияТС = СтавкиТранспортногоНалога.НаименованиеОбъектаНалогообложения
//		|			И (СтавкиТранспортногоНалога.МинимальноеЗначениеМощности <= ВТДляОпределенияСтавок.НалоговаяБаза)
//		|			И (СтавкиТранспортногоНалога.МаксимальноеЗначениеМощности = 0
//		|				ИЛИ ВТДляОпределенияСтавок.НалоговаяБаза <= СтавкиТранспортногоНалога.МаксимальноеЗначениеМощности)
//		|			И (СтавкиТранспортногоНалога.МинимальноеКоличествоЛетСГодаВыпускаТС <= ВТДляОпределенияСтавок.КоличествоЛетПрошедшихСГодаВыпускаТС)
//		|			И (СтавкиТранспортногоНалога.МаксимальноеКоличествоЛетСГодаВыпускаТС = 0
//		|				ИЛИ ВТДляОпределенияСтавок.КоличествоЛетПрошедшихСГодаВыпускаТС <= СтавкиТранспортногоНалога.МаксимальноеКоличествоЛетСГодаВыпускаТС)
//		|ГДЕ
//		|	СтавкиТранспортногоНалога.Период < &Период
//		|
//		|СГРУППИРОВАТЬ ПО
//		|	СтавкиТранспортногоНалога.ОКТМО,
//		|	СтавкиТранспортногоНалога.НаименованиеОбъектаНалогообложения,
//		|	СтавкиТранспортногоНалога.МинимальноеЗначениеМощности,
//		|	СтавкиТранспортногоНалога.МаксимальноеЗначениеМощности,
//		|	СтавкиТранспортногоНалога.МинимальноеКоличествоЛетСГодаВыпускаТС,
//		|	СтавкиТранспортногоНалога.МаксимальноеКоличествоЛетСГодаВыпускаТС,
//		|	ВТДляОпределенияСтавок.НалоговаяБаза,
//		|	ВТДляОпределенияСтавок.КоличествоЛетПрошедшихСГодаВыпускаТС
//		|;
//		|
//		|////////////////////////////////////////////////////////////////////////////////
//		|ВЫБРАТЬ
//		|	ВТПоследниеСтавки.ОКТМО КАК КодПоОКТМОРегиона,
//		|	ВТПоследниеСтавки.НаименованиеОбъектаНалогообложения КАК КатегорияТС,
//		|	ВТПоследниеСтавки.НалоговаяБаза КАК НалоговаяБаза,
//		|	ВТПоследниеСтавки.КоличествоЛетПрошедшихСГодаВыпускаТС КАК КоличествоЛетПрошедшихСГодаВыпускаТС,
//		|	СтавкиТранспортногоНалога.МинимальноеКоличествоЛетСГодаВыпускаТС <> 0
//		|		ИЛИ СтавкиТранспортногоНалога.МаксимальноеКоличествоЛетСГодаВыпускаТС <> 0 КАК НалоговаяСтавкаЗависитОтГодаВыпускаТС,
//		|	СтавкиТранспортногоНалога.НалоговаяСтавка КАК НалоговаяСтавка
//		|ИЗ
//		|	ВТПоследниеСтавки КАК ВТПоследниеСтавки
//		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтавкиТранспортногоНалога КАК СтавкиТранспортногоНалога
//		|		ПО ВТПоследниеСтавки.Период = СтавкиТранспортногоНалога.Период
//		|			И ВТПоследниеСтавки.ОКТМО = СтавкиТранспортногоНалога.ОКТМО
//		|			И ВТПоследниеСтавки.НаименованиеОбъектаНалогообложения = СтавкиТранспортногоНалога.НаименованиеОбъектаНалогообложения
//		|			И ВТПоследниеСтавки.МинимальноеЗначениеМощности = СтавкиТранспортногоНалога.МинимальноеЗначениеМощности
//		|			И ВТПоследниеСтавки.МаксимальноеЗначениеМощности = СтавкиТранспортногоНалога.МаксимальноеЗначениеМощности
//		|			И ВТПоследниеСтавки.МинимальноеКоличествоЛетСГодаВыпускаТС = СтавкиТранспортногоНалога.МинимальноеКоличествоЛетСГодаВыпускаТС
//		|			И ВТПоследниеСтавки.МаксимальноеКоличествоЛетСГодаВыпускаТС = СтавкиТранспортногоНалога.МаксимальноеКоличествоЛетСГодаВыпускаТС";
//		
//		ТаблицаСтавок = Запрос.Выполнить().Выгрузить();
//		Отбор = Новый Структура(КолонкиДляОпределенияСтавок);
//		Для Каждого СтрокаРасчета Из РасчетТранспортногоНалога Цикл
//			ЗаполнитьЗначенияСвойств(Отбор, СтрокаРасчета);
//			НайденныеСтроки = ТаблицаСтавок.НайтиСтроки(Отбор);
//			Если НайденныеСтроки.Количество() > 0 Тогда
//				ЗаполнитьЗначенияСвойств(СтрокаРасчета, НайденныеСтроки[0], , КолонкиДляОпределенияСтавок);
//			КонецЕсли;
//		КонецЦикла;
//		
//		Если ГодовойРасчет Тогда
//			
//			РасчетНалога1Кв = ТаблицаРасчетТранспортногоНалога.СкопироватьКолонки();
//			РасчетНалога2Кв = ТаблицаРасчетТранспортногоНалога.СкопироватьКолонки();
//			РасчетНалога3Кв = ТаблицаРасчетТранспортногоНалога.СкопироватьКолонки();
//			
//			//
//			Отбор = Новый Структура("ИФНС, КодПоОКТМО, ОсновноеСредство");
//            //Отбор = Новый Структура("ИФНС, КодПоОКТМО, ОсновноеСредство, ДатаРегистрационныхДанных");
//			//
//			НайденнаяСтрока = РасчетТранспортногоНалога.Найти(Истина, "УплачиваютсяАвансы");
//			Если НайденнаяСтрока <> Неопределено Тогда
//				РасчетНалога1Кв = ПолучитьАвансовыйРасчетПоТранспортномуНалогу(Организация, Дата(Год(ПериодРасчета), 03, 31));
//				РасчетНалога1Кв.Индексы.Добавить("ИФНС, КодПоОКТМО, ОсновноеСредство, ДатаРегистрационныхДанных");
//				
//				РасчетНалога2Кв = ПолучитьАвансовыйРасчетПоТранспортномуНалогу(Организация, Дата(Год(ПериодРасчета), 06, 30));
//				РасчетНалога2Кв.Индексы.Добавить("ИФНС, КодПоОКТМО, ОсновноеСредство, ДатаРегистрационныхДанных");
//				
//				РасчетНалога3Кв = ПолучитьАвансовыйРасчетПоТранспортномуНалогу(Организация, Дата(Год(ПериодРасчета), 09, 30));
//				РасчетНалога3Кв.Индексы.Добавить("ИФНС, КодПоОКТМО, ОсновноеСредство, ДатаРегистрационныхДанных");
//			КонецЕсли;
//			
//		КонецЕсли;
//		
//		Для Каждого СтрокаРасчета Из РасчетТранспортногоНалога Цикл
//			
//			Если НЕ ГодовойРасчет И НЕ СтрокаРасчета.УплачиваютсяАвансы Тогда
//				Продолжить;
//			КонецЕсли;
//			
//			Если НетТСЗарегистрированныхВРеестреСистемыПлатон И СтрокаРасчета.ЗарегистрированоВРеестреСистемыПлатон Тогда
//				НетТСЗарегистрированныхВРеестреСистемыПлатон = Ложь;
//			КонецЕсли;
//			
//			// Для расчета используется та строка, в которой содержится информация о льготе.
//			Если СтрокаРасчета.КоличествоЗаписейЛьгот = 1
//			   И СтрокаРасчета.НалоговаяЛьгота = Перечисления.ВидыНалоговыхЛьготПоТранспортномуНалогу.НеПрименяется Тогда
//				Продолжить;
//			КонецЕсли;
//			
//			Если Год(ДатаКонцаПериодаОтчета) > 2015 
//			   И НачалоМесяца(СтрокаРасчета.ДатаРегистрации) = НачалоМесяца(СтрокаРасчета.ДатаПрекращенияРегистрации)
//			   И ((День(СтрокаРасчета.ДатаРегистрации) <= 15 И День(СтрокаРасчета.ДатаПрекращенияРегистрации) <= 15)
//			       ИЛИ (День(СтрокаРасчета.ДатаРегистрации) > 15 И День(СтрокаРасчета.ДатаПрекращенияРегистрации) > 15)) Тогда
//				Продолжить;
//			КонецЕсли;
//			
//			НоваяСтрока = ТаблицаРасчетТранспортногоНалога.Добавить();
//			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаРасчета, ,
//				"КоличествоМесяцевЛьготы,КодНалоговойЛьготы,РегиональныйКодЛьготы,
//				|ПроцентУменьшения,ЛьготнаяСтавка,КоличествоЛетПрошедшихСГодаВыпускаТС");
//				
//			Если СтрокаРасчета.НалоговаяСтавкаЗависитОтГодаВыпускаТС Тогда
//				НоваяСтрока.КоличествоЛетПрошедшихСГодаВыпускаТС = СтрокаРасчета.КоличествоЛетПрошедшихСГодаВыпускаТС;
//			КонецЕсли;
//			
//			КоличествоМесяцевВПериоде = ?(ГодовойРасчет, 12, 3);
//			Коэффициент = Окр(НоваяСтрока.КоличествоМесяцевВладения / КоличествоМесяцевВПериоде, 4);
//			
//			Если Год(ДатаКонцаПериодаОтчета) > 2014 ИЛИ (ГодовойРасчет И Год(ДатаКонцаПериодаОтчета) = 2014) Тогда
//				
//				Если НоваяСтрока.ДоляВПравеОбщейСобственностиЗнаменатель = 0 
//					ИЛИ НоваяСтрока.ДоляВПравеОбщейСобственностиЧислитель = 0 Тогда
//					
//					ДоляВПравеОбщейСобственности = 1;
//					
//				Иначе
//					
//					ДоляВПравеОбщейСобственности = НоваяСтрока.ДоляВПравеОбщейСобственностиЧислитель 
//						/ НоваяСтрока.ДоляВПравеОбщейСобственностиЗнаменатель;
//					
//				КонецЕсли;
//					
//			Иначе
//				
//				НоваяСтрока.ДоляВПравеОбщейСобственностиЗнаменатель = 0;
//				НоваяСтрока.ДоляВПравеОбщейСобственностиЧислитель = 0;
//				ДоляВПравеОбщейСобственности = 1;
//				
//			КонецЕсли;
//			
//			Если СтрокаРасчета.ПовышающийКоэффициент <> 0
//				И (Год(ДатаКонцаПериодаОтчета) >= 2015 ИЛИ (ГодовойРасчет И Год(ДатаКонцаПериодаОтчета) = 2014)) Тогда
//				
//				ПовышающийКоэффициент = СтрокаРасчета.ПовышающийКоэффициент;
//				
//			Иначе
//				
//				ПовышающийКоэффициент = 1;
//				НоваяСтрока.ПовышающийКоэффициент = 0;
//				
//			КонецЕсли;
//			
//			НоваяСтрока.СуммаНалога = Окр(Окр(НоваяСтрока.НалоговаяБаза 
//				* НоваяСтрока.НалоговаяСтавка 
//				* ДоляВПравеОбщейСобственности 
//				* Коэффициент
//				* ПовышающийКоэффициент
//				* ?(ГодовойРасчет, 1, 1 / 4), 2));
//			
//			НалоговаяЛьгота = СтрокаРасчета.НалоговаяЛьгота;
//			
//			Если НалоговаяЛьгота <> Перечисления.ВидыНалоговыхЛьготПоТранспортномуНалогу.НеПрименяется
//				И НалоговаяЛьгота <> Перечисления.ВидыНалоговыхЛьготПоТранспортномуНалогу.УменьшениеСуммыНалогаНаСумму Тогда 
//				
//				ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаРасчета,
//					"КоличествоМесяцевЛьготы,КодНалоговойЛьготы,РегиональныйКодЛьготы,ПроцентУменьшения,ЛьготнаяСтавка");
//				
//				КоэффициентЛьготы = Окр(НоваяСтрока.КоличествоМесяцевЛьготы / 12, 4);
//					
//				Если НалоговаяЛьгота = Перечисления.ВидыНалоговыхЛьготПоТранспортномуНалогу.ОсвобождениеОтНалогообложения Тогда 
//					
//					НоваяСтрока.СуммаНалоговойЛьготы = 
//						Окр(Окр(НоваяСтрока.НалоговаяБаза 
//							* НоваяСтрока.НалоговаяСтавка 
//							* КоэффициентЛьготы
//							* ДоляВПравеОбщейСобственности
//							* ПовышающийКоэффициент, 2));
//					
//				ИначеЕсли НалоговаяЛьгота = Перечисления.ВидыНалоговыхЛьготПоТранспортномуНалогу.УменьшениеСуммыНалогаВПроцентах Тогда 
//					
//					НоваяСтрока.СуммаНалоговойЛьготы = 
//						Окр(Окр(НоваяСтрока.НалоговаяБаза 
//							* НоваяСтрока.НалоговаяСтавка 
//							* КоэффициентЛьготы 
//							* (НоваяСтрока.ПроцентУменьшения / 100)
//							* ДоляВПравеОбщейСобственности
//							* ПовышающийКоэффициент, 2));
//					
//				ИначеЕсли НалоговаяЛьгота = Перечисления.ВидыНалоговыхЛьготПоТранспортномуНалогу.СнижениеНалоговойСтавки Тогда 
//					
//					НоваяСтрока.СуммаНалоговойЛьготы = 
//						Окр(Окр(НоваяСтрока.НалоговаяБаза 
//						* (НоваяСтрока.НалоговаяСтавка - НоваяСтрока.ЛьготнаяСтавка)
//						* КоэффициентЛьготы
//						* ДоляВПравеОбщейСобственности
//						* ПовышающийКоэффициент, 2));

//				КонецЕсли;
//				
//				
//			КонецЕсли;
//			
//			НоваяСтрока.СуммаНалогаКУплате = НоваяСтрока.СуммаНалога - НоваяСтрока.СуммаНалоговойЛьготы;
//			
//			Если ГодовойРасчет И СтрокаРасчета.УплачиваютсяАвансы Тогда
//				
//				ЗаполнитьЗначенияСвойств(Отбор, НоваяСтрока);
//				
//				СуммаНалоговогоВычета1Кв = 0;
//				НоваяСтрока.СуммаАвансовыхПлатежей1Кв = 0;
//				СтрокиРасчетаАвансовыхПлатежей = РасчетНалога1Кв.НайтиСтроки(Отбор);
//				Для Каждого СтрокаРасчетаАвансовыхПлатежей Из СтрокиРасчетаАвансовыхПлатежей Цикл
//					НоваяСтрока.СуммаАвансовыхПлатежей1Кв = НоваяСтрока.СуммаАвансовыхПлатежей1Кв
//						+ СтрокаРасчетаАвансовыхПлатежей.СуммаНалогаКУплате;
//					СуммаНалоговогоВычета1Кв = СуммаНалоговогоВычета1Кв + СтрокаРасчетаАвансовыхПлатежей.СуммаНалоговогоВычета;
//				КонецЦикла;
//				
//				СуммаНалоговогоВычета2Кв = 0;
//				НоваяСтрока.СуммаАвансовыхПлатежей2Кв = 0;
//				СтрокиРасчетаАвансовыхПлатежей = РасчетНалога2Кв.НайтиСтроки(Отбор);
//				Для Каждого СтрокаРасчетаАвансовыхПлатежей Из СтрокиРасчетаАвансовыхПлатежей Цикл
//					НоваяСтрока.СуммаАвансовыхПлатежей2Кв = НоваяСтрока.СуммаАвансовыхПлатежей2Кв
//						+ СтрокаРасчетаАвансовыхПлатежей.СуммаНалогаКУплате;
//					СуммаНалоговогоВычета2Кв = СуммаНалоговогоВычета2Кв + СтрокаРасчетаАвансовыхПлатежей.СуммаНалоговогоВычета;
//				КонецЦикла;
//				
//				СуммаНалоговогоВычета3Кв = 0;
//				НоваяСтрока.СуммаАвансовыхПлатежей3Кв = 0;
//				СтрокиРасчетаАвансовыхПлатежей = РасчетНалога3Кв.НайтиСтроки(Отбор);
//				Для Каждого СтрокаРасчетаАвансовыхПлатежей Из СтрокиРасчетаАвансовыхПлатежей Цикл
//					НоваяСтрока.СуммаАвансовыхПлатежей3Кв = НоваяСтрока.СуммаАвансовыхПлатежей3Кв
//						+ СтрокаРасчетаАвансовыхПлатежей.СуммаНалогаКУплате;
//					СуммаНалоговогоВычета3Кв = СуммаНалоговогоВычета3Кв + СтрокаРасчетаАвансовыхПлатежей.СуммаНалоговогоВычета;
//				КонецЦикла;
//				
//				НоваяСтрока.СуммаНалоговогоВычета = СуммаНалоговогоВычета1Кв + СуммаНалоговогоВычета2Кв + СуммаНалоговогоВычета3Кв;
//				
//				НоваяСтрока.СуммаНалогаКУплате = НоваяСтрока.СуммаНалогаКУплате - НоваяСтрока.СуммаАвансовыхПлатежей1Кв
//					- НоваяСтрока.СуммаАвансовыхПлатежей2Кв - НоваяСтрока.СуммаАвансовыхПлатежей3Кв;
//				
//			КонецЕсли;

//			Если НЕ ГодовойРасчет Тогда
//				НоваяСтрока["СуммаАвансовыхПлатежей" + Формат(ПериодРасчета, "ДФ='q''Кв'''")] = НоваяСтрока.СуммаНалогаКУплате;
//			КонецЕсли;
//			
//		КонецЦикла;
//		
//	КонецЕсли;
//	
//	ТаблицаРасчетТранспортногоНалога.ЗаполнитьЗначения(ДатаКонцаПериодаОтчета, "ПериодРасчета");
//	ТаблицаРасчетТранспортногоНалога.ЗаполнитьЗначения(Организация, "Организация");
//	
//	Возврат ТаблицаРасчетТранспортногоНалога;
//КонецФункции

