
&После("ПриСозданииНоменклатурыПоДаннымКонтрагента")
Процедура pcru_ex_ПриСозданииНоменклатурыПоДаннымКонтрагента(Знач НаборНоменклатурыКонтрагентов, Знач ОповещениеОЗавершении, СтандартнаяОбработка)
	// Так как уважаемые господа из Хлебушек-Эскорт не соблаговолили
	// Написать обработку заполнения, написана эта.
	// Когда сие чудо произойдет - их обработка перекроет нашу.
	// Правка от 25.04.2019 13:29:41  Севрюгин А.А.  
	СтандартнаяОбработка = Ложь;
	МассивДанных = ОповещениеОЗавершении.ДополнительныеПараметры.НаборЭлементовСопоставления;
	Для каждого ЭлементМассиваНоменклатурыКонтрагента Из МассивДанных Цикл
		НаименованиеНоменклатуры =  ЭлементМассиваНоменклатурыКонтрагента.НоменклатураКонтрагента.Наименование;
		ЭлементМассиваНоменклатурыКонтрагента.НоменклатураИБ.Номенклатура = pcru_ex_РаботаСДокументами.ПолучитьСоздатьНоменклатуру(НаименованиеНоменклатуры);
	КонецЦикла; 
	ВыполнитьОбработкуОповещения(ОповещениеОЗавершении, МассивДанных);
КонецПроцедуры
