
////&Вместо("ОбновлениеСправочникаРегламентированныеОтчеты")
//Процедура pcru_ex_ОбновлениеСправочникаРегламентированныеОтчеты(Параметры = Неопределено)
//	
//	ОбработкаОбновлениеОтчетов = Обработки.ОбновлениеРегламентированнойОтчетности.Создать();	
//	ДеревоОтчетов = ОбработкаОбновлениеОтчетов.ПолучитьСписокОтчетов();	
//	
//	МассивСтрокДляУдаления = Новый Массив;
//	
//	Для Каждого Строка Из ДеревоОтчетов.Строки Цикл
//		Если Строка.Источник <> "ОтчетностьНекредитныхФинансовыхОрганизаций" Тогда
//			МассивСтрокДляУдаления.Добавить(Строка);
//		КонецЕсли;
//	КонецЦикла;
//	
//	Для Каждого Строка Из МассивСтрокДляУдаления Цикл 
//		ДеревоОтчетов.Строки.Удалить(Строка);
//	КонецЦикла;
//	
//	Если ДеревоОтчетов.Строки.Количество() = 0 Тогда
//		Возврат;
//	КонецЕсли;
//	
//	ОбработкаОбновлениеОтчетов.ЗаполнитьСписокОтчетов(ДеревоОтчетов);

//КонецПроцедуры

//&Вместо("ОбновлениеСправочникаРегламентированныеОтчеты")
//Процедура pcru_ex_ОбновлениеСправочникаРегламентированныеОтчеты(Параметры = Неопределено)
//		ОбработкаОбновлениеОтчетов = Обработки.ОбновлениеРегламентированнойОтчетности.Создать();	
//	ДеревоОтчетов = ОбработкаОбновлениеОтчетов.ПолучитьСписокОтчетов();	
//	
//	МассивСтрокДляУдаления = Новый Массив;
//	
//	Для Каждого Строка Из ДеревоОтчетов.Строки Цикл
//		Если Строка.Источник <> "ОтчетностьНекредитныхФинансовыхОрганизаций" Тогда
//			МассивСтрокДляУдаления.Добавить(Строка);
//		КонецЕсли;
//	КонецЦикла;
//	
//	Для Каждого Строка Из МассивСтрокДляУдаления Цикл 
//		ДеревоОтчетов.Строки.Удалить(Строка);
//	КонецЦикла;
//	
//	Если ДеревоОтчетов.Строки.Количество() = 0 Тогда
//		Возврат;
//	КонецЕсли;
//	
//	ОбработкаОбновлениеОтчетов.ЗаполнитьСписокОтчетов(ДеревоОтчетов);

//КонецПроцедуры
