//++ Севрюгин А.А  26.02.2020 10:51:01 DEV1C-307
&НаСервере
&Вместо("ДатаПриИзмененииНаСервере")
Процедура pcru_ex_ДатаПриИзмененииНаСервере()
	УстановитьФункциональныеОпцииФормы();
	
//	ЗаполнитьЗависимыеСчета("Дата");
	// {БНФО} 

	БНФОУправлениеФормойНаСервере();
//	БНФООчиститьСчетаУчетаДокументаСоставногоТипа();
	УстановитьВидимостьСчетовУчета();
	
	// {/БНФО}
	УправлениеФормой(ЭтаФорма);

КонецПроцедуры

//&НаКлиенте
//&ИзменениеИКонтроль("ОткрытьФормуРедактированияСчетовЗатрат")
//Процедура pcru_ex_ОткрытьФормуРедактированияСчетовЗатрат(ФормаОткрытаИзШапки)

//	СвойстваСтруктуры = Новый Массив;
//	СвойстваСтруктуры.Добавить("ТолькоПросмотр");
//	СвойстваСтруктуры.Добавить("ДатаДокумента");
//	СвойстваСтруктуры.Добавить("Организация");
//	СвойстваСтруктуры.Добавить("СчетаУчетаЗатратВТаблице");
//	СвойстваСтруктуры.Добавить("Номенклатура");
//	СвойстваСтруктуры.Добавить("СпособУчетаНДС");
//	СвойстваСтруктуры.Добавить("КлючНазначенияИспользования");
//	СвойстваСтруктуры.Добавить("СчетЗатрат");
//	СвойстваСтруктуры.Добавить("ПодразделениеЗатрат");
//	СвойстваСтруктуры.Добавить("Субконто1");
//	СвойстваСтруктуры.Добавить("Субконто2");
//	СвойстваСтруктуры.Добавить("Субконто3");
//	СвойстваСтруктуры.Добавить("ФормаОткрытаИзШапки");
//	ПараметрыФормы = Новый Структура(СтрСоединить(СвойстваСтруктуры, ","));

//	ПараметрыФормы.ТолькоПросмотр              = ТолькоПросмотр;
//	ПараметрыФормы.ДатаДокумента               = Объект.Дата;
//	ПараметрыФормы.КлючНазначенияИспользования = "РасходМатериалов";
//	ПараметрыФормы.Организация                 = Объект.Организация;
//	ПараметрыФормы.СчетаУчетаЗатратВТаблице    = Объект.СчетаУчетаЗатратВТаблице;
//	ПараметрыФормы.ФормаОткрытаИзШапки         = ФормаОткрытаИзШапки;

//	РеквизитыДляЗаполнения = Новый Массив;
//	РеквизитыДляЗаполнения.Добавить("СчетЗатрат");
//	РеквизитыДляЗаполнения.Добавить("ПодразделениеЗатрат");
//	РеквизитыДляЗаполнения.Добавить("Субконто1");
//	РеквизитыДляЗаполнения.Добавить("Субконто2");
//	РеквизитыДляЗаполнения.Добавить("Субконто3");
//	РеквизитыДляЗаполнения.Добавить("СпособУчетаНДС");

//	Если ФормаОткрытаИзШапки Тогда
//		Источник = Объект;
//	Иначе
//		ДанныеСтроки = Новый Структура("СчетЗатрат, ПодразделениеЗатрат, НоменклатурнаяГруппа, СтатьяЗатрат, Номенклатура, СпособУчетаНДС");
//		// {БНФО}							
//		ДанныеСтроки.Вставить("БНФОСтатьяЗатрат");
//		// {/БНФО}							
//		ЗаполнитьЗначенияСвойств(ДанныеСтроки, Элементы.Материалы.ТекущиеДанные);
//		Источник = АналитикаСчетаЗатратСтрокиТаблицы(ДанныеСтроки);
//		РеквизитыДляЗаполнения.Добавить("Номенклатура");
//	КонецЕсли;
//	ЗаполнитьЗначенияСвойств(ПараметрыФормы, Источник, СтрСоединить(РеквизитыДляЗаполнения, ","));

//	#Вставка
//	Если ФормаОткрытаИзШапки Тогда
//		ПараметрыФормы.Вставить("Субконто1", Объект.БНФОСубконто1);
//		ПараметрыФормы.Вставить("Субконто2", Объект.БНФОСубконто2);
//		ПараметрыФормы.Вставить("Субконто3", Объект.БНФОСубконто3);
//	Иначе
//		ПараметрыФормы.Вставить("Субконто1", ДанныеСтроки.БНФОСубконто1);
//		ПараметрыФормы.Вставить("Субконто2", ДанныеСтроки.БНФОСубконто2);
//		ПараметрыФормы.Вставить("Субконто3", ДанныеСтроки.БНФОСубконто3);
//	КонецЕсли;
//	#КонецВставки
//	// {БНФО}

//	Если БНФОИспользуетсяУчетНФО Тогда
//		Если ФормаОткрытаИзШапки Тогда
//			ПараметрыФормы.Вставить("БНФОСтатьяЗатрат",	Объект.БНФОСтатьяЗатрат);
//		Иначе
//			ПараметрыФормы.Вставить("БНФОСтатьяЗатрат",	ДанныеСтроки.БНФОСтатьяЗатрат);
//		КонецЕсли;
//		ПараметрыФормы.Вставить("БНФОПереводитьВСоставОбъектовСтроительства", 		Объект.БНФОПереводитьВСоставОбъектовСтроительства);
//		ПараметрыФормы.Вставить("ПодразделениеОрганизации",	Объект.ПодразделениеОрганизации);
//		ПараметрыФормы.Вставить("БНФОПризнакДоверительногоУправления",	Объект.БНФОПризнакДоверительногоУправления);
//		ПараметрыФормы.Вставить("БНФОВидДеятельностиНПФ",	Объект.БНФОВидДеятельностиНПФ);
//		//ПараметрыФормы.Вставить("БНФОДополнительнаяАналитика",	Объект.БНФОДополнительнаяАналитика);
//		ПараметрыФормы.Вставить("БНФОСПОД", 		Объект.БНФОСПОД);
//		ПараметрыФормы.Вставить("БНФОСписывать", 		БНФОСписывать);
//		ПараметрыФормы.Вставить("ЭтоТребованиеНакладная", 		Истина);

//		ОткрытьФорму("ОбщаяФорма.БНФОРедактированиеСчетаЗатрат", ПараметрыФормы, ЭтотОбъект);
//		Возврат;
//	КонецЕсли; 
//	// {/БНФО}
//	ОткрытьФорму("ОбщаяФорма.РедактированиеСчетаЗатрат", ПараметрыФормы, ЭтотОбъект);

//КонецПроцедуры
//-- Севрюгин А.А  26.02.2020 10:51:01 Администратор
 
