
&НаСервере
Процедура ОчиститьСтатусНаСервере(Ссылка)
	Объект = Ссылка.ПолучитьОбъект();
	Объект.Выполнено = Ложь;
	Объект.Результат = "";
	Объект.Записать();
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьСтатус(Команда)
	Если Элементы.Список.ТекущиеДанные <> Неопределено Тогда
		ОчиститьСтатусНаСервере(Элементы.Список.ТекущиеДанные.Ссылка);
	КонецЕсли; 
	Элементы.Список.Обновить();
КонецПроцедуры

&НаСервере
Процедура ЗапуститьВРучномРежимеНаСервере(Ссылка)
	pcru_ex_РегламентныеОперации.ВыполнитьРегламентнуюОперацию(Ссылка);	//ФоновыеЗадания.Выполнить("pcru_ex_РегламентныеОперации.ВыполнитьРегламентныеОперации", Новый Массив);
КонецПроцедуры

&НаКлиенте
Процедура ЗапуститьВРучномРежиме(Команда)
	Если Элементы.Список.ТекущиеДанные <> Неопределено Тогда
		ОчиститьСтатусНаСервере(Элементы.Список.ТекущиеДанные.Ссылка);
		ЗапуститьВРучномРежимеНаСервере(Элементы.Список.ТекущиеДанные.Ссылка);
		Элементы.Список.Обновить();
		
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСтатусЗагрузки()
	ОбновитьСтатусЗагрузкиСрв();	
КонецПроцедуры

&НаСервере
Процедура ОбновитьСтатусЗагрузкиСрв()
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ  ПЕРВЫЕ 1
	|	pcru_ex_ЗапланированноеВыполнениеРегламентныхЗаданий.ТекущаяДата КАК ТекущаяДата,
	|	pcru_ex_ЗапланированноеВыполнениеРегламентныхЗаданий.ТекущаяПроводка КАК ТекущаяПроводка,
	|	pcru_ex_ЗапланированноеВыполнениеРегламентныхЗаданий.ТекущаяСтрока КАК ТекущаяСтрока,
	|	ВЫБОР
	|		КОГДА pcru_ex_ЗапланированноеВыполнениеРегламентныхЗаданий.КоличествоДат = 0
	|			ТОГДА 0
	|		ИНАЧЕ ВЫРАЗИТЬ(pcru_ex_ЗапланированноеВыполнениеРегламентныхЗаданий.НомерДаты / pcru_ex_ЗапланированноеВыполнениеРегламентныхЗаданий.КоличествоДат * 100 КАК ЧИСЛО(3, 0))
	|	КОНЕЦ КАК ПроцентДат,
	|	ВЫБОР
	|		КОГДА pcru_ex_ЗапланированноеВыполнениеРегламентныхЗаданий.КоличествоПроводок = 0
	|			ТОГДА 0
	|		ИНАЧЕ ВЫРАЗИТЬ(pcru_ex_ЗапланированноеВыполнениеРегламентныхЗаданий.НомерПроводки / pcru_ex_ЗапланированноеВыполнениеРегламентныхЗаданий.КоличествоПроводок * 100 КАК ЧИСЛО(3, 0))
	|	КОНЕЦ КАК ПроцентПроводок,
	|	ВЫБОР
	|		КОГДА pcru_ex_ЗапланированноеВыполнениеРегламентныхЗаданий.КоличествоСтрок = 0
	|			ТОГДА 0
	|		ИНАЧЕ ВЫРАЗИТЬ(pcru_ex_ЗапланированноеВыполнениеРегламентныхЗаданий.ТекущаяСтрока / pcru_ex_ЗапланированноеВыполнениеРегламентныхЗаданий.КоличествоСтрок * 100 КАК ЧИСЛО(3, 0))
	|	КОНЕЦ КАК ПроцентСтрок
	|ИЗ
	|	Справочник.pcru_ex_ЗапланированноеВыполнениеРегламентныхЗаданий КАК pcru_ex_ЗапланированноеВыполнениеРегламентныхЗаданий
	|ГДЕ
	|	pcru_ex_ЗапланированноеВыполнениеРегламентныхЗаданий.Выполняется";
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
//		Элементы.СтатусЗагрузки.Видимость = Истина;	
		ЭтаФорма.ПроцентЗагрузки = Выборка.ПроцентДат;
		ЭтаФорма.ТекущаяДата = Выборка.ТекущаяДата;
		ЭтаФорма.ПроцентЗагрузки1 = Выборка.ПроцентПроводок;
		ЭтаФорма.ТекуцаяПроводка = Выборка.ТекущаяПроводка;
		
	//Иначе
	//	Элементы.СтатусЗагрузки.Видимость = Ложь;	
	КонецЕсли;
КонецПроцедуры // ()

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПодключитьОбработчикОжидания("ОбновитьСтатусЗагрузки", 30);
КонецПроцедуры

&НаКлиенте
Процедура ПрогрессЗагрузкиВФоне(Команда)
	
	Элементы.ГруппаПрогрессЗагрузки.Видимость = НЕ Элементы.ГруппаПрогрессЗагрузки.Видимость;

КонецПроцедуры
