
#Область ОтчетMIS

// СчетДт.Код В ("71701","71501","71005","71002","71003", "71004", "71006", "71101", "71102", "71103", "71202", "71502", "71512", "71702", "71802", "71801", "72003", "72004", "72006", "72101", "72102", "72103", "72202", "72502", "72512", "72702", "72802"))

Функция СчетВГруппе1(Код)
	
	Возврат 
	
//	Код = "71001" или
	//
	Код = "71902" или
	Код = "71903" или
	
	Код = "71006" или
	Код = "71003" или
//	Код = "71502" или
	//
//	Код = "71002" или
	//Код = "71005" или
	Код = "71104" или
//	Код = "71501" или
//	Код = "71201" или
	Код = "71507" или
//	Код = "71601" или
	Код = "71602" или
//	Код = "71701" или
	Код = "71801" или
	Код = "72001" или
	Код = "72002" или
	Код = "72005" или
	Код = "72104" или
	Код = "72201" или
	Код = "72501" или
	Код = "72511" или
	Код = "72601" или
	Код = "72602" или
	Код = "72701" или
	Код = "72801"
	;
КонецФункции // СчетВГруппе1()

//(СчетКт.Код В ("71702","71502","71003","71006", "71001", "71002", "71005", "71104", "71501", "71201", "71507", "71511", "71601", "71602", "71701", "71801", "71802", "72001", "72002", "72005", "72104", "72201", "72501", "72511", "72601", "72602", "72701", "72801")

Функция СчетВГруппе2(Код)
	Возврат 
	
	Код = "71001" или
	Код = "71002" или
	Код = "71005" или	
	Код = "71006" или
	Код = "71201" или
	Код = "71202" или
	Код = "71501" или
	Код = "71502" или
	Код = "71601" или
	Код = "71701" или
	Код = "71511" или
	Код = "71512" или
		
	Код = "71003" или
	//
	Код = "71901" или
	Код = "71902" или
	Код = "71903" или
	
	Код = "71701" или 
	Код = "71501" или
	//	
	Код = "71004" или
	Код = "71101" или
	Код = "71102" или
	Код = "71103" или
	Код = "71702" или
	Код = "71802" или
	Код = "72003" или
	Код = "72004" или
	Код = "72006" или
	Код = "72101" или
	Код = "72102" или
	Код = "72103" или
	Код = "72202" или
	Код = "72502" или
	Код = "72512" или
	Код = "72702" или
	Код = "72802"
	;
КонецФункции // СчетВГруппе1()

Функция ОтчетMIS_ПолучитьCostCenter(СчетДт, СчетКт, ПодразделениеДт, ПодразделениеКт) Экспорт
	
	CostCenter = "";
	
	Если СчетВГруппе1(СокрЛП(СчетКт.Владелец.Код)) Тогда
		CostCenter = УдалитьВсеСимволыКромеЦифрИзСтроки(ПодразделениеКт);
	КонецЕсли;
	
	Если СчетВГруппе2(СокрЛП(СчетДт.Владелец.Код)) Тогда
		CostCenter = Формат(УдалитьВсеСимволыКромеЦифрИзСтроки(ПодразделениеДт), "ЧЦ=; ЧВН=; ЧГ=0");
	КонецЕсли;

	Если СчетВГруппе2(СокрЛП(СчетКт.Владелец.Код)) Тогда
		CostCenter = Формат(УдалитьВсеСимволыКромеЦифрИзСтроки(ПодразделениеКт), "ЧЦ=; ЧВН=; ЧГ=0");
	КонецЕсли;

	Возврат CostCenter;
КонецФункции

Функция ОтчетMIS_AccountNumber(СчетДт, СчетКт, СубконтоДт1, СубконтоКт1) Экспорт
	
	AccountNumber = 0;
	Если СчетВГруппе1(СокрЛП(СчетКт.Владелец.Код)) Тогда
		AccountNumber = УдалитьВсеСимволыКромеЦифрИзСтроки(СубконтоКт1);
	КонецЕсли;
	
	Если СчетВГруппе2(СокрЛП(СчетДт.Владелец.Код)) Тогда
		AccountNumber = Формат(УдалитьВсеСимволыКромеЦифрИзСтроки(СубконтоДт1), "ЧЦ=; ЧВН=; ЧГ=0");
	КонецЕсли;

	Если СчетВГруппе2(СокрЛП(СчетКт.Владелец.Код)) Тогда
		AccountNumber = Формат(УдалитьВсеСимволыКромеЦифрИзСтроки(СубконтоКт1), "ЧЦ=; ЧВН=; ЧГ=0");
	КонецЕсли;

	Попытка
		AccountNumber = Формат(Число(AccountNumber), "ЧЦ=; ЧВН=; ЧГ=0"); 
	Исключение
	КонецПопытки; 

	Возврат AccountNumber;
	
КонецФункции

Функция ОтчетMIS_Note(СчетДт, СчетКт, СубконтоДт1, СубконтоКт1) Экспорт
	
	Note = "";
	Если СчетВГруппе1(СокрЛП(СчетКт.Владелец.Код)) Тогда
		Note = Сред(СубконтоКт1.Наименование, 7);
	КонецЕсли;
	
	Если СчетВГруппе2(СокрЛП(СчетДт.Владелец.Код)) Тогда
		ПозицияПробела = СтрНайти(СубконтоДт1.Наименование, " ");
		Если ПозицияПробела > 0 Тогда
			Note = Сред(СубконтоДт1.Наименование, ПозицияПробела);
		Иначе
			Note = СубконтоДт1.Наименование;
		КонецЕсли; 
	КонецЕсли;

	Если СчетВГруппе2(СокрЛП(СчетКт.Владелец.Код)) Тогда
		ПозицияПробела = СтрНайти(СубконтоКт1.Наименование, " ");
		Если ПозицияПробела > 0 Тогда
			Note = Сред(СубконтоКт1.Наименование, ПозицияПробела);
		Иначе
			Note = СубконтоКт1.Наименование;
		КонецЕсли; 
	КонецЕсли;

	Возврат Note;
	
КонецФункции

Функция ОтчетMIS_Invoice(Регистратор) Экспорт
	
	ВремСтрока = СтрЗаменить(СтрПолучитьСтроку(СтрЗаменить(Строка(Регистратор)," от ",Символы.ПС),1)," ",Символы.ПС);		
	Invoice = СтрПолучитьСтроку(ВремСтрока, СтрЧислоСтрок(ВремСтрока));
	Возврат Invoice;
	
КонецФункции

Функция ОтчетMIS_Debit(СчетДт, СчетКт, Сумма) Экспорт
	Debit = "";
	
	Если СчетВГруппе1(СокрЛП(СчетКт.Владелец.Код)) Тогда
		Debit = 0;
	КонецЕсли;
	
	Если СчетВГруппе2(СокрЛП(СчетДт.Владелец.Код)) Тогда
		Debit = Сумма;
	КонецЕсли;

	Если СчетВГруппе2(СокрЛП(СчетКт.Владелец.Код)) Тогда
		Debit = 0;
	КонецЕсли;

	Возврат Debit;

КонецФункции

Функция ОтчетMIS_Credit(СчетДт, СчетКт, Сумма) Экспорт
	Credit = "";
	
	Если СчетВГруппе1(СокрЛП(СчетКт.Владелец.Код)) Тогда
		Credit = Сумма;
	КонецЕсли;
	
	Если СчетВГруппе2(СокрЛП(СчетДт.Владелец.Код)) Тогда
		Credit = 0;
	КонецЕсли;

	Если СчетВГруппе2(СокрЛП(СчетКт.Владелец.Код)) Тогда
		Credit = Сумма;
	КонецЕсли;

	Возврат Credit;

КонецФункции

Функция ОтчетMIS_ProcessCodeId(СчетДт, СчетКт, СубконтоДт2, СубконтоКт2) Экспорт
	
	ProcessCodeId = "";
	Если СчетВГруппе1(СокрЛП(СчетКт.Владелец.Код)) Тогда
		ProcessCodeId = "";
	КонецЕсли;
	
	Если СчетВГруппе2(СокрЛП(СчетДт.Владелец.Код)) Тогда
		ProcessCodeId = УдалитьВсеСимволыКромеЦифрИзСтроки(СубконтоДт2);
	КонецЕсли;

	Если СчетВГруппе2(СокрЛП(СчетКт.Владелец.Код)) Тогда
		ProcessCodeId = УдалитьВсеСимволыКромеЦифрИзСтроки(СубконтоКт2);
	КонецЕсли;

	Возврат ProcessCodeId;
	
КонецФункции

Функция ОтчетMIS_type(СчетДт, СчетКт, СубконтоДт2, СубконтоДт3, СубконтоКт2, СубконтоКт3) Экспорт
	
	type = "";
	Если СчетВГруппе1(СокрЛП(СчетКт.Владелец.Код)) Тогда
		type = "";
	КонецЕсли;
	
	Если СчетВГруппе2(СокрЛП(СчетДт.Владелец.Код)) Тогда
		Попытка
			СК3 =  Строка(СубконтоДт3);
			Если СК3 <> "Тип затрат 1" и СК3 <> "Тип затрат 2" Тогда
				СК3 = "";
			КонецЕсли;
		Исключение
			СК3 = "";
		КонецПопытки;
		
		Если СК3 = "" Тогда
			Попытка
				СК3 =  Строка(СубконтоДт2);
				Если СК3 <> "Тип затрат 1" и СК3 <> "Тип затрат 2" Тогда
					СК3  = "";
				КонецЕсли; 
			Исключение
				СК3  = "";
			КонецПопытки; 
		КонецЕсли; 
		type = СК3;
	КонецЕсли;

	Если СчетВГруппе2(СокрЛП(СчетКт.Владелец.Код)) Тогда
		Попытка
			СК3 =  Строка(СубконтоКт3);
			Если СК3 <> "Тип затрат 1" и СК3 <> "Тип затрат 2" Тогда
				СК3  = "";
			КонецЕсли; 
		Исключение
			СК3  = "";
		КонецПопытки; 
		Если СК3  = "" Тогда
			Попытка
				СК3 =  Строка(СубконтоКт2);
				Если СК3 <> "Тип затрат 1" и СК3 <> "Тип затрат 2" Тогда
					СК3  = "";
				КонецЕсли; 
			Исключение
				СК3  = "";
			КонецПопытки; 
		КонецЕсли; 
		type = СК3;
	КонецЕсли;

	Возврат type;

КонецФункции
	
#КонецОбласти

Функция УдалитьВсеСимволыКромеЦифрИзСтроки(СтрокаДляОчистки)
	
	Результат = "";
	Для Сч = 1 По СтрДлина(СтрокаДляОчистки) Цикл
		ТекущийСимвол = Сред(СтрокаДляОчистки,Сч,1);
		Если Найти("0123456789", ТекущийСимвол) <> 0 Тогда
			Результат = Результат + ТекущийСимвол;
		ИначеЕсли ТекущийСимвол = " " Тогда
			Прервать;
		КонецЕсли; 
	КонецЦикла; 
	
	Возврат Результат;
КонецФункции
