
&Вместо("ОписаниеОграниченияДанных")
Функция pcru_ex_ОписаниеОграниченияДанных(ОбщийКонтекст, ПолноеИмя, БезВызоваИсключения)
		Ограничение = Новый Структура;
	Ограничение.Вставить("Текст", "");
	Ограничение.Вставить("ТекстДляВнешнихПользователей", "");
	Ограничение.Вставить("ПоВладельцуБезЗаписиКлючейДоступа", Неопределено);
	Ограничение.Вставить("ПоВладельцуБезЗаписиКлючейДоступаДляВнешнихПользователей", Неопределено);
	Ограничение.Вставить("ТекстВМодулеМенеджера", Ложь);
	
	ТекстВМодулеМенеджера = ОбщийКонтекст.СпискиСОграничением.Получить(ПолноеИмя);
	Если ТекстВМодулеМенеджера = Неопределено Тогда
		Возврат Ограничение;
	КонецЕсли;
	
	Ограничение.ТекстВМодулеМенеджера = ТекстВМодулеМенеджера;
	
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.РаботаСФайлами") Тогда
		МодульРаботаСФайламиСлужебный = ОбщегоНазначения.ОбщийМодуль("РаботаСФайламиСлужебный");
		ЭтоСправочникФайлов = МодульРаботаСФайламиСлужебный.ЭтоСправочникФайловИлиВерсийФайлов(ПолноеИмя);
	Иначе
		ЭтоСправочникФайлов = Ложь;
	КонецЕсли;
	
	Если ЭтоЖурналДокументов(ПолноеИмя) Или ЭтоСправочникФайлов Тогда
		// Для журналов документов ограничение должно быть
		// по документу-владельцу без записи ключей доступа, если не требуется другое.
		// Аналогично (по умолчанию) для справочников файлов и версий файлов.
		Ограничение.ПоВладельцуБезЗаписиКлючейДоступа = Истина;
		Ограничение.ПоВладельцуБезЗаписиКлючейДоступаДляВнешнихПользователей = Истина;
	КонецЕсли;
	
	Если ТекстВМодулеМенеджера Тогда
		Менеджер = ОбщегоНазначения.МенеджерОбъектаПоПолномуИмени(ПолноеИмя);
		
		Попытка
			Менеджер.ПриЗаполненииОграниченияДоступа(Ограничение);
		Исключение
			//ИнформацияОбОшибке = ИнформацияОбОшибке();
			//ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			//	НСтр("ru = '""%1"" указан, как список с ограничением доступа в процедуре
			//	           |ПриЗаполненииСписковСОграничениемДоступа общего модуля УправлениеДоступомПереопределяемый.
			//	           |
			//	           |Некорректно указано ограничение доступа этого списка в модуле менеджера
			//	           |в процедуре ПриЗаполненииОграниченияДоступа по причине:
			//	           |
			//	           |%2'"),
			//	ПолноеИмя,
			//	ПодробноеПредставлениеОшибки(ИнформацияОбОшибке));
			//
			//Если БезВызоваИсключения Тогда
			//	Возврат ТекстОшибки;
			//КонецЕсли;
			//ВызватьИсключение ТекстОшибки;
		КонецПопытки;
	Иначе
		ОбъектМетаданных = Метаданные.НайтиПоПолномуИмени(ПолноеИмя);
		Попытка
			УправлениеДоступомПереопределяемый.ПриЗаполненииОграниченияДоступа(ОбъектМетаданных, Ограничение);
		Исключение
			ИнформацияОбОшибке = ИнформацияОбОшибке();
			ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = '""%1"" указан, как список с ограничением доступа в процедуре
				           |ПриЗаполненииСписковСОграничениемДоступа общего модуля УправлениеДоступомПереопределяемый.
				           |
				           |Некорректно указано ограничение доступа этого списка в общем модуле УправлениеДоступомПереопределяемый
				           |в процедуре ПриЗаполненииОграниченияДоступа по причине:
				           |
				           |%2'"),
				ПолноеИмя,
				ПодробноеПредставлениеОшибки(ИнформацияОбОшибке));
			
			Если БезВызоваИсключения Тогда
				Возврат ТекстОшибки;
			КонецЕсли;
			ВызватьИсключение ТекстОшибки;
		КонецПопытки;
	КонецЕсли;
	
	Если ЭтоЖурналДокументов(ПолноеИмя)
	   И (    Ограничение.ПоВладельцуБезЗаписиКлючейДоступа <> Истина
		  Или Ограничение.ПоВладельцуБезЗаписиКлючейДоступаДляВнешнихПользователей <> Истина) Тогда
		
		Если ТекстВМодулеМенеджера Тогда
			ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = '""%1"" указан, как список с ограничением доступа в процедуре
				           |ПриЗаполненииСписковСОграничениемДоступа общего модуля УправлениеДоступомПереопределяемый.
				           |
				           |Некорректно указано ограничение доступа этого списка в модуле менеджера
				           |в процедуре ПриЗаполненииОграниченияДоступа по причине:
				           |
				           |Для журналов документов не поддерживается ограничение, как для регистров,
				           |то есть, кроме варианта ограничения по владельцу без записи ключей доступа:
				           |
				           |РазрешитьЧтениеИзменение
				           |ГДЕ
				           |	ЧтениеОбъектаРазрешено(Ссылка)'"),
				ПолноеИмя);
		Иначе
			ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = '""%1"" указан, как список с ограничением доступа в процедуре
				           |ПриЗаполненииСписковСОграничениемДоступа общего модуля УправлениеДоступомПереопределяемый.
				           |
				           |Некорректно указано ограничение доступа этого списка в общем модуле УправлениеДоступомПереопределяемый
				           |в процедуре ПриЗаполненииОграниченияДоступа по причине:
				           |
				           |Для журналов документов не поддерживается ограничение, как для регистров,
				           |то есть, кроме варианта ограничения по владельцу без записи ключей доступа:
				           |
				           |РазрешитьЧтениеИзменение
				           |ГДЕ
				           |	ЧтениеОбъектаРазрешено(Ссылка)'"),
				ПолноеИмя);
		КонецЕсли;
		Если БезВызоваИсключения Тогда
			Возврат ТекстОшибки;
		КонецЕсли;
		ВызватьИсключение ТекстОшибки;
	КонецЕсли;
	
	Возврат Ограничение;

КонецФункции
