

&Вместо("ВидНалоговогоОбязательстваПоИмени")
Функция pcru_ex_ВидНалоговогоОбязательстваПоИмени(ИмяНалоговогоОбязательства)
	Для Каждого ЗначениеПеречисления Из Метаданные.Перечисления.ВидыПлатежейВГосБюджет.ЗначенияПеречисления Цикл
		
		Если ВРег(ЗначениеПеречисления.Синоним) = ВРег(ИмяНалоговогоОбязательства) Тогда
			Возврат Перечисления.ВидыПлатежейВГосБюджет[ЗначениеПеречисления.Имя];
		КонецЕсли;

		
		Если ВРег(ЗначениеПеречисления.Имя) = ВРег(ИмяНалоговогоОбязательства) Тогда
			Возврат Перечисления.ВидыПлатежейВГосБюджет[ЗначениеПеречисления.Имя];
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Перечисления.ВидыПлатежейВГосБюджет.ПустаяСсылка();

КонецФункции
