
&НаСервере
Процедура ЗаполнитьТЧНаСервере()
	//Определение = Новый WSОпределения("http://ruspbpacc01/DOCMNG/ws/DocumentWorkflow.1cws?wsdl","WS","WS159753");
	//Прокси = Новый WSПрокси(Определение, "http://ruspbpacc01/DocumentWorkflow","Pcru_DocumentWorkflow" ,"Pcru_DocumentWorkflowSoap" );       
	//Прокси.Пользователь = "WS";      Прокси.Пароль = "WS159753";
	
	ВебСервис = Справочники.ОбменДаннымиКлиенты.НайтиПоКоду("DOCMNG");
	Определение = Новый WSОпределения(ВебСервис.МестоположениеWSDL,ВебСервис.Пользователь,ВебСервис.Пароль,,,,False);
	Прокси = Новый WSПрокси(Определение,ВебСервис.URIПространстваИменСервиса, ВебСервис.ИмяСервиса, ВебСервис.ИмяТочкиПодключения,,,,,False);       
	Прокси.Пользователь = ВебСервис.Пользователь;
	Прокси.Пароль = ВебСервис.Пароль;

	Результат = Прокси.GetCostItemList();
	СтруктураПараметров                   = pcru_ex_WSWORKS.СтрокуJSONВСтруктуру(Результат);
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьТЧ(Команда)
	ЗаполнитьТЧНаСервере();
КонецПроцедуры
