
&Вместо("ЗначениеКлючаАналитики")
Функция pcru_ex_ЗначениеКлючаАналитики(ПараметрыАналитики, ИмяРегистра, ИмяСправочника)
	ИзмеренияРегистра = Метаданные.РегистрыСведений[ИмяРегистра].Измерения;
	
	МенеджерЗаписи = РегистрыСведений[ИмяРегистра].СоздатьМенеджерЗаписи();
	
	ЗаполнитьЗначенияСвойств(МенеджерЗаписи, ПараметрыАналитики, СтруктураИзмерений(ИзмеренияРегистра));
	ПроверитьЗаполнениеПолей(МенеджерЗаписи, ИзмеренияРегистра);
	
	Попытка
		МенеджерЗаписи.Прочитать();
		
		Если МенеджерЗаписи.Выбран() И ЗначениеЗаполнено(МенеджерЗаписи.КлючАналитики) Тогда
			Результат = МенеджерЗаписи.КлючАналитики;
		Иначе
			Результат = СоздатьКлючАналитики(ПараметрыАналитики, ИмяРегистра, ИмяСправочника);
		КонецЕсли;
	Исключение
		Результат = СоздатьКлючАналитики(ПараметрыАналитики, ИмяРегистра, ИмяСправочника);
	КонецПопытки; 
	
	Возврат Результат;
	
КонецФункции
