
&НаКлиенте
Процедура pcru_ex_КонтрагентПриИзмененииПосле(Элемент)
	ПриИзмененииРеквизитов();
КонецПроцедуры

&НаКлиенте
Процедура pcru_ex_ДоговорКонтрагентаПриИзмененииПосле(Элемент)
	ПриИзмененииРеквизитов();
КонецПроцедуры

&НаСервере
Процедура ПриИзмененииРеквизитов()
	Если ЗначениеЗаполнено(ЭтотОбъект.Объект.Контрагент) и ЗначениеЗаполнено(ЭтотОбъект.Объект.ДоговорКонтрагента) Тогда
	    ЭтотОбъект.Объект.СчетУчетаРасчетовСКонтрагентом  = pcru_УМФО.ПолучитьСчетПоАналитике("60311",ЭтотОбъект.Объект.Контрагент,ЭтотОбъект.Объект.ДоговорКонтрагента);
		Если не ЗначениеЗаполнено(ЭтотОбъект.Объект.СчетУчетаРасчетовСКонтрагентом) Тогда
			 ЭтотОбъект.Объект.СчетУчетаРасчетовСКонтрагентом =  pcru_УМФО.Открыть60311(ЭтотОбъект.Объект.Контрагент,ЭтотОбъект.Объект.ДоговорКонтрагента,"000000059");
		КонецЕсли; 
		ЭтотОбъект.Объект.СчетУчетаРасчетовПоАвансам  =pcru_УМФО.ПолучитьСчетПоАналитике("60312",ЭтотОбъект.Объект.Контрагент,ЭтотОбъект.Объект.ДоговорКонтрагента);
		ЭтотОбъект.Объект.СпособЗачетаАвансов = Перечисления.СпособыЗачетаАвансов.Автоматически;
		ЭтотОбъект.Объект.БНФОПризнакДоверительногоУправления = Перечисления.БНФОПризнакиДоверительногоУправления.СобственныеОперации;
	КонецЕсли; 
	ПоступлениеТоваровУслугФормы.УстановитьПорядокУчетаРасчетов(ЭтаФорма);
КонецПроцедуры


&НаКлиенте
Процедура pcru_ex_УслугиСодержаниеПриИзмененииПосле(Элемент)
	// Вставить содержимое обработчика.
КонецПроцедуры

