
&НаСервере
Процедура ЗаполнитьНаСервере()
	
	ComConnection = pcru_ex_ВнешниеСоединения.СоздатьВнешнееСоединение("1S","ЗУП");
	
	ВнешнийСписок = ComConnection.NewObject("Массив");
	
	Выборка = РегистрыСведений.pcru_ex_СопоставлениеВнешнихДанных.Выбрать();
	Пока Выборка.Следующий() Цикл
		ВнешнийСписок.Добавить(Сокрлп(Выборка.КодВнешнихДанных));	
	КонецЦикла;
	
	
	Запрос5 = ComConnection.NewObject("Запрос");
	Запрос5.Текст = "ВЫБРАТЬ
	|	ПодразделенияОрганизаций.Код КАК Код,
	|	ПодразделенияОрганизаций.Наименование КАК Наименование
	|ИЗ
	|	Справочник.ПодразделенияОрганизаций КАК ПодразделенияОрганизаций
	|ГДЕ
	|	не ПодразделенияОрганизаций.Код В (&Код)";
	Запрос5.УстановитьПараметр("Код", ВнешнийСписок);	
	Результат5 = Запрос5.Выполнить();
	Выборка5 = Результат5.Выбрать();
	Пока Выборка5.Следующий() Цикл
		
		новаяСтрока = ЭтотОбъект.ТАблицаСопоставления.Добавить(); 	
		новаяСтрока.Наименование = Выборка5.Наименование;
		новаяСтрока.Код = Выборка5.Код;
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	ПодразделенияОрганизаций.Ссылка КАК Ссылка
		|ИЗ                      
		|	Справочник.ПодразделенияОрганизаций КАК ПодразделенияОрганизаций
		|ГДЕ
		|	ПодразделенияОрганизаций.Наименование = &Наименование
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ПодразделенияОрганизаций.Ссылка
		|ИЗ
		|	Справочник.ПодразделенияОрганизаций КАК ПодразделенияОрганизаций
		|ГДЕ
		|	ПодразделенияОрганизаций.Код = &Код";
		Запрос.УстановитьПараметр("Наименование",Выборка5.Наименование );
		Запрос.УстановитьПараметр("Код",Выборка5.Код );
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			новаяСтрока.Подразделение = Выборка.Ссылка;
		КонецЦикла;
		
		
	КонецЦикла;
	
	
КонецПроцедуры

&НаКлиенте
Процедура Заполнить(Команда)
	ЗаполнитьНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗаписатьНаСервере()
	УстановитьПривилегированныйРежим(Истина);
	Для каждого СтрокаТЧ Из ЭтотОбъект.ТАблицаСопоставления Цикл
		Если ЗначениеЗаполнено(СтрокаТЧ.Подразделение) тогда
			Мз = РегистрыСведений.pcru_ex_СопоставлениеВнешнихДанных.СоздатьМенеджерЗаписи();
			Мз.КодВнешнихДанных =  СтрокаТЧ.Код;
			Мз.ТипДанных = Справочники.pcru_ex_ТипыВнешнихДанных.НайтиПоНаименованию("Подразделение");
			Мз.Значение = СтрокаТЧ.Подразделение;
			Мз.Записать(Истина);
		Конецесли;
	КонецЦикла;
	ЭтотОбъект.ТАблицаСопоставления.Очистить(); 
КонецПроцедуры

&НаКлиенте
Процедура Записать(Команда)
	ЗаписатьНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьИзПосдеднегоДокументаОтражениеЗарплатыНаСервере()
	ComConnection = pcru_ex_ВнешниеСоединения.СоздатьВнешнееСоединение("1S","ЗУП");
	
	ВнешнийСписок = ComConnection.NewObject("Массив");
	
	Выборка = РегистрыСведений.pcru_ex_СопоставлениеВнешнихДанных.Выбрать();
	Пока Выборка.Следующий() Цикл
		ВнешнийСписок.Добавить(Сокрлп(Выборка.КодВнешнихДанных));	
	КонецЦикла;
	
	
	Запрос5 = ComConnection.NewObject("Запрос");
	Запрос5.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	|	ОтражениеЗарплатыВБухучете.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ ВременнаяТаблица
	|ИЗ
	|	Документ.ОтражениеЗарплатыВБухучете КАК ОтражениеЗарплатыВБухучете
	|
	|УПОРЯДОЧИТЬ ПО
	|	ОтражениеЗарплатыВБухучете.Номер УБЫВ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ОтражениеЗарплатыВБухучетеНачисленнаяЗарплатаИВзносы.Подразделение.Код КАК Код,
	|	ОтражениеЗарплатыВБухучетеНачисленнаяЗарплатаИВзносы.Подразделение.Наименование КАК Наименование
	|ИЗ
	|	ВременнаяТаблица КАК ВременнаяТаблица
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ОтражениеЗарплатыВБухучете.НачисленнаяЗарплатаИВзносы КАК ОтражениеЗарплатыВБухучетеНачисленнаяЗарплатаИВзносы
	|		ПО (ВременнаяТаблица.Ссылка = ОтражениеЗарплатыВБухучетеНачисленнаяЗарплатаИВзносы.Ссылка)
	|ГДЕ
	|	НЕ ОтражениеЗарплатыВБухучетеНачисленнаяЗарплатаИВзносы.Подразделение.Код ЕСТЬ NULL
	|   и не ОтражениеЗарплатыВБухучетеНачисленнаяЗарплатаИВзносы.Подразделение.Код В (&Код)";
	Запрос5.УстановитьПараметр("Код", ВнешнийСписок);	
	Результат5 = Запрос5.Выполнить();
	Выборка5 = Результат5.Выбрать();
	Пока Выборка5.Следующий() Цикл
		
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	ПодразделенияОрганизаций.Ссылка
		|ИЗ
		|	Справочник.ПодразделенияОрганизаций КАК ПодразделенияОрганизаций
		|ГДЕ
		|	ПодразделенияОрганизаций.Код = &Код  и не ПодразделенияОрганизаций.ПометкаУдаления";
		Запрос.УстановитьПараметр("Наименование",Выборка5.Наименование );
		Запрос.УстановитьПараметр("Код",Выборка5.Код );
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			Продолжить;
		КонецЕсли;
		
		
		новаяСтрока = ЭтотОбъект.ТАблицаСопоставления.Добавить(); 	
		новаяСтрока.Наименование = Выборка5.Наименование;
		новаяСтрока.Код = Выборка5.Код;
		
				Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	ПодразделенияОрганизаций.Ссылка КАК Ссылка
		|ИЗ                      
		|	Справочник.ПодразделенияОрганизаций КАК ПодразделенияОрганизаций
		|ГДЕ
		|	ПодразделенияОрганизаций.Наименование = &Наименование
		|   и не ПодразделенияОрганизаций.ПометкаУдаления
		|";
		Запрос.УстановитьПараметр("Наименование",Выборка5.Наименование );
		Запрос.УстановитьПараметр("Код",Выборка5.Код );
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			новаяСтрока.Подразделение = Выборка.Ссылка;
		КонецЕсли;

		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьИзПосдеднегоДокументаОтражениеЗарплаты(Команда)
	ЗаполнитьИзПосдеднегоДокументаОтражениеЗарплатыНаСервере();
КонецПроцедуры
