
&НаКлиенте
&После("СчетОрганизацииПриИзменении")
Процедура pcru_ex_СчетОрганизацииПриИзменении(Элемент)
УстановитьСчетБанка();
КонецПроцедуры

&НаСервере
Процедура УстановитьСчетБанка()
	
	Если ЭтотОбъект.Объект.СчетОрганизации.НомерСчета = "40702810400000000944" Тогда
		ЭтотОбъект.Объект.СчетБанк   = Справочники.БНФОСчетаАналитическогоУчета.НайтиПоКоду("2050181000000000000500000");
	КонецЕсли;
	
	Если ЭтотОбъект.Объект.СчетОрганизации.НомерСчета = "40702810603300479930" Тогда
		ЭтотОбъект.Объект.СчетБанк   = Справочники.БНФОСчетаАналитическогоУчета.НайтиПоКоду("2050181000000000000100000");
	КонецЕсли;
	
	Если ЭтотОбъект.Объект.СчетОрганизации.НомерСчета = "40702810703200479930" Тогда
		ЭтотОбъект.Объект.СчетБанк   = Справочники.БНФОСчетаАналитическогоУчета.НайтиПоКоду("2050181000000000000200000");
	КонецЕсли;
	
	Если ЭтотОбъект.СчетОрганизации.НомерСчета = "40702810803100479930" Тогда
		ЭтотОбъект.Объект.СчетБанк   = Справочники.БНФОСчетаАналитическогоУчета.НайтиПоКоду("2050181000000000000300000");
	КонецЕсли;
	
	Если ЭтотОбъект.Объект.СчетОрганизации.НомерСчета = "40702810903000479930" Тогда
		ЭтотОбъект.Объект.СчетБанк   = Справочники.БНФОСчетаАналитическогоУчета.НайтиПоКоду("2050181000000000000400000");
	КонецЕсли;
	
	Если ЭтотОбъект.Объект.СчетОрганизации.НомерСчета = "40702978803000479930" Тогда
		ЭтотОбъект.Объект.СчетБанк   = Справочники.БНФОСчетаАналитическогоУчета.НайтиПоКоду("2050197800000000000100000");
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
&ИзменениеИКонтроль("ОткрытьФормуТаблицы")
Процедура pcru_ex_ОткрытьФормуТаблицы()

	Если СписаниеСРасчетногоСчетаФормыКлиентСервер.ЕстьРасшифровкаПлатежа(ЭтотОбъект) Тогда

		ОткрытьФормуРасшифровкаПлатежа();

	ИначеЕсли Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийСписаниеДенежныхСредств.ПеречислениеЗП") Тогда

		ОткрытьФормуПеречислениеЗаработнойПлаты();

	ИначеЕсли Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийСписаниеДенежныхСредств.ПеречислениеДепонентов") Тогда

		ОткрытьФормуПеречислениеДепонентов();

	ИначеЕсли Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийСписаниеДенежныхСредств.ПеречислениеНалога") Тогда

		#Удаление
		ОткрытьФормуПеречислениеНДФЛ();
		#КонецУдаления
		
		#Вставка
		Если СтрНайти(ВРег(Строка(ОБъект.Налог)), "НДФЛ") > 0 Тогда
			ОткрытьФормуПеречислениеНДФЛ();
		Иначе
			ОткрытьФормуПеречислениеНалога();
		КонецЕсли;
		#КонецВставки

	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуПеречислениеНалога()
	
	Отказ = Ложь;
	
	// Проверим, чтобы ключевые поля документы были заполнены, чтобы в дополнительной форме отборы работали корректно.
	Если НЕ ЗначениеЗаполнено(Объект.Дата) Тогда
		ТекстСообщения = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения("Поле", "Заполнение", НСтр("ru = 'Дата'"));
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,, "Дата", "Объект", Отказ);
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Объект.Организация) Тогда
		ТекстСообщения = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения("Поле", "Заполнение", НСтр("ru = 'Организация'"));
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,, "Организация", "Объект", Отказ);
	КонецЕсли;
		
	Если НЕ ЗначениеЗаполнено(Объект.СчетОрганизации) Тогда
		
		Если ИспользоватьНесколькоБанковскихСчетовОрганизации Тогда
			ТекстСообщения = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения("Поле", "Заполнение", НСтр("ru = 'Банковский счет'"));
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,, "СчетОрганизации", "Объект", Отказ);
		Иначе
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Реквизиты банковского счета не заполнены'"),, "РеквизитыОрганизацииСсылка",, Отказ);
		КонецЕсли;
		
	КонецЕсли;
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ТолькоПросмотр Тогда
		ЗаблокироватьДанныеФормыДляРедактирования();
	КонецЕсли;
	
	Если Объект.pcru_ex_РасшифровкаНалога.Количество() < 2 Тогда
		// Актуальные данные содержатся в реквизитах формы,
		// перенесем их в табличную часть.
		ЗаполнитьРасшифровкаНалогаИзРеквизитовФормы();
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура();
	
	Шапка = Новый Структура("Организация, ВалютаДокумента");
	ЗаполнитьЗначенияСвойств(Шапка, Объект);
	
	ПараметрыФормы.Вставить("Шапка", Шапка);

	
	АдресХранилищаРасшифровкаНалога = ПоместитьРасшифровкаНалогаВоВременноеХранилищеНаСервере();
	ПараметрыФормы.Вставить("АдресХранилищаРасшифровкаНалога", АдресХранилищаРасшифровкаНалога);
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("Ключ",           Параметры.Ключ);
	СтруктураПараметров.Вставить("ПараметрыФормы", ПараметрыФормы);
	СтруктураПараметров.Вставить("ТолькоПросмотр", ТолькоПросмотр);
	
	ОткрытьФорму("Документ.СписаниеСРасчетногоСчета.Форма.ФормаРасшифровкаНалога", СтруктураПараметров, ЭтотОбъект);
	
КонецПроцедуры

&НаСервере
Функция ПоместитьРасшифровкаНалогаВоВременноеХранилищеНаСервере()
	
	Возврат ПоместитьВоВременноеХранилище(Объект.pcru_ex_РасшифровкаНалога.Выгрузить(), УникальныйИдентификатор);
	
КонецФункции

&НаСервере
Процедура ЗаполнитьРасшифровкаНалогаИзРеквизитовФормы() Экспорт
	
	Если Объект.pcru_ex_РасшифровкаНалога.Количество() = 0 Тогда
		СтрокаПлатеж = Объект.pcru_ex_РасшифровкаНалога.Добавить();
	Иначе
		СтрокаПлатеж = Объект.pcru_ex_РасшифровкаНалога[0];
	КонецЕсли;
	
	СтрокаПлатеж.Сумма = Объект.СуммаДокумента;
	СтрокаПлатеж.СчетУчетаРасчетов = Объект.СчетУчетаРасчетовСКонтрагентом;
	
КонецПроцедуры

&НаКлиенте
Процедура pcru_ex_ОбработкаВыбораПосле(ВыбранноеЗначение, ИсточникВыбора)
	
	Если ИсточникВыбора.ИмяФормы = "Документ.СписаниеСРасчетногоСчета.Форма.ФормаРасшифровкаНалога" Тогда
		ОбработкаВыбораРасшифровкаНалогаНаСервере(ВыбранноеЗначение);
		pcru_ex_ПриСозданииНаСервереПосле(Ложь, ИСТИНА);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаВыбораРасшифровкаНалогаНаСервере(ВыбранноеЗначение)
	
	ТаблицаРасшифровкаНалога = ПолучитьИзВременногоХранилища(ВыбранноеЗначение.АдресХранилищаРасшифровкаНалога);
	Объект.pcru_ex_РасшифровкаНалога.Загрузить(ТаблицаРасшифровкаНалога);
	
	Если Объект.pcru_ex_РасшифровкаНалога.Итог("Сумма") > 0 Тогда
		Объект.СуммаДокумента = Объект.pcru_ex_РасшифровкаНалога.Итог("Сумма");
	КонецЕсли;
	
	ОтобразитьГиперссылкуПерейтиВТаблицу();
	
	Модифицированность = Истина;
	
	ПредлагатьНовыйДоговор = Ложь;
	
КонецПроцедуры

&НаСервере
Процедура pcru_ex_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	
	Элементы.СуммаДокумента.ТолькоПросмотр = Объект.pcru_ex_РасшифровкаНалога.Количество() > 1;
	
КонецПроцедуры

&НаСервере
&После("ОтобразитьГиперссылкуПерейтиВТаблицу")
Процедура pcru_ex_ОтобразитьГиперссылкуПерейтиВТаблицу()
	
	Если Объект.ВидОперации = Перечисления.ВидыОперацийСписаниеДенежныхСредств.ПеречислениеНалога Тогда
		Если СтрНайти(ВРег(Строка(ОБъект.Налог)), "НДФЛ") = 0 Тогда
			Элементы.НадписьРазбитьПлатеж.Видимость = ИСТИНА;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры
