
&НаКлиенте
Процедура pcru_ex_ПриОткрытииПосле(Отказ)
	Элементы.ГруппаНалоговыйОрган.Видимость = Истина;
КонецПроцедуры

&НаСервере
Процедура pcru_ex_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	
	Элемент = pcru_РаботаСФормамиСервер.ДобавитьПолеВвода(ЭтаФорма, "pcru_ProcessCode", Элементы.PCRU_ДополнительныеРеквизиты, "Объект.pcru_ProcessCode");
	Элементы.Переместить(Элемент, Элементы.PCRU_ДополнительныеРеквизиты, Элемент);

КонецПроцедуры

&НаСервере
Процедура pcru_ex_ПриЧтенииНаСервереПосле(ТекущийОбъект)
	
	НаборЗаписей = РегистрыСведений.pcru_ex_ТипыЗатратПодразделений.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Подразделение.Установить(Объект.Ссылка);
	НаборЗаписей.Прочитать();
	Для Каждого Строка Из НаборЗаписей Цикл
		pcru_ТипЗатрат = Строка.ТипЗатрат;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура pcru_ex_pcru_ТипЗатратПриИзмененииПосле(Элемент)
	Модифицированность = Истина;
КонецПроцедуры

&НаСервере
Процедура pcru_ex_ПослеЗаписиНаСервереПосле(ТекущийОбъект, ПараметрыЗаписи)
	
	НаборЗаписей = РегистрыСведений.pcru_ex_ТипыЗатратПодразделений.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Подразделение.Установить(Объект.Ссылка);
	
	Если ЗначениеЗаполнено(pcru_ТипЗатрат) Тогда
		НаборЗаписей.Прочитать();
		ЗаписыватьРегистр = Ложь;	
		Если НаборЗаписей.Количество() <> 0 Тогда
			Для Каждого Строка Из НаборЗаписей Цикл
				Если pcru_ТипЗатрат <> Строка.ТипЗатрат Тогда
					Строка.ТипЗатрат = pcru_ТипЗатрат;
					ЗаписыватьРегистр = Истина;
				КонецЕсли;
			КонецЦикла;
		Иначе
			стрНабора = НаборЗаписей.Добавить();
			стрНабора.Подразделение = Объект.Ссылка;
			стрНабора.ТипЗатрат = pcru_ТипЗатрат;
			ЗаписыватьРегистр = Истина;
		КонецЕсли;
	Иначе
		ЗаписыватьРегистр = Истина;
	КонецЕсли;
	
	Если ЗаписыватьРегистр Тогда
		НаборЗаписей.Записать();
	КонецЕсли;
	
КонецПроцедуры
