
//&Вместо("ДвоичныеДанныеФайла")
//Функция pcru_ex_ДвоичныеДанныеФайла(Знач ПрисоединенныйФайл, Знач ВызыватьИсключение = Истина) Экспорт
//	
//	ОбщегоНазначенияКлиентСервер.ПроверитьПараметр("РаботаСФайлами.ДвоичныеДанныеФайла", "ПрисоединенныйФайл", 
//		ПрисоединенныйФайл, Метаданные.ОпределяемыеТипы.ПрисоединенныйФайл.Тип);
//	
//	ФайлОбъект = РаботаСФайламиСлужебный.ФайлОбъект(ПрисоединенныйФайл);
//	Если ФайлОбъект = Неопределено
//		И Не ВызыватьИсключение Тогда
//		Возврат Неопределено;
//	КонецЕсли;
//	
//	УстановитьПривилегированныйРежим(Истина);
//	Если ФайлОбъект.ТипХраненияФайла = Перечисления.ТипыХраненияФайлов.ВИнформационнойБазе Тогда
//		
//		Результат = ХранилищеФайлаИзИнформационнойБазы(ФайлОбъект.Ссылка);
//		Если Результат <> Неопределено Тогда
//			Возврат Результат.Получить();
//		ИначеЕсли Не ВызыватьИсключение Тогда
//			Возврат Неопределено;
//		КонецЕсли;
//		
//		// Запись в журнал регистрации.
//		СообщениеОбОшибке = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
//			НСтр("ru = 'Двоичные данные файла отсутствуют в регистре ДвоичныеДанныеФайла
//			           |
//			           |Ссылка на файл: ""%1"".'"),
//			ПолучитьНавигационнуюСсылку(ПрисоединенныйФайл));
//		ЗаписьЖурналаРегистрации(НСтр("ru = 'Файлы.Открытие файла'", ОбщегоНазначения.КодОсновногоЯзыка()),
//			УровеньЖурналаРегистрации.Ошибка,
//			Метаданные.Справочники[ПрисоединенныйФайл.Метаданные().Имя],
//			ПрисоединенныйФайл,
//			СообщениеОбОшибке);
//		
//		ПредставлениеВладельцаФайла = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
//				НСтр("ru = 'Присоединен к %1 : %2'"),
//				Строка(ТипЗнч(ФайлОбъект.ВладелецФайла)),
//				ФайлОбъект.ВладелецФайла);
//		
//		//ВызватьИсключение РаботаСФайламиСлужебный.ОшибкаФайлНеНайденВХранилищеФайлов(
//		//	ФайлОбъект.Наименование + "." + ФайлОбъект.Расширение,
//		//	Ложь,
//		//	ПредставлениеВладельцаФайла);
//	Иначе
//		ПолныйПуть = РаботаСФайламиСлужебный.ПолныйПутьТома(ФайлОбъект.Том) + ФайлОбъект.ПутьКФайлу;
//		
//		Попытка
//			Возврат Новый ДвоичныеДанные(ПолныйПуть);
//		Исключение
//			
//			Если Не ВызыватьИсключение Тогда
//				Возврат Неопределено;
//			КонецЕсли;
//			
//			// Запись в журнал регистрации.
//			СообщениеОбОшибке = ТекстОшибкиПриПолученииФайла(ИнформацияОбОшибке(), ПрисоединенныйФайл);
//			ЗаписьЖурналаРегистрации(НСтр("ru = 'Файлы.Получение файла из тома'", ОбщегоНазначения.КодОсновногоЯзыка()),
//				УровеньЖурналаРегистрации.Ошибка,
//				Метаданные.Справочники[ПрисоединенныйФайл.Метаданные().Имя],
//				ПрисоединенныйФайл,
//				СообщениеОбОшибке);
//			
//			ПредставлениеВладельцаФайла = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
//					НСтр("ru = 'Присоединен к %1 : %2'"),
//					Строка(ТипЗнч(ФайлОбъект.ВладелецФайла)),
//					ФайлОбъект.ВладелецФайла);
//				
//			ВызватьИсключение РаботаСФайламиСлужебный.ОшибкаФайлНеНайденВХранилищеФайлов(
//				ФайлОбъект.Наименование + "." + ФайлОбъект.Расширение,
//				,
//				ПредставлениеВладельцаФайла);
//				
//		КонецПопытки;
//	КонецЕсли;
//	
//КонецФункции

