
&НаКлиенте
Процедура pcru_ex_ОсновныеСредстваОсновноеСредствоПриИзмененииПосле(Элемент)
Элемент.Родитель.ТекущиеДанные.БНФОСчетУчета = П2("60401",Элемент.Родитель.ТекущиеДанные.ОсновноеСредство);
Если не ЗначениеЗаполнено(Элемент.Родитель.ТекущиеДанные.БНФОСчетУчета) Тогда
Элемент.Родитель.ТекущиеДанные.БНФОСчетУчета =	П1(Элемент.Родитель.ТекущиеДанные.ОсновноеСредство);
КонецЕсли; 
Элемент.Родитель.ТекущиеДанные.БНФОСчетНачисленияАмортизации =  П2("60414",Элемент.Родитель.ТекущиеДанные.ОсновноеСредство);
КонецПроцедуры
 

&НаСервере
Функция  П1(ос)
	Возврат pcru_УМФО.Открыть60401(ос);
КонецФункции

&НаСервере
Функция  П2(СЧ,ос)
	Возврат pcru_УМФО.ПолучитьСчетПоАналитике(СЧ,ос);
КонецФункции

