
&Вместо("ОпределитьПовторнуюВыдачуЗайма")
Процедура pcru_ex_ОпределитьПовторнуюВыдачуЗайма(Форма)
		Если ТипЗнч(Форма) = Тип("УправляемаяФорма") Тогда
		Объект = Форма.Объект;
	Иначе
		Объект = Форма;
	КонецЕсли;
	
	Количество 	= 0;
	
	Если Не ЗначениеЗаполнено(Объект.Контрагент) Тогда
		Возврат;
	КонецЕсли; 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ АЭ_ВзаиморасчетыПоЗаймамПредоставленнымОбороты.Займ) КАК КоличествоЗаймов
	|ИЗ
	|	РегистрНакопления.АЭ_ВзаиморасчетыПоЗаймамПредоставленным.Обороты(
	|			,
	|			&Период,
	|			Период,
	|			Организация = &Организация
	|				И Контрагент = &Контрагент
	|				И Займ <> &ТекущийЗайм) КАК АЭ_ВзаиморасчетыПоЗаймамПредоставленнымОбороты";
	
	Запрос.УстановитьПараметр("Организация", 	Объект.Организация);
	Запрос.УстановитьПараметр("ТекущийЗайм", 	Объект.Ссылка);
	Запрос.УстановитьПараметр("Контрагент", 	Объект.Контрагент);
	Запрос.УстановитьПараметр("Период", 		Объект.Дата);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		Количество = Выборка.КоличествоЗаймов;
	КонецЕсли;
	
	Попытка
     	Объект.ПовторнаяВыдачаЗаймов = (Количество <> 0);
	Исключение
	КонецПопытки; 

КонецПроцедуры
