
&Вместо("ПроверитьНаСовпадающиеСтроки")
Процедура pcru_ex_ПроверитьНаСовпадающиеСтроки(ТаблицаСовпадений, ИмяТабличнойЧасти, СписокКолонок, Отказ)
	
	Если ИмяТабличнойЧасти = "Состав" И СписокКолонок = "РБП" Тогда
		Запрос = Новый Запрос;
		
		Запрос.УстановитьПараметр("ТаблицаСостав", Состав.Выгрузить(, "НомерСтроки, РБП, Субконто1, Субконто2, Субконто3"));
		Запрос.Текст =
		"ВЫБРАТЬ
		|	Состав.НомерСтроки,
		|	Состав.Субконто1,
		|	Состав.Субконто2,
		|	Состав.Субконто3,
		|	Состав.РБП
		|ПОМЕСТИТЬ Состав
		|ИЗ
		|	&ТаблицаСостав КАК Состав
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Состав.Субконто1,
		|	Состав.Субконто2,
		|	Состав.Субконто3,
		|	Состав.РБП,
		|	КОЛИЧЕСТВО(1) КАК КоличествоСовпадений
		|ИЗ
		|	Состав КАК Состав
		|
		|СГРУППИРОВАТЬ ПО
		|	Состав.Субконто1,
		|	Состав.Субконто2,
		|	Состав.Субконто3,
		|	Состав.РБП";

		ТаблицаСовпадений = Запрос.Выполнить().Выгрузить();
	КонецЕсли;
	
	ПродолжитьВызов(ТаблицаСовпадений, ИмяТабличнойЧасти, СписокКолонок, Отказ);
	
КонецПроцедуры
