Функция ВидыНачисленийОплатыТрудаПоИмени(ИмяНалоговогоОбязательства)  экспорт
	Для Каждого ЗначениеПеречисления Из Метаданные.Перечисления.ВидыНачисленийОплатыТрудаДляНУ.ЗначенияПеречисления Цикл
		
		Если ВРег(ЗначениеПеречисления.Синоним) = ВРег(ИмяНалоговогоОбязательства) Тогда
			Возврат Перечисления.ВидыНачисленийОплатыТрудаДляНУ[ЗначениеПеречисления.Имя];
		КонецЕсли;

		
		Если ВРег(ЗначениеПеречисления.Имя) = ВРег(ИмяНалоговогоОбязательства) Тогда
			Возврат Перечисления.ВидыНачисленийОплатыТрудаДляНУ[ЗначениеПеречисления.Имя];
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Перечисления.ВидыНачисленийОплатыТрудаДляНУ.ПустаяСсылка();

КонецФункции