
&НаСервере
Процедура pcru_ex_ПриСозданииНаСервереВместо(Отказ, СтандартнаяОбработка)
	// Обработчик подсистемы "Свойства"
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("Объект", Объект);
	ДополнительныеПараметры.Вставить("ИмяЭлементаДляРазмещения", "ГруппаДополнительныеРеквизиты");
	УправлениеСвойствами.ПриСозданииНаСервере(ЭтаФорма, ДополнительныеПараметры);
КонецПроцедуры

&НаКлиенте
Процедура pcru_ex_ПриОткрытииПосле(Отказ)
	ЭтотОбъект.ДопСведения.Параметры.УстановитьЗначениеПараметра("Объект",ЭтотОбъект.Объект.Ссылка);
	ЭтотОбъект.ДопСведения.Отбор.Элементы.Очистить();
	ЭлементОтбора = ЭтотОбъект.ДопСведения.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.Использование = Истина;
	ЭлементОтбора.ПравоеЗначение = ЭтотОбъект.Объект.Ссылка;
	
КонецПроцедуры

&НаСервере
Процедура pcru_ex_ПередЗаписьюНаСервереВместо(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	УправлениеСвойствами.ПередЗаписьюНаСервере(ЭтаФорма, ТекущийОбъект);
КонецПроцедуры
