
&НаКлиенте
Процедура pcru_ex_ПередЗаписьюПосле(Отказ, ПараметрыЗаписи)
	
	ЗаписатьРеквизитыБНФО();
КонецПроцедуры

&НаСервере
Процедура ЗаписатьРеквизитыБНФО()
	Объект.БНФОСчетУчетаНДСУплаченного = БНФОУчетнаяПолитика.БНФОСчетУчетаНДСУплаченного(Объект.Организация, Объект.Дата);
	Для Каждого Строка Из Объект.ДокументыОснования Цикл
		Попытка
			Объект.БНФОСчетУчетаРасчетовСКонтрагентом = Строка.ДокументОснование.СчетУчетаРасчетовСКонтрагентом;
		Исключение
		КонецПопытки;
		
		Попытка
			Объект.БНФОСчетУчетаРасчетовПоАвансам = Строка.ДокументОснование.СчетУчетаРасчетовПоАвансам;
		Исключение
		КонецПопытки;
	КонецЦикла;

КонецПроцедуры