
&После("ОбработкаПроведения")
Процедура pcru_ex_ОбработкаПроведения(Отказ, РежимПроведения)
	
	ТаблицаУсловияДоговоровАренды = ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаБНФОУсловияДоговоровАренды;
	
	Если Отказ ИЛИ ТаблицаУсловияДоговоровАренды.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;

	ТаблицаУсловияДоговоровАренды.Колонки.Добавить("СчетРасходовБУ");
	ТаблицаУсловияДоговоровАренды.ЗаполнитьЗначения(pcru_ex_СчетРасходовБУ, "СчетРасходовБУ");
	pcru_ex_БНФОУсловияДоговоровАренды = Движения.pcru_ex_БНФОУсловияДоговоровАренды;
	pcru_ex_БНФОУсловияДоговоровАренды.Записывать = Истина;
	pcru_ex_БНФОУсловияДоговоровАренды.Загрузить(ТаблицаУсловияДоговоровАренды);

КонецПроцедуры
