
&Вместо("СоздатьНовыйСчетУчета")
Функция pcru_ex_СоздатьНовыйСчетУчета(СтруктураЗаполнения, Отказ)
	ТекстЗапроса =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	СчетаАналитическогоУчета.Ссылка
	|ИЗ
	|	Справочник.БНФОСчетаАналитическогоУчета КАК СчетаАналитическогоУчета
	|ГДЕ
	//	|	СчетаАналитическогоУчета.Ссылка <> &Ссылка
	|	 СчетаАналитическогоУчета.Организация = &Организация	
	|	И СчетаАналитическогоУчета.Код = &Код	
	|";
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Организация", СтруктураЗаполнения.Организация);
	Запрос.УстановитьПараметр("Код", СтруктураЗаполнения.Код);
	Запрос.Текст = ТекстЗапроса;
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий()  Тогда
		Возврат Выборка.Ссылка;
	Иначе
		Результат = ПродолжитьВызов(СтруктураЗаполнения, Отказ);
		Возврат Результат;
	КонецЕсли;  
КонецФункции
