
&НаКлиенте
Процедура pcru_ex_СохранитьПечатнуюФормуВместо(Команда)
	Режим = РежимДиалогаВыбораФайла.ВыборКаталога;
	ДиалогВыбораКаталога = Новый ДиалогВыбораФайла(Режим);
	ДиалогВыбораКаталога.Заголовок = "Выберите каталог";
	Если ДиалогВыбораКаталога.Выбрать() Тогда
		Каталог=ДиалогВыбораКаталога.Каталог;
		ВыделенныеСтроки = Элементы.Список.ВыделенныеСтроки;
		Для каждого Строка Из ВыделенныеСтроки Цикл
			МассивОбъектов = Новый Массив;
			МассивОбъектов.Добавить(Строка);
			ТабДок = ПолучитьТабДок(МассивОбъектов);
			ТабДок.Записать(Каталог+"/"+строка(Строка),ТипФайлаТабличногоДокумента.PDF);
		КонецЦикла;  
	КонецЕсли    
КонецПроцедуры

&НаСервере
Функция ПолучитьТабДок(МассивОбъектов)
	ПараметрыПечати = Новый Структура;
	Возврат УчетНДС.ПечатьСчетовФактур981(МассивОбъектов, новый СписокЗначений, Документы.СчетФактураВыданный.ТекстЗапросаПечатьСчетовФактур(,,Истина), ПараметрыПечати);	
КонецФункции // ()

