// Сопоставляет данные по регистру
//
// Параметры:
//  НаименованиеДанных  - Строка - Имя типа данных
//                 например "ВидНачисленияОплатыТрудаДляНУ"
//  КодВнешнихДанных  - Строка - Код для сопоставления
//                 
//
// Возвращаемое значение:
//   Сопоставленное значение(Ссылка), Неопределено(Если не сопоставилось)
//
Функция СопоставитьДанные(НаименованиеДанных,КодВнешнихДанных)Экспорт
	//*********************************************************************** 
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	pcru_ex_ТипыВнешнихДанных.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.pcru_ex_ТипыВнешнихДанных КАК pcru_ex_ТипыВнешнихДанных
	               |ГДЕ
	               |	pcru_ex_ТипыВнешнихДанных.Наименование = &Наименование";
	Запрос.УстановитьПараметр("Наименование",НаименованиеДанных);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
	  ТипДанных = Выборка.Ссылка;
	Иначе	
		НовыйТипДанных = Справочники.pcru_ex_ТипыВнешнихДанных.СоздатьЭлемент();
		НовыйТипДанных.Наименование = НаименованиеДанных;
		НовыйТипДанных.Записать();
		ТипДанных = НовыйТипДанных.Ссылка;
	КонецЕсли;   	 
	//*********************************************************************** 
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	pcru_ex_СопоставлениеВнешнихДанных.Значение КАК Значение
	               |ИЗ
	               |	РегистрСведений.pcru_ex_СопоставлениеВнешнихДанных КАК pcru_ex_СопоставлениеВнешнихДанных
	               |ГДЕ
	               |	pcru_ex_СопоставлениеВнешнихДанных.КодВнешнихДанных = &КодВнешнихДанных
	               |	И pcru_ex_СопоставлениеВнешнихДанных.ТипДанных = &ТипДанных";
	Запрос.УстановитьПараметр("КодВнешнихДанных", КодВнешнихДанных);
	Запрос.УстановитьПараметр("ТипДанных",ТипДанных );
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
	   Возврат Выборка.Значение;
	КонецЦикла;
	Возврат Неопределено;
	//*********************************************************************** 
КонецФункции // ()
 