
&Вместо("ЗаполнитьКонтрагентаИДоговор")
Процедура pcru_ex_ЗаполнитьКонтрагентаИДоговор(Источник, Раздел, ПолучатьДанныеПоДоговоруЗайма, ИскатьФизлицоКакКонтрагента)
	//// Вставить содержимое метода.
	//ПродолжитьВызов(Источник, Раздел, ПолучатьДанныеПоДоговоруЗайма, ИскатьФизлицоКакКонтрагента);
	
	НовыйКонтрагент = АЭ_ОбщегоНазначения.НайтиСубконтоПоТипу(Источник, Тип("СправочникСсылка.Контрагенты"), "БНФОСубконто" + Раздел);
	
	Если не ЗначениеЗаполнено(Источник.Контрагент)  Тогда
		
		Если ЗначениеЗаполнено(НовыйКонтрагент) Тогда
			
			Источник.Контрагент = НовыйКонтрагент;
			
		ИначеЕсли ИскатьФизлицоКакКонтрагента Тогда
			
			НовыйКонтрагент = АЭ_ОбщегоНазначения.НайтиСубконтоПоТипу(Источник, Тип("СправочникСсылка.ФизическиеЛица"), "БНФОСубконто" + Раздел);
			
			Если ЗначениеЗаполнено(НовыйКонтрагент) Тогда
				
				Источник.Контрагент = НовыйКонтрагент;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли; 
	НовыйДоговор = АЭ_ОбщегоНазначения.НайтиСубконтоПоТипу(Источник, Тип("СправочникСсылка.ДоговорыКонтрагентов"), "БНФОСубконто" + Раздел);
	
	Если ЗначениеЗаполнено(НовыйДоговор) Тогда
		
		Источник.ДоговорКонтрагента = НовыйДоговор;
		
	ИначеЕсли ПолучатьДанныеПоДоговоруЗайма Тогда
		
		ДоговорЗайма = АЭ_ОбщегоНазначения.НайтиСубконтоПоТипу(Источник, Тип("СправочникСсылка.БНФОДоговорыКредитовИДепозитов"), "БНФОСубконто" + Раздел);
		
		Если ЗначениеЗаполнено(ДоговорЗайма) Тогда
			
			НовыйДоговор = ДоговорЗайма.ДоговорКонтрагента;
			Источник.ДоговорКонтрагента = НовыйДоговор;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Источник.ДоговорКонтрагента) И НЕ ЗначениеЗаполнено(Источник.Контрагент) Тогда
		Источник.Контрагент = Источник.ДоговорКонтрагента.Владелец;
	КонецЕсли;
	
	
КонецПроцедуры

&Вместо("ОтразитьДвиженияПоЗаймамИВзносам")
Процедура pcru_ex_ОтразитьДвиженияПоЗаймамИВзносам(Источник, Отказ, РежимПроведения, ИмяПлатежногоДокумента, ДополнительныеСвойства)
	// Вставить содержимое метода.
	ПродолжитьВызов(Источник, Отказ, РежимПроведения, ИмяПлатежногоДокумента, ДополнительныеСвойства);
КонецПроцедуры
