
&НаСервере
Процедура pcru_ex_ПерезагрузитьИз_НАВПослеНаСервере()
	МассивСчетов = Новый Массив;
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ первые 1
	|	pcru_ex_НастройкиПроводокNAV.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.pcru_ex_НастройкиПроводокNAV КАК pcru_ex_НастройкиПроводокNAV
	|ГДЕ
	|	pcru_ex_НастройкиПроводокNAV.Наименование = &Наименование";
	Запрос.УстановитьПараметр("Наименование",ЭтотОбъект.Объект.Содержание);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		МассивСчетов.Добавить(Выборка.Ссылка);		
	КонецЦикла;
	Если МассивСчетов.Количество() > 0 Тогда
		ТекстОшибки = "";
		pcru_ex_NAV.УниверсальныйОбменНаСервереПоПравиламИзСправочникаМассивСчетов(МассивСчетов,ЭтотОбъект.Объект.Дата,Истина,Ложь,ТекстОшибки);
		Если ТекстОшибки <> "" Тогда
			Сообщить(ТекстОшибки);
		КонецЕсли; 
	КонецЕсли;
	ЭтаФорма.Прочитать();
	КонецПроцедуры

&НаКлиенте
Процедура pcru_ex_ПерезагрузитьИз_НАВПосле(Команда)
	pcru_ex_ПерезагрузитьИз_НАВПослеНаСервере();
	ОбновитьОтображениеДанных();
КонецПроцедуры

&НаСервере
Процедура pcru_ex_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ первые 1
	|	pcru_ex_НастройкиПроводокNAV.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.pcru_ex_НастройкиПроводокNAV КАК pcru_ex_НастройкиПроводокNAV
	|ГДЕ
	|	pcru_ex_НастройкиПроводокNAV.Наименование = &Наименование";
	Запрос.УстановитьПараметр("Наименование",ЭтотОбъект.Объект.Содержание);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Элементы.ФормаПерезагрузитьИз_НАВ.Видимость = Истина;		
	КонецЦикла;
КонецПроцедуры
