
&После("ПриЗаписи")
Процедура pcru_ex_ПриЗаписи(Отказ)
	Если СтрЧислоВхождений(НазначениеПлатежа,"Госпошлина")>0 Тогда
		ЭтотОбъект.pcru_ex_СтатьяДоходовРасходов = Справочники.ПрочиеДоходыИРасходы.НайтиПоНаименованию("01407 Госпошлина");
	КонецЕсли; 
	
	Если ЭтотОбъект.ПометкаУдаления Тогда
		НЗ = РегистрыСведений.pcru_ex_СостоянияПлатежныхПоручений.СоздатьНаборЗаписей();
		НЗ.Отбор.ДокументПП.Установить(ЭтотОбъект.Ссылка);
		НЗ.Прочитать();
		НЗ.Очистить();
	КонецЕсли; 
КонецПроцедуры


&После("ПередЗаписью")
Процедура pcru_ex_ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ВидОперации = Перечисления.ВидыОперацийСписаниеДенежныхСредств.ПеречислениеНалога ИЛИ ВидОперации = Перечисления.ВидыОперацийСписаниеДенежныхСредств.ПереводНаДругойСчет Тогда
		Возврат;
	КонецЕсли;
	
	ЧастьСчетаОрганизации = Сред(СокрЛП(СчетОрганизации.НомерСчета), 7, 3);
	Если ЧастьСчетаОрганизации = "109" Тогда
		Возврат;
	КонецЕсли;
	
	

	Если СуммаДокумента <> пкру_РаспределениеЗатрат.Итог("Сумма") Тогда
		ОбщегоНазначения.СообщитьПользователю("Общая сумма по всем типам затрат НЕ совпадает с общей суммой по документу");
		Отказ = Истина;
		Возврат;
	КонецЕсли;

КонецПроцедуры

