
&НаСервере
Процедура УдалитьДублиНаСервере()
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	РеализацияТоваровУслуг.Дата КАК Дата,
	|	РеализацияТоваровУслуг.Контрагент КАК Контрагент,
	|	РеализацияТоваровУслуг.СуммаДокумента КАК СуммаДокумента,
	|	МАКСИМУМ(РеализацияТоваровУслуг.Ссылка) КАК Ссылка
	|ИЗ
	|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	|ГДЕ
	|	РеализацияТоваровУслуг.Дата >= &Дата
	|
	|СГРУППИРОВАТЬ ПО
	|	РеализацияТоваровУслуг.Дата,
	|	РеализацияТоваровУслуг.Контрагент,
	|	РеализацияТоваровУслуг.СуммаДокумента
	|
	|ИМЕЮЩИЕ
	|	КОЛИЧЕСТВО(РеализацияТоваровУслуг.Ссылка) > 1";
	Запрос.УстановитьПараметр("Дата",ЭтотОбъект.Дата );
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		Запрос1 = Новый Запрос;
		Запрос1.Текст = "ВЫБРАТЬ
		|	РеализацияТоваровУслуг.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
		|ГДЕ
		|	РеализацияТоваровУслуг.Ссылка <> &Ссылка
		|	И РеализацияТоваровУслуг.Дата = &Дата
		|	И РеализацияТоваровУслуг.Контрагент = &Контрагент
		|	И РеализацияТоваровУслуг.СуммаДокумента = &СуммаДокумента";
		Запрос1.УстановитьПараметр("Ссылка",Выборка.Ссылка);
		Запрос1.УстановитьПараметр("Дата", Выборка.Дата);
		Запрос1.УстановитьПараметр("Контрагент",Выборка.Контрагент );
		Запрос1.УстановитьПараметр("СуммаДокумента", Выборка.СуммаДокумента);
		Выборка1 = Запрос1.Выполнить().Выбрать();
		//Пока Выборка1.Следующий() Цикл
		// стр  = ЭтотОбъект.ТЧ.Добавить();
		// ЗаполнитьЗначенияСвойств(стр,Выборка);
		// Стр.Ссылка = Выборка1.ссылка;
		//КонецЦикла;
		Сч = 100;
		МассивСсылок = Новый  Массив;
		Пока Выборка1.Следующий() Цикл
			Если Сч = 100 Тогда
				УникальныйИдентификатор1= Новый УникальныйИдентификатор;
				ПараметрыВыполнения = Новый Массив;
				ПараметрыВыполнения.Добавить(МассивСсылок);
				ФоновыеЗадания.Выполнить("pcru_ex_РегламентныеОперации.УдалениеМассиваДокументов",ПараметрыВыполнения,УникальныйИдентификатор1);
				//
				Сч = 0;
				МассивСсылок = Новый  Массив;
			Конецесли;
			МассивСсылок.Добавить(Выборка1.Ссылка);
			СЧ = Сч + 1;
		КонецЦикла;
		// Вставить содержимое обработчика.
		УникальныйИдентификатор1 = Новый УникальныйИдентификатор;
		ПараметрыВыполнения = Новый Массив;
		ПараметрыВыполнения.Добавить(МассивСсылок);
		ФоновыеЗадания.Выполнить("pcru_ex_РегламентныеОперации.УдалениеМассиваДокументов",ПараметрыВыполнения,УникальныйИдентификатор1);
		
		
		
	КонецЦикла;
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура УдалитьДубли(Команда)
	УдалитьДублиНаСервере();       
	
КонецПроцедуры

&НаСервере
Процедура УдалитьДубли1НаСервере()
	Для каждого СтрокаТЧ Из ТЧ Цикл
		СтрокаТЧ.ссылка.ПолучитьОбъект().Удалить();
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура УдалитьДублиВнесенные_В_ТЧ(Команда)
	УдалитьДубли1НаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьТЧДублями(Команда)
	 УдалитьДублиНаСервере3();
КонецПроцедуры



&НаСервере
Процедура УдалитьДублиНаСервере3()
	 ЭтотОбъект.ТЧ.Очистить();
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	РеализацияТоваровУслуг.Дата КАК Дата,
	|	РеализацияТоваровУслуг.Контрагент КАК Контрагент,
	|	РеализацияТоваровУслуг.СуммаДокумента КАК СуммаДокумента,
	|	МАКСИМУМ(РеализацияТоваровУслуг.Ссылка) КАК Ссылка
	|ИЗ
	|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	|ГДЕ
	|	РеализацияТоваровУслуг.Дата >= &Дата
	|
	|СГРУППИРОВАТЬ ПО
	|	РеализацияТоваровУслуг.Дата,
	|	РеализацияТоваровУслуг.Контрагент,
	|	РеализацияТоваровУслуг.СуммаДокумента
	|
	|ИМЕЮЩИЕ
	|	КОЛИЧЕСТВО(РеализацияТоваровУслуг.Ссылка) > 1";
	Запрос.УстановитьПараметр("Дата",ЭтотОбъект.Дата );
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		Запрос1 = Новый Запрос;
		Запрос1.Текст = "ВЫБРАТЬ
		|	РеализацияТоваровУслуг.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
		|ГДЕ
		|	РеализацияТоваровУслуг.Ссылка <> &Ссылка
		|	И РеализацияТоваровУслуг.Дата = &Дата
		|	И РеализацияТоваровУслуг.Контрагент = &Контрагент
		|	И РеализацияТоваровУслуг.СуммаДокумента = &СуммаДокумента";
		Запрос1.УстановитьПараметр("Ссылка",Выборка.Ссылка);
		Запрос1.УстановитьПараметр("Дата", Выборка.Дата);
		Запрос1.УстановитьПараметр("Контрагент",Выборка.Контрагент );
		Запрос1.УстановитьПараметр("СуммаДокумента", Выборка.СуммаДокумента);
		Выборка1 = Запрос1.Выполнить().Выбрать();
		Пока Выборка1.Следующий() Цикл
		 стр  = ЭтотОбъект.ТЧ.Добавить();
		 ЗаполнитьЗначенияСвойств(стр,Выборка);
		 Стр.Ссылка = Выборка1.ссылка;
		КонецЦикла;
				
		
		
	КонецЦикла;
	// Вставить содержимое обработчика.
КонецПроцедуры
