

// Находит номенклатуру по наименованию или создает.
//
// Параметры:
//  <Параметр1>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//
// Возвращаемое значение:
//   <Тип.Вид>   - <описание возвращаемого значения>
//
Функция ПолучитьСоздатьНоменклатуру(НаименованиеНоменклатуры)  Экспорт

	 	Запрос1 = Новый Запрос;
				Запрос1.Текст = "ВЫБРАТЬ
				|	Номенклатура.Ссылка КАК Ссылка
				|ИЗ
				|	Справочник.Номенклатура КАК Номенклатура
				|ГДЕ
				|	Номенклатура.НаименованиеПолное ПОДОБНО &НаименованиеПолное";
				Запрос1.УстановитьПараметр("НаименованиеПолное", НаименованиеНоменклатуры);
				Выборка1 = Запрос1.Выполнить().Выбрать();
				Если Выборка1.Следующий() Тогда
					ОбНом = Выборка1.Ссылка.ПолучитьОбъект();
					Если Не ЗначениеЗаполнено(ОбНом.БНФОГруппаФинансовогоУчета) Тогда
						ОбНом.БНФОГруппаФинансовогоУчета = Справочники.БНФОГруппыФинансовогоУчетаАктивов.НайтиПоНаименованию("Материалы");
					КонецЕсли;  
					Если Не ЗначениеЗаполнено(ОбНом.ЕдиницаИзмерения) Тогда
						ОбНом.ЕдиницаИзмерения = Справочники.КлассификаторЕдиницИзмерения.НайтиПоКоду("796 "); 
					КонецЕсли;
					ОбНом.Записать();
					Возврат ОбНом.Ссылка;
				Иначе
					ОбНом = Справочники.Номенклатура.СоздатьЭлемент();
					ОбНом.БНФОГруппаФинансовогоУчета = Справочники.БНФОГруппыФинансовогоУчетаАктивов.НайтиПоНаименованию("Материалы");
					ОбНом.Наименование = НаименованиеНоменклатуры;
					ОбНом.НаименованиеПолное =  НаименованиеНоменклатуры;
					ОбНом.ВидНоменклатуры = Справочники.ВидыНоменклатуры.НайтиСоздатьЭлементыТовар();
					ОбНом.ЕдиницаИзмерения = Справочники.КлассификаторЕдиницИзмерения.НайтиПоКоду("796 ");
					ОбНом.Записать();
					Возврат ОбНом.Ссылка;
				КонецЕсли;


КонецФункции // ПолучитьСоздатьНоменклатуру()
 