
&Перед("ПередЗаписью")
Процедура pcru_ex_ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	ЭтоЗагрузкаИзНав = Ложь;
	Если ДополнительныеСвойства.Свойство("ЭтоЗагрузкаИзНав") Тогда
		ЭтоЗагрузкаИзНав = ДополнительныеСвойства.ЭтоЗагрузкаИзНав;
	КонецЕсли; 
	Если Не ЭтоЗагрузкаИзНав Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	pcru_ex_ЗапланированноеВыполнениеРегламентныхЗаданий.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.pcru_ex_ЗапланированноеВыполнениеРегламентныхЗаданий КАК pcru_ex_ЗапланированноеВыполнениеРегламентныхЗаданий
		|ГДЕ
		|	pcru_ex_ЗапланированноеВыполнениеРегламентныхЗаданий.Результат ПОДОБНО ""Задание Выполняется..""";
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			Отказ = Истина;
			Сообщить("Идет загрузка из НАВ!! Запись не возможна!!");
			Возврат;
		КонецЕсли;  
	КонецЕсли; 	
КонецПроцедуры
