
&Вместо("ПолучитьРасчетПоНалогуНаИмущество")
Функция pcru_ex_ПолучитьРасчетПоНалогуНаИмущество(Организация, ПериодРасчета)
	
	
	ГодовойРасчет = Месяц(ПериодРасчета) = 12;
	
	РеквизитыОрганизации = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Организация, "РегистрацияВНалоговомОргане");
	
	мДатаНачалаПериодаОтчета = НачалоГода(ПериодРасчета);
	мДатаКонцаПериодаОтчета  = КонецКвартала(ПериодРасчета);
	
	ТаблицаРасчетНалога = ПустаяСправкаРасчет("РасчетНалогаНаИмущество");

	ЭтоНеЮрЛицо = НЕ ОбщегоНазначенияБПВызовСервераПовтИсп.ЭтоЮрЛицо(Организация);
	
	Если Месяц(ПериодРасчета)%3 <> 0 ИЛИ ЭтоНеЮрЛицо Тогда
		Возврат ТаблицаРасчетНалога;
	КонецЕсли;
	
	// ПО СРЕДНЕЙ СТОИМОСТИ
	
	// Сведения о налоговых льготах в виде уменьшения суммы налога.
	ПроцентУменьшенияСуммыНалога = 0;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Период",      мДатаКонцаПериодаОтчета);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЕСТЬNULL(СтавкиНалогаНаИмуществоСрезПоследних.ПроцентУменьшения, 0) КАК ПроцентУменьшения
	|ИЗ
	|	РегистрСведений.СтавкиНалогаНаИмущество.СрезПоследних(&Период) КАК СтавкиНалогаНаИмуществоСрезПоследних
	|ГДЕ
	|	СтавкиНалогаНаИмуществоСрезПоследних.Организация = &Организация";
	РезультатЗапроса = Запрос.Выполнить();
	
	Если НЕ РезультатЗапроса.Пустой() Тогда
		ПроцентУменьшенияСуммыНалога = РезультатЗапроса.Выгрузить()[0].ПроцентУменьшения;
	Иначе
		ПроцентУменьшенияСуммыНалога = 0;
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	// Признак применения ЕНВД.
	ПрименениеЕНВД = УчетнаяПолитика.ПлательщикЕНВД(Организация, мДатаКонцаПериодаОтчета);

	Если ПрименениеЕНВД Тогда 
		Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СпособыОтраженияРасходовПоАмортизацииСпособы.Ссылка КАК Ссылка,
		|	ЕСТЬNULL(ЕСТЬNULL(ВЫРАЗИТЬ(СпособыОтраженияРасходовПоАмортизацииСпособы.Субконто1 КАК Справочник.СтатьиЗатрат).ВидДеятельностиДляНалоговогоУчетаЗатрат, ЕСТЬNULL(ВЫРАЗИТЬ(СпособыОтраженияРасходовПоАмортизацииСпособы.Субконто2 КАК Справочник.СтатьиЗатрат).ВидДеятельностиДляНалоговогоУчетаЗатрат, ВЫРАЗИТЬ(СпособыОтраженияРасходовПоАмортизацииСпособы.Субконто3 КАК Справочник.СтатьиЗатрат).ВидДеятельностиДляНалоговогоУчетаЗатрат)), ЗНАЧЕНИЕ(Перечисление.ВидыДеятельностиДляНалоговогоУчетаЗатрат.ОсновнаяСистемаНалогообложения)) КАК ОтношениеКЕНВД,
		|	СУММА(СпособыОтраженияРасходовПоАмортизацииСпособы.Коэффициент) КАК Коэффициент
		|ПОМЕСТИТЬ ВТ_ВыборкаКоэффициентов
		|ИЗ
		|	Справочник.СпособыОтраженияРасходовПоАмортизации.Способы КАК СпособыОтраженияРасходовПоАмортизацииСпособы
		|СГРУППИРОВАТЬ ПО
		|	ЕСТЬNULL(ЕСТЬNULL(ВЫРАЗИТЬ(СпособыОтраженияРасходовПоАмортизацииСпособы.Субконто1 КАК Справочник.СтатьиЗатрат).ВидДеятельностиДляНалоговогоУчетаЗатрат, ЕСТЬNULL(ВЫРАЗИТЬ(СпособыОтраженияРасходовПоАмортизацииСпособы.Субконто2 КАК Справочник.СтатьиЗатрат).ВидДеятельностиДляНалоговогоУчетаЗатрат, ВЫРАЗИТЬ(СпособыОтраженияРасходовПоАмортизацииСпособы.Субконто3 КАК Справочник.СтатьиЗатрат).ВидДеятельностиДляНалоговогоУчетаЗатрат)), ЗНАЧЕНИЕ(Перечисление.ВидыДеятельностиДляНалоговогоУчетаЗатрат.ОсновнаяСистемаНалогообложения)),
		|	СпособыОтраженияРасходовПоАмортизацииСпособы.Ссылка
		|ИНДЕКСИРОВАТЬ ПО
		|	СпособыОтраженияРасходовПоАмортизацииСпособы.Ссылка
		|;
		|
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СпособыОтраженияРасходовПоАмортизацииСпособы.Ссылка КАК Ссылка,
		|	СУММА(СпособыОтраженияРасходовПоАмортизацииСпособы.Коэффициент) КАК СуммаКоэффициентов
		|ПОМЕСТИТЬ ВТ_ВыборкаСуммыКоэффициентов
		|ИЗ
		|	Справочник.СпособыОтраженияРасходовПоАмортизации.Способы КАК СпособыОтраженияРасходовПоАмортизацииСпособы
		|СГРУППИРОВАТЬ ПО
		|	СпособыОтраженияРасходовПоАмортизацииСпособы.Ссылка
		|ИНДЕКСИРОВАТЬ ПО
		|	СпособыОтраженияРасходовПоАмортизацииСпособы.Ссылка
		|;
		|
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВыборкаКоэффициентов.Ссылка КАК Ссылка,
		|	СУММА(ВЫБОР
		|	      	КОГДА ВыборкаКоэффициентов.ОтношениеКЕНВД = ЗНАЧЕНИЕ(Перечисление.ВидыДеятельностиДляНалоговогоУчетаЗатрат.ОсновнаяСистемаНалогообложения)
		|	      		ТОГДА ВыборкаКоэффициентов.Коэффициент / ВыборкаСуммыКоэффициентов.СуммаКоэффициентов
		|		  	ИНАЧЕ 0
		|	      КОНЕЦ) КАК НеЕНВД,
		|	СУММА(ВЫБОР
		|			КОГДА ВыборкаКоэффициентов.ОтношениеКЕНВД = ЗНАЧЕНИЕ(Перечисление.ВидыДеятельностиДляНалоговогоУчетаЗатрат.РаспределяемыеЗатраты)
		|				ТОГДА ВыборкаКоэффициентов.Коэффициент / ВыборкаСуммыКоэффициентов.СуммаКоэффициентов
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК Распределение
		|
		|ПОМЕСТИТЬ
		|	КоэффициентыЕНВД
		|
		|ИЗ
		|	ВТ_ВыборкаКоэффициентов КАК ВыборкаКоэффициентов
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ВыборкаСуммыКоэффициентов КАК ВыборкаСуммыКоэффициентов
		|		ПО ВыборкаСуммыКоэффициентов.Ссылка = ВыборкаКоэффициентов.Ссылка
		|ГДЕ
		|	ВыборкаКоэффициентов.ОтношениеКЕНВД <> ЗНАЧЕНИЕ(Перечисление.ВидыДеятельностиДляНалоговогоУчетаЗатрат.ОсобыйПорядокНалогообложения)
		|	
		|СГРУППИРОВАТЬ ПО
		|	ВыборкаКоэффициентов.Ссылка
		|";
		Запрос.Выполнить();
	КонецЕсли;

	ГоловнаяОрганизация = Организация.ГоловнаяОрганизация;
	Если Не ЗначениеЗаполнено(ГоловнаяОрганизация) Тогда
		ГоловнаяОрганизация = Организация;
	КонецЕсли;
	Запрос.УстановитьПараметр("ГоловнаяОрганизация", ГоловнаяОрганизация);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("КонецПериодаОтчета", КонецГода(ПериодРасчета));
	
	Если Метаданные.Документы.Найти("АвизоОСВходящее") <> Неопределено Тогда 
		ДопУсловие = " И НЕ СостоянияОСОрганизаций.Регистратор ССЫЛКА Документ.АвизоОСВходящее";
	Иначе
		ДопУсловие = "";     
	КонецЕсли;
	
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СостоянияОСОрганизаций.ОсновноеСредство КАК ОС,
	|	МИНИМУМ(СостоянияОСОрганизаций.ДатаСостояния) КАК ДатаСостояния
	|ПОМЕСТИТЬ ВТДвижимоеИмуществоПринятоеКУчетуПосле2013_ДатыСостояний
	|ИЗ
	|	РегистрСведений.СостоянияОСОрганизаций КАК СостоянияОСОрганизаций
	|ГДЕ
	|	СостоянияОСОрганизаций.Организация В
	|			(ВЫБРАТЬ
	|				Организации.Ссылка КАК Ссылка
	|			ИЗ
	|				Справочник.Организации КАК Организации
	|			ГДЕ
	|				(Организации.Ссылка = &ГоловнаяОрганизация
	|					ИЛИ Организации.ГоловнаяОрганизация = &ГоловнаяОрганизация))
	|	И СостоянияОСОрганизаций.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияОС.ПринятоКУчету)
	|	И СостоянияОСОрганизаций.ДатаСостояния <= &КонецПериодаОтчета
	|	И СостоянияОСОрганизаций.Активность = ИСТИНА
	|	И НЕ СостоянияОСОрганизаций.ОсновноеСредство.ГруппаОС В (ЗНАЧЕНИЕ(Перечисление.ГруппыОС.Здания), ЗНАЧЕНИЕ(Перечисление.ГруппыОС.Сооружения), ЗНАЧЕНИЕ(Перечисление.ГруппыОС.МноголетниеНасаждения), ЗНАЧЕНИЕ(Перечисление.ГруппыОС.ЗемельныеУчастки), ЗНАЧЕНИЕ(Перечисление.ГруппыОС.ПрочееИмуществоТребующееГосударственнойРегистрации), ЗНАЧЕНИЕ(Перечисление.ГруппыОС.ОбъектыПриродопользования))
	|	И НЕ СостоянияОСОрганизаций.ОсновноеСредство.ТипОС = ЗНАЧЕНИЕ(Перечисление.ТипыОС.КапитальноеВложение)" + ДопУсловие + "
	|
	|СГРУППИРОВАТЬ ПО
	|	СостоянияОСОрганизаций.ОсновноеСредство
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТДвижимоеИмуществоПринятоеКУчетуПосле2013_ДатыСостояний.ОС
	|ПОМЕСТИТЬ ВТДвижимоеИмуществоПринятоеКУчетуПосле2013
	|ИЗ
	|	ВТДвижимоеИмуществоПринятоеКУчетуПосле2013_ДатыСостояний КАК ВТДвижимоеИмуществоПринятоеКУчетуПосле2013_ДатыСостояний
	|ГДЕ
	|	ВТДвижимоеИмуществоПринятоеКУчетуПосле2013_ДатыСостояний.ДатаСостояния >= ДАТАВРЕМЯ(2013, 1, 1)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТДвижимоеИмуществоПринятоеКУчетуПосле2013_ДатыСостояний";
	Запрос.Выполнить();
	
	ТекстОбъединяющегоЗапроса = "";
	
	Период  = мДатаНачалаПериодаОтчета;
	Счетчик = 1;
	
	Пока Период <= НачалоМесяца(ДобавитьМесяц(мДатаКонцаПериодаОтчета, 1)) Цикл
		
		ПрименениеУСН = УчетнаяПолитика.ПрименяетсяУСН(Организация,
			?(Период < мДатаКонцаПериодаОтчета, Период, мДатаКонцаПериодаОтчета));
		
		Если НЕ ПрименениеУСН Тогда
			
			КонецПериода = ?(Год(Период) = Год(ПериодРасчета), Период, мДатаКонцаПериодаОтчета);
			
			Запрос.УстановитьПараметр("Период", Период);
			Запрос.УстановитьПараметр("КонецПериода", КонецПериода);
			
			// Срез последних записей по основному средству в регистре "Ставки налога на имущество по отдельным основным средствам".
			Запрос.Текст =
			"ВЫБРАТЬ
			|	СтавкиНалогаНаИмуществоПоОтдельнымОсновнымСредствам.ОсновноеСредство,
			|	МАКСИМУМ(СтавкиНалогаНаИмуществоПоОтдельнымОсновнымСредствам.Период) КАК ПериодСреза
			|ПОМЕСТИТЬ СтавкиНалогаНаИмуществоПоОтдельнымОсновнымСредствамСрезПоследнихПериодов
			|ИЗ
			|	РегистрСведений.СтавкиНалогаНаИмуществоПоОтдельнымОсновнымСредствам КАК СтавкиНалогаНаИмуществоПоОтдельнымОсновнымСредствам
			|ГДЕ
			|	СтавкиНалогаНаИмуществоПоОтдельнымОсновнымСредствам.Период <= &КонецПериода
			|	И СтавкиНалогаНаИмуществоПоОтдельнымОсновнымСредствам.Организация = &Организация
			|
			|СГРУППИРОВАТЬ ПО
			|	СтавкиНалогаНаИмуществоПоОтдельнымОсновнымСредствам.ОсновноеСредство
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	СтавкиНалогаНаИмуществоПоОтдельнымОсновнымСредствам.ОсновноеСредство,
			|	СтавкиНалогаНаИмуществоПоОтдельнымОсновнымСредствам.НалоговаяБаза,
			|	СтавкиНалогаНаИмуществоПоОтдельнымОсновнымСредствам.ПорядокНалогообложения
			|ПОМЕСТИТЬ СтавкиНалогаНаИмуществоПоОтдельнымОсновнымСредствамСрезПоследних
			|ИЗ
			|	СтавкиНалогаНаИмуществоПоОтдельнымОсновнымСредствамСрезПоследнихПериодов КАК СтавкиНалогаНаИмуществоПоОтдельнымОсновнымСредствамСрезПоследнихПериодов
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтавкиНалогаНаИмуществоПоОтдельнымОсновнымСредствам КАК СтавкиНалогаНаИмуществоПоОтдельнымОсновнымСредствам
			|		ПО СтавкиНалогаНаИмуществоПоОтдельнымОсновнымСредствамСрезПоследнихПериодов.ОсновноеСредство = СтавкиНалогаНаИмуществоПоОтдельнымОсновнымСредствам.ОсновноеСредство
			|			И СтавкиНалогаНаИмуществоПоОтдельнымОсновнымСредствамСрезПоследнихПериодов.ПериодСреза = СтавкиНалогаНаИмуществоПоОтдельнымОсновнымСредствам.Период";
			
			Запрос.Выполнить();
			
			Запрос.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ОС.Ссылка КАК ОсновноеСредство
			|ПОМЕСТИТЬ СписокРазрешенныхОС
			|ИЗ
			|	Справочник.ОсновныеСредства КАК ОС
			|ГДЕ
			|	НЕ ОС.Ссылка В
			|				(ВЫБРАТЬ
			|					СостоянияОСОрганизаций.ОсновноеСредство
			|				ИЗ
			|					РегистрСведений.СостоянияОСОрганизаций КАК СостоянияОСОрганизаций
			|				ГДЕ
			|					СостоянияОСОрганизаций.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияОС.СнятоСУчета)
			|					И СостоянияОСОрганизаций.ДатаСостояния < &КонецПериода
			|					И СостоянияОСОрганизаций.Активность = ИСТИНА
			|					И СостоянияОСОрганизаций.Организация = &Организация)
			|	И НЕ ОС.ГруппаОС В (ЗНАЧЕНИЕ(Перечисление.ГруппыОС.ЗемельныеУчастки), ЗНАЧЕНИЕ(Перечисление.ГруппыОС.ОбъектыПриродопользования))
			|	И НЕ ОС.Ссылка В
			|				(ВЫБРАТЬ
			|					СтавкиНалогаНаИмуществоПоОтдельнымОсновнымСредствамСрезПоследних.ОсновноеСредство
			|				ИЗ
			|					СтавкиНалогаНаИмуществоПоОтдельнымОсновнымСредствамСрезПоследних
			|				ГДЕ
			|					СтавкиНалогаНаИмуществоПоОтдельнымОсновнымСредствамСрезПоследних.НалоговаяБаза = ЗНАЧЕНИЕ(Перечисление.НалоговаяБазаПоНалогуНаИмущество.КадастроваяСтоимость))
			|	И НЕ ОС.Ссылка В
			|				(ВЫБРАТЬ
			|					СтавкиНалогаНаИмуществоПоОтдельнымОсновнымСредствамСрезПоследних.ОсновноеСредство
			|				ИЗ
			|					СтавкиНалогаНаИмуществоПоОтдельнымОсновнымСредствамСрезПоследних
			|				ГДЕ
			|					СтавкиНалогаНаИмуществоПоОтдельнымОсновнымСредствамСрезПоследних.ПорядокНалогообложения = ЗНАЧЕНИЕ(Перечисление.ПорядокНалогообложенияИмущества.НеПодлежитНалогообложению))
			|
			|ИНДЕКСИРОВАТЬ ПО
			|	ОС.Ссылка
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ПервоначальныеСведенияОСБухгалтерскийУчетСрезПоследних.ОсновноеСредство КАК ОсновноеСредство,
			|	ПервоначальныеСведенияОСБухгалтерскийУчетСрезПоследних.ПорядокПогашенияСтоимости КАК ПорядокПогашенияСтоимости
			|ПОМЕСТИТЬ СписокОС
			|ИЗ
			|	РегистрСведений.ПервоначальныеСведенияОСБухгалтерскийУчет.СрезПоследних(
			|			&Период,
			|			Организация = &Организация
			|				И ОсновноеСредство В
			|					(ВЫБРАТЬ РАЗЛИЧНЫЕ
			|						СписокРазрешенныхОС.ОсновноеСредство
			|					ИЗ
			|						СписокРазрешенныхОС КАК СписокРазрешенныхОС)) КАК ПервоначальныеСведенияОСБухгалтерскийУчетСрезПоследних
			|
			|ИНДЕКСИРОВАТЬ ПО
			|	ПервоначальныеСведенияОСБухгалтерскийУчетСрезПоследних.ОсновноеСредство";
				
			Запрос.Выполнить();
			
			// Формируем и устанавливаем запросу списки счетов учета ОС.
			// Временная таблица ВТ_СчетаБухгалтерскогоУчетаОССрезПоследних далее используется в запросах для получения счетов по ОС.
			Запрос.Текст =
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	СчетаБухгалтерскогоУчетаОССрезПоследних.ОсновноеСредство КАК ОсновноеСредство,
			|	СчетаБухгалтерскогоУчетаОССрезПоследних.СчетУчета КАК СчетУчета,
			|	СчетаБухгалтерскогоУчетаОССрезПоследних.СчетНачисленияАмортизации КАК СчетНачисленияАмортизации
			|ПОМЕСТИТЬ ВТ_СчетаБухгалтерскогоУчетаОССрезПоследних
			|ИЗ
			|	РегистрСведений.СчетаБухгалтерскогоУчетаОС.СрезПоследних(
			|			&КонецПериода,
			|			Организация = &Организация
			|				И ОсновноеСредство В
			|					(ВЫБРАТЬ
			|						СписокОС.ОсновноеСредство
			|					ИЗ
			|						СписокОС КАК СписокОС)) КАК СчетаБухгалтерскогоУчетаОССрезПоследних
			|
			|ИНДЕКСИРОВАТЬ ПО
			|	СчетаБухгалтерскогоУчетаОССрезПоследних.ОсновноеСредство
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	СчетаБухгалтерскогоУчетаОССрезПоследних.СчетУчета
			|ИЗ
			|	ВТ_СчетаБухгалтерскогоУчетаОССрезПоследних КАК СчетаБухгалтерскогоУчетаОССрезПоследних
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	СчетаБухгалтерскогоУчетаОССрезПоследних.СчетНачисленияАмортизации
			|ИЗ
			|	ВТ_СчетаБухгалтерскогоУчетаОССрезПоследних КАК СчетаБухгалтерскогоУчетаОССрезПоследних";
			РезультатЗапроса = Запрос.ВыполнитьПакет();
			СчетаУчета = РезультатЗапроса[1].Выгрузить().ВыгрузитьКолонку("СчетУчета");
			СчетаУчета.Добавить(ПланыСчетов.Хозрасчетный.ВыбытиеОС);
			Запрос.УстановитьПараметр("СчетаУчета", СчетаУчета);
			Запрос.УстановитьПараметр("СчетаНачисленияАмортизации", РезультатЗапроса[2].Выгрузить().ВыгрузитьКолонку("СчетНачисленияАмортизации"));
			
			Запрос.Текст =
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	МАКСИМУМ(СтавкиНалогаНаИмуществоПоОтдельнымОсновнымСредствамСрезПоследних.Период) КАК Период,
			|	СтавкиНалогаНаИмуществоПоОтдельнымОсновнымСредствамСрезПоследних.ОсновноеСредство КАК ОсновноеСредство
			|ПОМЕСТИТЬ ВТ_СрезПоследних
			|ИЗ
			|	РегистрСведений.СтавкиНалогаНаИмуществоПоОтдельнымОсновнымСредствам.СрезПоследних(&КонецПериода, Организация = &Организация И ОсновноеСредство В (ВЫБРАТЬ ОсновноеСредство ИЗ СписокОС)) КАК СтавкиНалогаНаИмуществоПоОтдельнымОсновнымСредствамСрезПоследних
			|СГРУППИРОВАТЬ ПО
			|	СтавкиНалогаНаИмуществоПоОтдельнымОсновнымСредствамСрезПоследних.ОсновноеСредство
			|ИНДЕКСИРОВАТЬ ПО
			|	ОсновноеСредство,Период
			|;
			|
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	СрезПоследних.ОсновноеСредство,
			|	СтавкиНалогаНаИмуществоПоОтдельнымОсновнымСредствамСрезПоследних.Организация,
			|	СтавкиНалогаНаИмуществоПоОтдельнымОсновнымСредствамСрезПоследних.КодПоОКТМО,
			|	СтавкиНалогаНаИмуществоПоОтдельнымОсновнымСредствамСрезПоследних.ПостановкаНаУчетВНалоговомОргане,
			|	СтавкиНалогаНаИмуществоПоОтдельнымОсновнымСредствамСрезПоследних.НалоговыйОрган,
			|	СтавкиНалогаНаИмуществоПоОтдельнымОсновнымСредствамСрезПоследних.ПорядокНалогообложения,
			|	СтавкиНалогаНаИмуществоПоОтдельнымОсновнымСредствамСрезПоследних.НалоговаяСтавка,
			|	СтавкиНалогаНаИмуществоПоОтдельнымОсновнымСредствамСрезПоследних.КодНалоговойЛьготыОсвобождениеОтНалогообложения,
			|	СтавкиНалогаНаИмуществоПоОтдельнымОсновнымСредствамСрезПоследних.СниженнаяНалоговаяСтавка,
			|	СтавкиНалогаНаИмуществоПоОтдельнымОсновнымСредствамСрезПоследних.КодВидаИмущества,
			|	СтавкиНалогаНаИмуществоПоОтдельнымОсновнымСредствамСрезПоследних.ДоляСтоимостиЧислитель,
			|	СтавкиНалогаНаИмуществоПоОтдельнымОсновнымСредствамСрезПоследних.ДоляСтоимостиЗнаменатель,
			|	СтавкиНалогаНаИмуществоПоОтдельнымОсновнымСредствамСрезПоследних.ДвижимоеИмуществоПодлежащееНалогообложению,
			|	СтавкиНалогаНаИмуществоПоОтдельнымОсновнымСредствамСрезПоследних.КБК,
			|	СтавкиНалогаНаИмуществоПоОтдельнымОсновнымСредствамСрезПоследних.УсловныйНомер,
			|	СтавкиНалогаНаИмуществоПоОтдельнымОсновнымСредствамСрезПоследних.КадастровыйНомер,
			|	СтавкиНалогаНаИмуществоПоОтдельнымОсновнымСредствамСрезПоследних.КадастровыйНомерПомещения
			|ПОМЕСТИТЬ ВТ_СтавкиНалогаНаИмуществоПоОтдельнымОсновнымСредствамСрезПоследних
			|ИЗ
			|	ВТ_СрезПоследних КАК СрезПоследних
			|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтавкиНалогаНаИмуществоПоОтдельнымОсновнымСредствам.СрезПоследних(&КонецПериода, Организация = &Организация И ОсновноеСредство В (ВЫБРАТЬ ОсновноеСредство ИЗ СписокОС)) КАК СтавкиНалогаНаИмуществоПоОтдельнымОсновнымСредствамСрезПоследних
			|	ПО СрезПоследних.Период = СтавкиНалогаНаИмуществоПоОтдельнымОсновнымСредствамСрезПоследних.Период
			|	И СрезПоследних.ОсновноеСредство = СтавкиНалогаНаИмуществоПоОтдельнымОсновнымСредствамСрезПоследних.ОсновноеСредство
			|;
			|
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ПервоначальнаяСтоимостьОС.СуммаОстатокДт,
			|	ПервоначальнаяСтоимостьОС.Субконто1,
			|	ПервоначальнаяСтоимостьОС.Счет
			|ПОМЕСТИТЬ ВТ_ПервоначальнаяСтоимостьОС
			|ИЗ
			|	РегистрБухгалтерии.БНФОБанковский.Остатки(&Период, Счет В (&СчетаУчета), ЗНАЧЕНИЕ(ПланВидовХарактеристик.БНФОВидыСубконтоБанковские.ОсновныеСредства), Организация = &Организация) КАК ПервоначальнаяСтоимостьОС
			|ИНДЕКСИРОВАТЬ ПО
			|	ПервоначальнаяСтоимостьОС.Субконто1
			|;
			|
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	СтавкиНалогаНаИмуществоСрезПоследних.*
			|ПОМЕСТИТЬ ВТ_СтавкиНалогаНаИмуществоСрезПоследних
			|ИЗ
			|	РегистрСведений.СтавкиНалогаНаИмущество.СрезПоследних(&КонецПериода, Организация = &Организация) КАК СтавкиНалогаНаИмуществоСрезПоследних
			|;
			|
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	АмортизацияОС.СуммаОстатокДт,
			|	АмортизацияОС.СуммаОстатокКт,
			|	АмортизацияОС.Субконто1,
			|	АмортизацияОС.Счет
			|ПОМЕСТИТЬ ВТ_АмортизацияОС
			|ИЗ
			|	РегистрБухгалтерии.БНФОБанковский.Остатки(&Период, Счет В (&СчетаНачисленияАмортизации), ЗНАЧЕНИЕ(ПланВидовХарактеристик.БНФОВидыСубконтоБанковские.ОсновныеСредства), Организация = &Организация) КАК АмортизацияОС
			|ИНДЕКСИРОВАТЬ ПО
			|	АмортизацияОС.Субконто1
			|;
			|";
			
			Запрос.УстановитьПараметр("ОсновнойНалоговыйОрган", РеквизитыОрганизации.РегистрацияВНалоговомОргане);
			Запрос.УстановитьПараметр("Год", Год(ПериодРасчета));
			
			Если ПрименениеЕНВД Тогда
				
				// Получение коэффициента доли выручки от деятельности, облагаемой ЕНВД.
				ПериодПолученияКоэффициентаЕНВД = ?(Период = мДатаНачалаПериодаОтчета, Период, ДобавитьМесяц(Период, -1));
				КоэффициентРаспределенияЕНВД = УправлениеВнеоборотнымиАктивами.КоэффициентРаспределенияВыручкиПоВидамДеятельности(Организация, НачалоКвартала(ПериодПолученияКоэффициентаЕНВД), КонецКвартала(ПериодПолученияКоэффициентаЕНВД));
				Запрос.УстановитьПараметр("КоэффициентРаспределенияЕНВД", КоэффициентРаспределенияЕНВД);
				
				Запрос.Текст = Запрос.Текст +
				"ВЫБРАТЬ РАЗРЕШЕННЫЕ
				|	СписокОС.ОсновноеСредство,
				|	ВЫБОР
				|		КОГДА СписокОС.ОсновноеСредство.АмортизационнаяГруппа В (ЗНАЧЕНИЕ(Перечисление.АмортизационныеГруппы.ПерваяГруппа), ЗНАЧЕНИЕ(Перечисление.АмортизационныеГруппы.ВтораяГруппа))
				|			ТОГДА ИСТИНА
				|		ИНАЧЕ ЛОЖЬ
				|	КОНЕЦ КАК ЭтоПерваяВтораяАмортизационныеГруппы,
				|	ВЫБОР
				|		КОГДА СтавкиНалогаНаИмуществоПоОтдельнымОсновнымСредствамСрезПоследних.ПостановкаНаУчетВНалоговомОргане = ЗНАЧЕНИЕ(Перечисление.ПостановкаНаУчетВНалоговомОргане.ВДругомНалоговомОргане)
				|			ТОГДА СтавкиНалогаНаИмуществоПоОтдельнымОсновнымСредствамСрезПоследних.НалоговыйОрган
				|		ИНАЧЕ 
				|			&ОсновнойНалоговыйОрган
				|	КОНЕЦ КАК РегистрацияВНалоговомОргане,
				|	ВЫБОР
				|		КОГДА СтавкиНалогаНаИмуществоПоОтдельнымОсновнымСредствамСрезПоследних.ПостановкаНаУчетВНалоговомОргане = ЗНАЧЕНИЕ(Перечисление.ПостановкаНаУчетВНалоговомОргане.СДругимКодомПоОКАТО)
				|		  ИЛИ СтавкиНалогаНаИмуществоПоОтдельнымОсновнымСредствамСрезПоследних.ПостановкаНаУчетВНалоговомОргане = ЗНАЧЕНИЕ(Перечисление.ПостановкаНаУчетВНалоговомОргане.ВДругомНалоговомОргане)
				|		ТОГДА 
				|			СтавкиНалогаНаИмуществоПоОтдельнымОсновнымСредствамСрезПоследних.КодПоОКТМО
				|		ИНАЧЕ 
				|			ЕСТЬNULL(СтавкиНалогаНаИмуществоСрезПоследних.Организация.РегистрацияВНалоговомОргане.КодПоОКТМО, """")
				|	КОНЕЦ КАК КодПоОКТМО,
				|	ЕСТЬNULL(ВЫБОР
				|			КОГДА СтавкиНалогаНаИмуществоПоОтдельнымОсновнымСредствамСрезПоследних.ПорядокНалогообложения = ЗНАЧЕНИЕ(Перечисление.ПорядокНалогообложенияИмущества.ОблагаетсяПоСниженнойСтавке)
				|				ТОГДА СтавкиНалогаНаИмуществоПоОтдельнымОсновнымСредствамСрезПоследних.СниженнаяНалоговаяСтавка
				|			КОГДА СтавкиНалогаНаИмуществоПоОтдельнымОсновнымСредствамСрезПоследних.ПостановкаНаУчетВНалоговомОргане = ЗНАЧЕНИЕ(Перечисление.ПостановкаНаУчетВНалоговомОргане.ВДругомНалоговомОргане)
				|				ТОГДА СтавкиНалогаНаИмуществоПоОтдельнымОсновнымСредствамСрезПоследних.НалоговаяСтавка
				|			ИНАЧЕ
				|				ВЫБОР
				|					КОГДА СписокОС.ОсновноеСредство В (ВЫБРАТЬ ВТДвижимоеИмуществоПринятоеКУчетуПосле2013.ОС ИЗ ВТДвижимоеИмуществоПринятоеКУчетуПосле2013 КАК ВТДвижимоеИмуществоПринятоеКУчетуПосле2013)
				|						И НЕ ЕСТЬNULL(СтавкиНалогаНаИмуществоПоОтдельнымОсновнымСредствамСрезПоследних.ДвижимоеИмуществоПодлежащееНалогообложению, ЛОЖЬ)
				|						И &Год >= 2018 ТОГДА
				|							СтавкиНалогаНаИмуществоСрезПоследних.НалоговаяСтавкаДвижимоеИмущество
				|					ИНАЧЕ
				|							СтавкиНалогаНаИмуществоСрезПоследних.НалоговаяСтавка
				|				КОНЕЦ
				|			КОНЕЦ, СтавкиНалогаНаИмуществоСрезПоследних.НалоговаяСтавка) КАК НалоговаяСтавка,
				|	ВЫБОР
				|		КОГДА СтавкиНалогаНаИмуществоПоОтдельнымОсновнымСредствамСрезПоследних.ПорядокНалогообложения = ЗНАЧЕНИЕ(Перечисление.ПорядокНалогообложенияИмущества.ОблагаетсяПоСниженнойСтавке)
				|			ТОГДА ИСТИНА
				|		КОГДА СтавкиНалогаНаИмуществоПоОтдельнымОсновнымСредствамСрезПоследних.ПостановкаНаУчетВНалоговомОргане = ЗНАЧЕНИЕ(Перечисление.ПостановкаНаУчетВНалоговомОргане.ВДругомНалоговомОргане)
				|			ТОГДА ЛОЖЬ
				|		ИНАЧЕ ЕСТЬNULL(СтавкиНалогаНаИмуществоСрезПоследних.СнижениеНалоговойСтавки, ЛОЖЬ)
				|	КОНЕЦ КАК СнижениеНалоговойСтавки,
				|	СтавкиНалогаНаИмуществоСрезПоследних.СнижениеНалоговойСтавкиДвижимоеИмущество КАК СнижениеНалоговойСтавкиДвижимоеИмущество,
				|	ВЫБОР
				|		КОГДА СтавкиНалогаНаИмуществоПоОтдельнымОсновнымСредствамСрезПоследних.ПорядокНалогообложения = ЗНАЧЕНИЕ(Перечисление.ПорядокНалогообложенияИмущества.ОсвобождаетсяОтНалогообложения)
				|			ТОГДА ИСТИНА
				|		КОГДА СтавкиНалогаНаИмуществоПоОтдельнымОсновнымСредствамСрезПоследних.ПостановкаНаУчетВНалоговомОргане = ЗНАЧЕНИЕ(Перечисление.ПостановкаНаУчетВНалоговомОргане.ВДругомНалоговомОргане)
				|			ТОГДА ЛОЖЬ
				|		ИНАЧЕ ЕСТЬNULL(СтавкиНалогаНаИмуществоСрезПоследних.ОсвобождениеОтНалогообложения, ЛОЖЬ)
				|	КОНЕЦ КАК ОсвобождениеОтНалогообложения,
				|	СтавкиНалогаНаИмуществоСрезПоследних.ОсвобождениеОтНалогообложенияДвижимогоИмущества КАК ОсвобождениеОтНалогообложенияДвижимогоИмущества,
				|	ВЫБОР
				|		КОГДА СписокОС.ОсновноеСредство.ГруппаОС В (ЗНАЧЕНИЕ(Перечисление.ГруппыОС.Здания), ЗНАЧЕНИЕ(Перечисление.ГруппыОС.Сооружения), ЗНАЧЕНИЕ(Перечисление.ГруппыОС.МноголетниеНасаждения), ЗНАЧЕНИЕ(Перечисление.ГруппыОС.ПрочееИмуществоТребующееГосударственнойРегистрации))
				|			ТОГДА ИСТИНА
				|		ИНАЧЕ ЛОЖЬ
				|	КОНЕЦ КАК ЭтоНедвижимость,
				|	ВЫБОР КОГДА СписокОС.ОсновноеСредство В (ВЫБРАТЬ ВТДвижимоеИмуществоПринятоеКУчетуПосле2013.ОС ИЗ ВТДвижимоеИмуществоПринятоеКУчетуПосле2013 КАК ВТДвижимоеИмуществоПринятоеКУчетуПосле2013) ТОГДА ИСТИНА ИНАЧЕ ЛОЖЬ КОНЕЦ КАК ДвижимоеИмуществоПринятоеКУчетуПосле2013,
				|	ВЫБОР
				|		КОГДА СтавкиНалогаНаИмуществоПоОтдельнымОсновнымСредствамСрезПоследних.ПорядокНалогообложения = ЗНАЧЕНИЕ(Перечисление.ПорядокНалогообложенияИмущества.ОсвобождаетсяОтНалогообложения)
				|			ТОГДА СтавкиНалогаНаИмуществоПоОтдельнымОсновнымСредствамСрезПоследних.КодНалоговойЛьготыОсвобождениеОтНалогообложения
				|		ИНАЧЕ СтавкиНалогаНаИмуществоСрезПоследних.КодНалоговойЛьготыОсвобождениеОтНалогообложения
				|	КОНЕЦ КАК КодНалоговойЛьготыОсвобождениеОтНалогообложения,
				|	ЕСТЬNULL(СтавкиНалогаНаИмуществоПоОтдельнымОсновнымСредствамСрезПоследних.КодВидаИмущества, ""03"") КАК КодВидаИмущества,
				|	СтавкиНалогаНаИмуществоПоОтдельнымОсновнымСредствамСрезПоследних.ДоляСтоимостиЧислитель КАК ДоляСтоимостиЧислитель,
				|	СтавкиНалогаНаИмуществоПоОтдельнымОсновнымСредствамСрезПоследних.ДоляСтоимостиЗнаменатель КАК ДоляСтоимостиЗнаменатель,
				|	СтавкиНалогаНаИмуществоПоОтдельнымОсновнымСредствамСрезПоследних.ДвижимоеИмуществоПодлежащееНалогообложению КАК ДвижимоеИмуществоПодлежащееНалогообложению,
				|	СтавкиНалогаНаИмуществоПоОтдельнымОсновнымСредствамСрезПоследних.УсловныйНомер КАК УсловныйНомер,
				|	СтавкиНалогаНаИмуществоПоОтдельнымОсновнымСредствамСрезПоследних.КадастровыйНомер КАК КадастровыйНомер,
				|	СтавкиНалогаНаИмуществоПоОтдельнымОсновнымСредствамСрезПоследних.КадастровыйНомерПомещения КАК КадастровыйНомерПомещения,
				|	СтавкиНалогаНаИмуществоПоОтдельнымОсновнымСредствамСрезПоследних.КБК КАК КБК,
				|	" + Счетчик + " КАК Период,
				|	ВЫРАЗИТЬ((ЕСТЬNULL(ПервоначальнаяСтоимостьОС.СуммаОстатокДт, 0) - ЕСТЬNULL(ВЫБОР КОГДА СписокОС.ПорядокПогашенияСтоимости = ЗНАЧЕНИЕ(Перечисление.ПорядокПогашенияСтоимостиОС.НачислениеИзноса) ИЛИ СписокОС.ПорядокПогашенияСтоимости = ЗНАЧЕНИЕ(Перечисление.ПорядокПогашенияСтоимостиОС.НачислениеИзносаПоЕНАОФ) ТОГДА АмортизацияОС.СуммаОстатокДт ИНАЧЕ АмортизацияОС.СуммаОстатокКт КОНЕЦ, 0)) * КоэффициентыЕНВД.НеЕНВД
				|		+ (ЕСТЬNULL(ПервоначальнаяСтоимостьОС.СуммаОстатокДт, 0) - ЕСТЬNULL(ВЫБОР КОГДА СписокОС.ПорядокПогашенияСтоимости = ЗНАЧЕНИЕ(Перечисление.ПорядокПогашенияСтоимостиОС.НачислениеИзноса) ИЛИ СписокОС.ПорядокПогашенияСтоимости = ЗНАЧЕНИЕ(Перечисление.ПорядокПогашенияСтоимостиОС.НачислениеИзносаПоЕНАОФ) ТОГДА АмортизацияОС.СуммаОстатокДт ИНАЧЕ АмортизацияОС.СуммаОстатокКт КОНЕЦ, 0)) * КоэффициентыЕНВД.Распределение * &КоэффициентРаспределенияЕНВД КАК ЧИСЛО(15, 2)) КАК ОстаточнаяСтоимость
				|ПОМЕСТИТЬ
				|	Выборка" + Формат(Счетчик, "ЧЦ=2; ЧВН=") + "
				|ИЗ
				|	СписокОС
				|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СчетаБухгалтерскогоУчетаОССрезПоследних КАК СчетаБухгалтерскогоУчетаОССрезПоследних
				|			ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПервоначальнаяСтоимостьОС КАК ПервоначальнаяСтоимостьОС
				|			ПО СчетаБухгалтерскогоУчетаОССрезПоследних.ОсновноеСредство = ПервоначальнаяСтоимостьОС.Субконто1
				|			 И (СчетаБухгалтерскогоУчетаОССрезПоследних.СчетУчета = ПервоначальнаяСтоимостьОС.Счет ИЛИ ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ВыбытиеОС) = ПервоначальнаяСтоимостьОС.Счет)
				|			ЛЕВОЕ СОЕДИНЕНИЕ ВТ_АмортизацияОС КАК АмортизацияОС
				|			ПО СчетаБухгалтерскогоУчетаОССрезПоследних.ОсновноеСредство = АмортизацияОС.Субконто1
				|			 И СчетаБухгалтерскогоУчетаОССрезПоследних.СчетНачисленияАмортизации = АмортизацияОС.Счет
				|		ПО СписокОС.ОсновноеСредство = СчетаБухгалтерскогоУчетаОССрезПоследних.ОсновноеСредство
				|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СтавкиНалогаНаИмуществоПоОтдельнымОсновнымСредствамСрезПоследних КАК СтавкиНалогаНаИмуществоПоОтдельнымОсновнымСредствамСрезПоследних
				|		ПО СписокОС.ОсновноеСредство = СтавкиНалогаНаИмуществоПоОтдельнымОсновнымСредствамСрезПоследних.ОсновноеСредство,
				|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СпособыОтраженияРасходовПоАмортизацииОСБухгалтерскийУчет.СрезПоследних(&Период, Организация = &Организация И ОсновноеСредство В (ВЫБРАТЬ ОсновноеСредство ИЗ СписокОС)) КАК СпособыОтраженияРасходовПоАмортизацииОСБухгалтерскийУчетСрезПоследних
				|			ЛЕВОЕ СОЕДИНЕНИЕ КоэффициентыЕНВД
				|			ПО СпособыОтраженияРасходовПоАмортизацииОСБухгалтерскийУчетСрезПоследних.СпособыОтраженияРасходовПоАмортизации = КоэффициентыЕНВД.Ссылка
				|		ПО СписокОС.ОсновноеСредство = СпособыОтраженияРасходовПоАмортизацииОСБухгалтерскийУчетСрезПоследних.ОсновноеСредство,
				|	ВТ_СтавкиНалогаНаИмуществоСрезПоследних КАК СтавкиНалогаНаИмуществоСрезПоследних
				|";
				Запрос.Выполнить();
				
			Иначе
				
				Запрос.Текст = Запрос.Текст +
				"ВЫБРАТЬ РАЗРЕШЕННЫЕ
				|	СписокОС.ОсновноеСредство,
				|	ВЫБОР
				|		КОГДА СписокОС.ОсновноеСредство.АмортизационнаяГруппа В (ЗНАЧЕНИЕ(Перечисление.АмортизационныеГруппы.ПерваяГруппа), ЗНАЧЕНИЕ(Перечисление.АмортизационныеГруппы.ВтораяГруппа))
				|			ТОГДА ИСТИНА
				|		ИНАЧЕ ЛОЖЬ
				|	КОНЕЦ КАК ЭтоПерваяВтораяАмортизационныеГруппы,
				|	ВЫБОР
				|		КОГДА СтавкиНалогаНаИмуществоПоОтдельнымОсновнымСредствамСрезПоследних.ПостановкаНаУчетВНалоговомОргане = ЗНАЧЕНИЕ(Перечисление.ПостановкаНаУчетВНалоговомОргане.ВДругомНалоговомОргане)
				|			ТОГДА СтавкиНалогаНаИмуществоПоОтдельнымОсновнымСредствамСрезПоследних.НалоговыйОрган
				|		ИНАЧЕ 
				|			&ОсновнойНалоговыйОрган
				|	КОНЕЦ КАК РегистрацияВНалоговомОргане,
				|	ВЫБОР
				|		КОГДА СтавкиНалогаНаИмуществоПоОтдельнымОсновнымСредствамСрезПоследних.ПостановкаНаУчетВНалоговомОргане = ЗНАЧЕНИЕ(Перечисление.ПостановкаНаУчетВНалоговомОргане.СДругимКодомПоОКАТО)
				|		  ИЛИ СтавкиНалогаНаИмуществоПоОтдельнымОсновнымСредствамСрезПоследних.ПостановкаНаУчетВНалоговомОргане = ЗНАЧЕНИЕ(Перечисление.ПостановкаНаУчетВНалоговомОргане.ВДругомНалоговомОргане)
				|		ТОГДА 
				|			СтавкиНалогаНаИмуществоПоОтдельнымОсновнымСредствамСрезПоследних.КодПоОКТМО
				|		ИНАЧЕ 
				|			ЕСТЬNULL(СтавкиНалогаНаИмуществоСрезПоследних.Организация.РегистрацияВНалоговомОргане.КодПоОКТМО, """")
				|	КОНЕЦ КАК КодПоОКТМО,
				|	ЕСТЬNULL(ВЫБОР
				|			КОГДА СтавкиНалогаНаИмуществоПоОтдельнымОсновнымСредствамСрезПоследних.ПорядокНалогообложения = ЗНАЧЕНИЕ(Перечисление.ПорядокНалогообложенияИмущества.ОблагаетсяПоСниженнойСтавке)
				|				ТОГДА СтавкиНалогаНаИмуществоПоОтдельнымОсновнымСредствамСрезПоследних.СниженнаяНалоговаяСтавка
				|			КОГДА СтавкиНалогаНаИмуществоПоОтдельнымОсновнымСредствамСрезПоследних.ПостановкаНаУчетВНалоговомОргане = ЗНАЧЕНИЕ(Перечисление.ПостановкаНаУчетВНалоговомОргане.ВДругомНалоговомОргане)
				|				ТОГДА СтавкиНалогаНаИмуществоПоОтдельнымОсновнымСредствамСрезПоследних.НалоговаяСтавка
				|			ИНАЧЕ
				|				ВЫБОР
				|					КОГДА СписокОС.ОсновноеСредство В (ВЫБРАТЬ ВТДвижимоеИмуществоПринятоеКУчетуПосле2013.ОС ИЗ ВТДвижимоеИмуществоПринятоеКУчетуПосле2013 КАК ВТДвижимоеИмуществоПринятоеКУчетуПосле2013)
				|						И НЕ ЕСТЬNULL(СтавкиНалогаНаИмуществоПоОтдельнымОсновнымСредствамСрезПоследних.ДвижимоеИмуществоПодлежащееНалогообложению, ЛОЖЬ)
				|						И &Год >= 2018 ТОГДА
				|							СтавкиНалогаНаИмуществоСрезПоследних.НалоговаяСтавкаДвижимоеИмущество
				|					ИНАЧЕ
				|							СтавкиНалогаНаИмуществоСрезПоследних.НалоговаяСтавка
				|				КОНЕЦ
				|			КОНЕЦ, СтавкиНалогаНаИмуществоСрезПоследних.НалоговаяСтавка) КАК НалоговаяСтавка,
				|	ВЫБОР
				|		КОГДА СтавкиНалогаНаИмуществоПоОтдельнымОсновнымСредствамСрезПоследних.ПорядокНалогообложения = ЗНАЧЕНИЕ(Перечисление.ПорядокНалогообложенияИмущества.ОблагаетсяПоСниженнойСтавке)
				|			ТОГДА ИСТИНА
				|		КОГДА СтавкиНалогаНаИмуществоПоОтдельнымОсновнымСредствамСрезПоследних.ПостановкаНаУчетВНалоговомОргане = ЗНАЧЕНИЕ(Перечисление.ПостановкаНаУчетВНалоговомОргане.ВДругомНалоговомОргане)
				|			ТОГДА ЛОЖЬ
				|		ИНАЧЕ ЕСТЬNULL(СтавкиНалогаНаИмуществоСрезПоследних.СнижениеНалоговойСтавки, ЛОЖЬ)
				|	КОНЕЦ КАК СнижениеНалоговойСтавки,
				|	СтавкиНалогаНаИмуществоСрезПоследних.СнижениеНалоговойСтавкиДвижимоеИмущество КАК СнижениеНалоговойСтавкиДвижимоеИмущество,
				|	ВЫБОР
				|		КОГДА СтавкиНалогаНаИмуществоПоОтдельнымОсновнымСредствамСрезПоследних.ПорядокНалогообложения = ЗНАЧЕНИЕ(Перечисление.ПорядокНалогообложенияИмущества.ОсвобождаетсяОтНалогообложения)
				|			ТОГДА ИСТИНА
				|		КОГДА СтавкиНалогаНаИмуществоПоОтдельнымОсновнымСредствамСрезПоследних.ПостановкаНаУчетВНалоговомОргане = ЗНАЧЕНИЕ(Перечисление.ПостановкаНаУчетВНалоговомОргане.ВДругомНалоговомОргане)
				|			ТОГДА ЛОЖЬ
				|		ИНАЧЕ ЕСТЬNULL(СтавкиНалогаНаИмуществоСрезПоследних.ОсвобождениеОтНалогообложения, ЛОЖЬ)
				|	КОНЕЦ КАК ОсвобождениеОтНалогообложения,
				|	СтавкиНалогаНаИмуществоСрезПоследних.ОсвобождениеОтНалогообложенияДвижимогоИмущества КАК ОсвобождениеОтНалогообложенияДвижимогоИмущества,
				|	ВЫБОР
				|		КОГДА СписокОС.ОсновноеСредство.ГруппаОС В (ЗНАЧЕНИЕ(Перечисление.ГруппыОС.Здания), ЗНАЧЕНИЕ(Перечисление.ГруппыОС.Сооружения), ЗНАЧЕНИЕ(Перечисление.ГруппыОС.МноголетниеНасаждения), ЗНАЧЕНИЕ(Перечисление.ГруппыОС.ПрочееИмуществоТребующееГосударственнойРегистрации))
				|			ТОГДА ИСТИНА
				|		ИНАЧЕ ЛОЖЬ
				|	КОНЕЦ КАК ЭтоНедвижимость,
				|	ВЫБОР КОГДА СписокОС.ОсновноеСредство В (ВЫБРАТЬ ВТДвижимоеИмуществоПринятоеКУчетуПосле2013.ОС ИЗ ВТДвижимоеИмуществоПринятоеКУчетуПосле2013 КАК ВТДвижимоеИмуществоПринятоеКУчетуПосле2013) ТОГДА ИСТИНА ИНАЧЕ ЛОЖЬ КОНЕЦ КАК ДвижимоеИмуществоПринятоеКУчетуПосле2013,
				|	ВЫБОР
				|		КОГДА СтавкиНалогаНаИмуществоПоОтдельнымОсновнымСредствамСрезПоследних.ПорядокНалогообложения = ЗНАЧЕНИЕ(Перечисление.ПорядокНалогообложенияИмущества.ОсвобождаетсяОтНалогообложения)
				|			ТОГДА СтавкиНалогаНаИмуществоПоОтдельнымОсновнымСредствамСрезПоследних.КодНалоговойЛьготыОсвобождениеОтНалогообложения
				|		ИНАЧЕ СтавкиНалогаНаИмуществоСрезПоследних.КодНалоговойЛьготыОсвобождениеОтНалогообложения
				|	КОНЕЦ КАК КодНалоговойЛьготыОсвобождениеОтНалогообложения,
				|	ЕСТЬNULL(СтавкиНалогаНаИмуществоПоОтдельнымОсновнымСредствамСрезПоследних.КодВидаИмущества, ""03"") КАК КодВидаИмущества,
				|	СтавкиНалогаНаИмуществоПоОтдельнымОсновнымСредствамСрезПоследних.ДоляСтоимостиЧислитель КАК ДоляСтоимостиЧислитель,
				|	СтавкиНалогаНаИмуществоПоОтдельнымОсновнымСредствамСрезПоследних.ДоляСтоимостиЗнаменатель КАК ДоляСтоимостиЗнаменатель,
				|	СтавкиНалогаНаИмуществоПоОтдельнымОсновнымСредствамСрезПоследних.ДвижимоеИмуществоПодлежащееНалогообложению КАК ДвижимоеИмуществоПодлежащееНалогообложению,
				|	СтавкиНалогаНаИмуществоПоОтдельнымОсновнымСредствамСрезПоследних.УсловныйНомер КАК УсловныйНомер,
				|	СтавкиНалогаНаИмуществоПоОтдельнымОсновнымСредствамСрезПоследних.КадастровыйНомер КАК КадастровыйНомер,
				|	СтавкиНалогаНаИмуществоПоОтдельнымОсновнымСредствамСрезПоследних.КадастровыйНомерПомещения КАК КадастровыйНомерПомещения,
				|	СтавкиНалогаНаИмуществоПоОтдельнымОсновнымСредствамСрезПоследних.КБК КАК КБК,
				|	" + Счетчик + " КАК Период,
				|	ВЫРАЗИТЬ(ЕСТЬNULL(ПервоначальнаяСтоимостьОС.СуммаОстатокДт, 0) - ЕСТЬNULL(ВЫБОР КОГДА СписокОС.ПорядокПогашенияСтоимости = ЗНАЧЕНИЕ(Перечисление.ПорядокПогашенияСтоимостиОС.НачислениеИзноса) ИЛИ СписокОС.ПорядокПогашенияСтоимости = ЗНАЧЕНИЕ(Перечисление.ПорядокПогашенияСтоимостиОС.НачислениеИзносаПоЕНАОФ) ТОГДА АмортизацияОС.СуммаОстатокДт ИНАЧЕ АмортизацияОС.СуммаОстатокКт КОНЕЦ, 0) КАК ЧИСЛО(15, 2)) КАК ОстаточнаяСтоимость
				|ПОМЕСТИТЬ
				|	Выборка" + Формат(Счетчик, "ЧЦ=2; ЧВН=") + "
				|ИЗ
				|	СписокОС
				|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СчетаБухгалтерскогоУчетаОССрезПоследних КАК СчетаБухгалтерскогоУчетаОССрезПоследних
				|			ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПервоначальнаяСтоимостьОС КАК ПервоначальнаяСтоимостьОС
				|			ПО СчетаБухгалтерскогоУчетаОССрезПоследних.ОсновноеСредство = ПервоначальнаяСтоимостьОС.Субконто1
				|			 И (СчетаБухгалтерскогоУчетаОССрезПоследних.СчетУчета = ПервоначальнаяСтоимостьОС.Счет ИЛИ ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ВыбытиеОС) = ПервоначальнаяСтоимостьОС.Счет)
				|			ЛЕВОЕ СОЕДИНЕНИЕ ВТ_АмортизацияОС КАК АмортизацияОС
				|			ПО СчетаБухгалтерскогоУчетаОССрезПоследних.ОсновноеСредство = АмортизацияОС.Субконто1
				|			 И СчетаБухгалтерскогоУчетаОССрезПоследних.СчетНачисленияАмортизации = АмортизацияОС.Счет
				|		ПО СписокОС.ОсновноеСредство = СчетаБухгалтерскогоУчетаОССрезПоследних.ОсновноеСредство
				|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СтавкиНалогаНаИмуществоПоОтдельнымОсновнымСредствамСрезПоследних КАК СтавкиНалогаНаИмуществоПоОтдельнымОсновнымСредствамСрезПоследних
				|		ПО СписокОС.ОсновноеСредство = СтавкиНалогаНаИмуществоПоОтдельнымОсновнымСредствамСрезПоследних.ОсновноеСредство,
				|	ВТ_СтавкиНалогаНаИмуществоСрезПоследних КАК СтавкиНалогаНаИмуществоСрезПоследних
				|";
				Запрос.Выполнить();
				
			КонецЕсли;
			
			Запрос.Текст = 
			"УНИЧТОЖИТЬ СтавкиНалогаНаИмуществоПоОтдельнымОсновнымСредствамСрезПоследнихПериодов;
			|УНИЧТОЖИТЬ ВТ_СтавкиНалогаНаИмуществоПоОтдельнымОсновнымСредствамСрезПоследних;
			|УНИЧТОЖИТЬ ВТ_СрезПоследних;
			|УНИЧТОЖИТЬ СтавкиНалогаНаИмуществоПоОтдельнымОсновнымСредствамСрезПоследних;
			|УНИЧТОЖИТЬ СписокОС;
			|УНИЧТОЖИТЬ ВТ_ПервоначальнаяСтоимостьОС;
			|УНИЧТОЖИТЬ ВТ_СчетаБухгалтерскогоУчетаОССрезПоследних;
			|УНИЧТОЖИТЬ ВТ_СтавкиНалогаНаИмуществоСрезПоследних;
			|УНИЧТОЖИТЬ ВТ_АмортизацияОС;
			|УНИЧТОЖИТЬ СписокРазрешенныхОС";
			Запрос.Выполнить();
			
			ТекстОбъединяющегоЗапроса = ТекстОбъединяющегоЗапроса
									  + ?(ПустаяСтрока(ТекстОбъединяющегоЗапроса), 
										  "ВЫБРАТЬ РАЗРЕШЕННЫЕ *
			                              |",
										  "ОБЪЕДИНИТЬ ВСЕ
										  |ВЫБРАТЬ *
			                              |")
									  + ?(ПустаяСтрока(ТекстОбъединяющегоЗапроса), 
										  "ПОМЕСТИТЬ НалоговаяБазаПоНалогуНаИмущество
										  |",
										  "")
									  + "ИЗ Выборка" + Формат(Счетчик, "ЧЦ=2; ЧВН=") + "
			                            |ГДЕ
			                            |	ОстаточнаяСтоимость > 0
										|";
			
		КонецЕсли;
		
		Счетчик = Счетчик + 1;
		Период  = ДобавитьМесяц(Период, 1);
	КонецЦикла;
	
	Если ТекстОбъединяющегоЗапроса <> "" Тогда
		
		Запрос.Текст = ТекстОбъединяющегоЗапроса;	
		Запрос.Выполнить();
		
		РегистрыСведений.ПорядокУплатыНалоговНаМестах.СоздатьНалоговыеОрганыСУстановленнойУплатойАвансов(
			Запрос.МенеджерВременныхТаблиц, Организация, ПериодРасчета, "НалогНаИмущество");
		
		Делитель = Месяц(ПериодРасчета) + 1;
		Запрос.УстановитьПараметр("КонечныйПериод", Делитель);
		Запрос.УстановитьПараметр("КодЛьготыДвижимоеИмуществоПринятоеКУчетуПосле2013", "2010257");
		
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	НалоговаяБазаПоНалогуНаИмущество.Период КАК Период,
		|	ЕСТЬNULL(НалоговаяБазаПоНалогуНаИмущество.КодВидаИмущества, ""03"") КАК КодВидаИмущества,
		|	ЕСТЬNULL(НалоговаяБазаПоНалогуНаИмущество.ДоляСтоимостиЧислитель, 0) КАК ДоляСтоимостиЧислитель,
		|	ЕСТЬNULL(НалоговаяБазаПоНалогуНаИмущество.ДоляСтоимостиЗнаменатель, 0) КАК ДоляСтоимостиЗнаменатель,
		|	ЕСТЬNULL(НалоговаяБазаПоНалогуНаИмущество.УсловныйНомер, """") КАК УсловныйНомер,
		|	ЕСТЬNULL(НалоговаяБазаПоНалогуНаИмущество.КадастровыйНомер, """") КАК КадастровыйНомер,
		|	ЕСТЬNULL(НалоговаяБазаПоНалогуНаИмущество.КадастровыйНомерПомещения, """") КАК КадастровыйНомерПомещения,
		|	ЕСТЬNULL(НалоговаяБазаПоНалогуНаИмущество.КБК, """") КАК КБК,
		|	НалоговаяБазаПоНалогуНаИмущество.РегистрацияВНалоговомОргане КАК ИФНС,
		|	НалоговаяБазаПоНалогуНаИмущество.КодПоОКТМО КАК КодПоОКТМО,
		|	ЕСТЬNULL(НалоговаяБазаПоНалогуНаИмущество.НалоговаяСтавка, 0) КАК НалоговаяСтавка,
		|	ВЫБОР
		|		КОГДА НалоговаяБазаПоНалогуНаИмущество.СнижениеНалоговойСтавки
		|			ТОГДА
		|				ИСТИНА
		|			ИНАЧЕ
		|				ВЫБОР
		|					КОГДА &Год >= 2018
		|						И (НалоговаяБазаПоНалогуНаИмущество.ДвижимоеИмуществоПринятоеКУчетуПосле2013
		|						И НЕ ЕСТЬNULL(НалоговаяБазаПоНалогуНаИмущество.ДвижимоеИмуществоПодлежащееНалогообложению, ЛОЖЬ)) ТОГДА
		|							НалоговаяБазаПоНалогуНаИмущество.СнижениеНалоговойСтавкиДвижимоеИмущество
		|				КОНЕЦ
		|	КОНЕЦ КАК ПонижениеНалоговойСтавки,
		|	ВЫБОР
		|		КОГДА НалоговаяБазаПоНалогуНаИмущество.ОсвобождениеОтНалогообложения
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ВЫБОР
		|				КОГДА &Год >= 2015
		|						И (НалоговаяБазаПоНалогуНаИмущество.ДвижимоеИмуществоПринятоеКУчетуПосле2013
		|							И НЕ ЕСТЬNULL(НалоговаяБазаПоНалогуНаИмущество.ДвижимоеИмуществоПодлежащееНалогообложению, ЛОЖЬ))
		|						И ВЫБОР
		|							КОГДА &Год >= 2018
		|								ТОГДА НалоговаяБазаПоНалогуНаИмущество.ОсвобождениеОтНалогообложенияДвижимогоИмущества
		|							ИНАЧЕ ИСТИНА
		|						КОНЕЦ
		|						И НЕ НалоговаяБазаПоНалогуНаИмущество.ЭтоПерваяВтораяАмортизационныеГруппы
		|					ТОГДА ИСТИНА
		|				ИНАЧЕ ЛОЖЬ
		|			КОНЕЦ
		|	КОНЕЦ КАК ОсвобождениеОтНалогообложения,
		|	ВЫБОР
		|		КОГДА НалоговаяБазаПоНалогуНаИмущество.ОсвобождениеОтНалогообложения
		|			ТОГДА НалоговаяБазаПоНалогуНаИмущество.КодНалоговойЛьготыОсвобождениеОтНалогообложения
		|		ИНАЧЕ ВЫБОР
		|				КОГДА &Год >= 2015
		|						И (НалоговаяБазаПоНалогуНаИмущество.ДвижимоеИмуществоПринятоеКУчетуПосле2013
		|							И НЕ ЕСТЬNULL(НалоговаяБазаПоНалогуНаИмущество.ДвижимоеИмуществоПодлежащееНалогообложению, ЛОЖЬ))
		|						И ВЫБОР
		|							КОГДА &Год >= 2018
		|								ТОГДА НалоговаяБазаПоНалогуНаИмущество.ОсвобождениеОтНалогообложенияДвижимогоИмущества
		|							ИНАЧЕ ИСТИНА
		|						КОНЕЦ
		|						И НЕ НалоговаяБазаПоНалогуНаИмущество.ЭтоПерваяВтораяАмортизационныеГруппы
		|					ТОГДА &КодЛьготыДвижимоеИмуществоПринятоеКУчетуПосле2013
		|				ИНАЧЕ """"
		|			КОНЕЦ
		|	КОНЕЦ КАК КодНалоговойЛьготыОсвобождениеОтНалогообложения,
		|	НалоговаяБазаПоНалогуНаИмущество.ОсновноеСредство КАК ОсновноеСредство,
		|	ВЫБОР
		|		КОГДА ВТ_НалоговыеОрганыСУстановленнойУплатойАвансов.НалоговыйОрган ЕСТЬ NULL
		|			ТОГДА ЛОЖЬ
		|		ИНАЧЕ ИСТИНА
		|	КОНЕЦ КАК УплачиваютсяАвансы,
		|	ВЫБОР
		|		КОГДА &Год < 2015
		|					И НалоговаяБазаПоНалогуНаИмущество.ДвижимоеИмуществоПринятоеКУчетуПосле2013
		|				ИЛИ &Год >= 2015
		|					И НалоговаяБазаПоНалогуНаИмущество.ЭтоПерваяВтораяАмортизационныеГруппы
		|			ТОГДА 0
		|		ИНАЧЕ НалоговаяБазаПоНалогуНаИмущество.ОстаточнаяСтоимость
		|	КОНЕЦ КАК ОстаточнаяСтоимость,
		|	ВЫБОР
		|		КОГДА НалоговаяБазаПоНалогуНаИмущество.ЭтоНедвижимость
		|			ТОГДА НалоговаяБазаПоНалогуНаИмущество.ОстаточнаяСтоимость
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК ОстаточнаяСтоимостьНедвижимости,
		|	НалоговаяБазаПоНалогуНаИмущество.ОстаточнаяСтоимость КАК ОстаточнаяСтоимостьОсновныхСредств
		|ПОМЕСТИТЬ ВТ_НалоговаяБаза
		|ИЗ
		|	НалоговаяБазаПоНалогуНаИмущество КАК НалоговаяБазаПоНалогуНаИмущество
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_НалоговыеОрганыСУстановленнойУплатойАвансов КАК ВТ_НалоговыеОрганыСУстановленнойУплатойАвансов
		|		ПО НалоговаяБазаПоНалогуНаИмущество.РегистрацияВНалоговомОргане = ВТ_НалоговыеОрганыСУстановленнойУплатойАвансов.НалоговыйОрган
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_НалоговаяБаза.КодВидаИмущества КАК КодВидаИмущества,
		|	ВТ_НалоговаяБаза.ДоляСтоимостиЧислитель КАК ДоляСтоимостиЧислитель,
		|	ВТ_НалоговаяБаза.ДоляСтоимостиЗнаменатель КАК ДоляСтоимостиЗнаменатель,
		|	ВТ_НалоговаяБаза.ИФНС КАК ИФНС,
		|	ВТ_НалоговаяБаза.КодПоОКТМО КАК КодПоОКТМО,
		|	ВТ_НалоговаяБаза.НалоговаяСтавка КАК НалоговаяСтавка,
		|	ВТ_НалоговаяБаза.ПонижениеНалоговойСтавки КАК ПонижениеНалоговойСтавки,
		|	ВТ_НалоговаяБаза.ОсвобождениеОтНалогообложения КАК ОсвобождениеОтНалогообложения,
		|	ВТ_НалоговаяБаза.КодНалоговойЛьготыОсвобождениеОтНалогообложения КАК КодНалоговойЛьготыОсвобождениеОтНалогообложения,
		|	ВТ_НалоговаяБаза.ОсновноеСредство КАК ОсновноеСредство,
		|	ВТ_НалоговаяБаза.УплачиваютсяАвансы КАК УплачиваютсяАвансы,
		|	ВТ_НалоговаяБаза.УсловныйНомер КАК УсловныйНомер,
		|	ВТ_НалоговаяБаза.КадастровыйНомер КАК КадастровыйНомер,
		|	ВТ_НалоговаяБаза.КадастровыйНомерПомещения КАК КадастровыйНомерПомещения,
		|	ВТ_НалоговаяБаза.КБК КАК КБК,
		|	СУММА(ВЫБОР
		|			КОГДА ВТ_НалоговаяБаза.Период = 1
		|				ТОГДА ВТ_НалоговаяБаза.ОстаточнаяСтоимость
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК ОстаточнаяСтоимостьНа0101,
		|	СУММА(ВЫБОР
		|			КОГДА ВТ_НалоговаяБаза.Период = 2
		|				ТОГДА ВТ_НалоговаяБаза.ОстаточнаяСтоимость
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК ОстаточнаяСтоимостьНа0102,
		|	СУММА(ВЫБОР
		|			КОГДА ВТ_НалоговаяБаза.Период = 3
		|				ТОГДА ВТ_НалоговаяБаза.ОстаточнаяСтоимость
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК ОстаточнаяСтоимостьНа0103,
		|	СУММА(ВЫБОР
		|			КОГДА ВТ_НалоговаяБаза.Период = 4
		|				ТОГДА ВТ_НалоговаяБаза.ОстаточнаяСтоимость
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК ОстаточнаяСтоимостьНа0104,
		|	СУММА(ВЫБОР
		|			КОГДА ВТ_НалоговаяБаза.Период = 5
		|				ТОГДА ВТ_НалоговаяБаза.ОстаточнаяСтоимость
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК ОстаточнаяСтоимостьНа0105,
		|	СУММА(ВЫБОР
		|			КОГДА ВТ_НалоговаяБаза.Период = 6
		|				ТОГДА ВТ_НалоговаяБаза.ОстаточнаяСтоимость
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК ОстаточнаяСтоимостьНа0106,
		|	СУММА(ВЫБОР
		|			КОГДА ВТ_НалоговаяБаза.Период = 7
		|				ТОГДА ВТ_НалоговаяБаза.ОстаточнаяСтоимость
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК ОстаточнаяСтоимостьНа0107,
		|	СУММА(ВЫБОР
		|			КОГДА ВТ_НалоговаяБаза.Период = 8
		|				ТОГДА ВТ_НалоговаяБаза.ОстаточнаяСтоимость
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК ОстаточнаяСтоимостьНа0108,
		|	СУММА(ВЫБОР
		|			КОГДА ВТ_НалоговаяБаза.Период = 9
		|				ТОГДА ВТ_НалоговаяБаза.ОстаточнаяСтоимость
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК ОстаточнаяСтоимостьНа0109,
		|	СУММА(ВЫБОР
		|			КОГДА ВТ_НалоговаяБаза.Период = 10
		|				ТОГДА ВТ_НалоговаяБаза.ОстаточнаяСтоимость
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК ОстаточнаяСтоимостьНа0110,
		|	СУММА(ВЫБОР
		|			КОГДА ВТ_НалоговаяБаза.Период = 11
		|				ТОГДА ВТ_НалоговаяБаза.ОстаточнаяСтоимость
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК ОстаточнаяСтоимостьНа0111,
		|	СУММА(ВЫБОР
		|			КОГДА ВТ_НалоговаяБаза.Период = 12
		|				ТОГДА ВТ_НалоговаяБаза.ОстаточнаяСтоимость
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК ОстаточнаяСтоимостьНа0112,
		|	СУММА(ВЫБОР
		|			КОГДА ВТ_НалоговаяБаза.Период = 13
		|				ТОГДА ВТ_НалоговаяБаза.ОстаточнаяСтоимость
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК ОстаточнаяСтоимостьНа3112,
		|	СУММА(ВЫБОР
		|			КОГДА ВТ_НалоговаяБаза.Период = &КонечныйПериод
		|				ТОГДА ВТ_НалоговаяБаза.ОстаточнаяСтоимостьНедвижимости
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК ОстаточнаяСтоимостьНедвижимости,
		|	СУММА(ВЫБОР
		|			КОГДА ВТ_НалоговаяБаза.Период = &КонечныйПериод
		|				ТОГДА ВТ_НалоговаяБаза.ОстаточнаяСтоимостьОсновныхСредств
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК ОстаточнаяСтоимостьОсновныхСредств
		|ИЗ
		|	ВТ_НалоговаяБаза КАК ВТ_НалоговаяБаза
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_НалоговаяБаза.КодВидаИмущества,
		|	ВТ_НалоговаяБаза.ДоляСтоимостиЧислитель,
		|	ВТ_НалоговаяБаза.ДоляСтоимостиЗнаменатель,
		|	ВТ_НалоговаяБаза.ИФНС,
		|	ВТ_НалоговаяБаза.КодПоОКТМО,
		|	ВТ_НалоговаяБаза.НалоговаяСтавка,
		|	ВТ_НалоговаяБаза.ПонижениеНалоговойСтавки,
		|	ВТ_НалоговаяБаза.ОсвобождениеОтНалогообложения,
		|	ВТ_НалоговаяБаза.КодНалоговойЛьготыОсвобождениеОтНалогообложения,
		|	ВТ_НалоговаяБаза.ОсновноеСредство,
		|	ВТ_НалоговаяБаза.УплачиваютсяАвансы,
		|	ВТ_НалоговаяБаза.УсловныйНомер,
		|	ВТ_НалоговаяБаза.КадастровыйНомер,
		|	ВТ_НалоговаяБаза.КадастровыйНомерПомещения,
		|	ВТ_НалоговаяБаза.КБК";
		
		Результат = Запрос.Выполнить();
		
		Если Не Результат.Пустой() Тогда
			
			РасчетНалога = Результат.Выгрузить();
			
			КолонкиГруппировок = ""
			+ "УплачиваютсяАвансы,"
			+ "ИФНС,"
			+ "КодПоОКТМО,"
			+ "КодВидаИмущества,"
			+ "КБК,"
			+ "ДоляСтоимостиЧислитель,"
			+ "ДоляСтоимостиЗнаменатель,"
			+ "НалоговаяСтавка,"
			+ "ПонижениеНалоговойСтавки,"
			+ "ОсвобождениеОтНалогообложения,"
			+ "КодНалоговойЛьготыОсвобождениеОтНалогообложения";
			
			КолонкиСуммирования = ""
			+ "ОстаточнаяСтоимостьНа0101,"
			+ "ОстаточнаяСтоимостьНа0102,"
			+ "ОстаточнаяСтоимостьНа0103,"
			+ "ОстаточнаяСтоимостьНа0104,"
			+ "ОстаточнаяСтоимостьНа0105,"
			+ "ОстаточнаяСтоимостьНа0106,"
			+ "ОстаточнаяСтоимостьНа0107,"
			+ "ОстаточнаяСтоимостьНа0108,"
			+ "ОстаточнаяСтоимостьНа0109,"
			+ "ОстаточнаяСтоимостьНа0110,"
			+ "ОстаточнаяСтоимостьНа0111,"
			+ "ОстаточнаяСтоимостьНа0112,"
			+ "ОстаточнаяСтоимостьНа3112";
			
			КолонкиРасчета = "" 
			+ "СредняяСтоимость,"
			+ "НеоблагаемаяСредняяСтоимость,"
			+ "НалоговаяБаза,"
			+ "СуммаНалога,"
			+ "СуммаУменьшенияСуммыНалога,"
			+ "СуммаНалогаКУплате,"
			+ "СуммаАвансовыхПлатежей1Кв,"
			+ "СуммаАвансовыхПлатежей2Кв,"
			+ "СуммаАвансовыхПлатежей3Кв";
			
			РасчетНалогаПоЛистам = РасчетНалога.Скопировать();
			РасчетНалогаПоЛистам.Свернуть(КолонкиГруппировок, КолонкиСуммирования);
			
			ДопКолонки = Новый Структура(КолонкиРасчета);
			Для каждого Колонка Из ДопКолонки Цикл
				РасчетНалогаПоЛистам.Колонки.Добавить(Колонка.Ключ,
					ОбщегоНазначения.ОписаниеТипаЧисло(15, 0, ДопустимыйЗнак.Неотрицательный));
			КонецЦикла;
			
			// С целью оптимизации производительности список имён полей-периодов формируется заранее, а не динамически в циклах.
			КолонкиПериоды = Новый ТаблицаЗначений;
			КолонкиПериоды.Колонки.Добавить("Счетчик", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(2, 0, ДопустимыйЗнак.Неотрицательный)));
			КолонкиПериоды.Колонки.Добавить("ОстаточнаяСтоимостьИмя", Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(25, ДопустимаяДлина.Фиксированная)));
			Для Счетчик = 1 По Делитель Цикл
				
				КолонкаПериод = КолонкиПериоды.Добавить();
				КолонкаПериод.Счетчик                = Счетчик;
				КолонкаПериод.ОстаточнаяСтоимостьИмя = "ОстаточнаяСтоимостьНа" + ?(Счетчик = 13, "3112", "01" + Формат(Счетчик, "ЧЦ=2; ЧВН="));
			
			КонецЦикла;
				
			Отбор = Новый Структура(КолонкиГруппировок);
			РасчетНалогаПоЛистам.Индексы.Добавить(КолонкиГруппировок);
				
			Для Каждого СтрокаТаблицы Из РасчетНалогаПоЛистам Цикл
				
				Если НЕ ГодовойРасчет И НЕ СтрокаТаблицы.УплачиваютсяАвансы Тогда
					Продолжить;
				КонецЕсли;
				
				Если НЕ ГодовойРасчет И (СтрокаТаблицы.КодВидаИмущества = "04" ИЛИ СтрокаТаблицы.КодВидаИмущества = "07") Тогда
					Продолжить;
				КонецЕсли;
				
				УчитыватьАвансы = ГодовойРасчет И СтрокаТаблицы.УплачиваютсяАвансы;
				
				ДоляСтоимости = 1;
				
				КодВидаИмущества = ?(ПустаяСтрока(СтрокаТаблицы.КодВидаИмущества), "03", СтрокаТаблицы.КодВидаИмущества);
				Если КодВидаИмущества = "04" Тогда
					ДоляСтоимости = 0;
				ИначеЕсли КодВидаИмущества = "02" Тогда
					ДоляСтоимости = СтрокаТаблицы.ДоляСтоимостиЧислитель / СтрокаТаблицы.ДоляСтоимостиЗнаменатель;
				КонецЕсли;
				
				ДелимоеСредняяСтоимость = 0;
				ДелимоеНеоблагаемаяСредняяСтоимость = 0;
				Для каждого КолонкаПериод Из КолонкиПериоды Цикл
					Счетчик = КолонкаПериод.Счетчик;
					
					СтрокаТаблицы[КолонкаПериод.ОстаточнаяСтоимостьИмя] = Окр(СтрокаТаблицы[КолонкаПериод.ОстаточнаяСтоимостьИмя]);
					ДелимоеСредняяСтоимость = ДелимоеСредняяСтоимость + СтрокаТаблицы[КолонкаПериод.ОстаточнаяСтоимостьИмя];
					
					Если СтрокаТаблицы.ОсвобождениеОтНалогообложения Тогда
						ДелимоеНеоблагаемаяСредняяСтоимость = ДелимоеНеоблагаемаяСредняяСтоимость + СтрокаТаблицы[КолонкаПериод.ОстаточнаяСтоимостьИмя];
					КонецЕсли;
					
					Если УчитыватьАвансы И Счетчик - 1 <> 0 И (Счетчик - 1) % 3 = 0 Тогда
						
						ПрименениеУСН = УчетнаяПолитика.ПрименяетсяУСН(Организация, Дата(Год(ПериодРасчета), Счетчик - 3, 1));
						СредняяСтоимость = ?(ПрименениеУСН, 0, ДелимоеСредняяСтоимость / Счетчик);
						НеоблагаемаяСредняяСтоимость = ?(ПрименениеУСН, 0, ДелимоеНеоблагаемаяСредняяСтоимость / Счетчик);
						
						Если Счетчик = 4 Тогда
							СредняяСтоимость1Кв = СредняяСтоимость;
							НеоблагаемаяСредняяСтоимость1Кв = НеоблагаемаяСредняяСтоимость;
						ИначеЕсли Счетчик = 7 Тогда
							СредняяСтоимость2Кв = СредняяСтоимость;
							НеоблагаемаяСредняяСтоимость2Кв = НеоблагаемаяСредняяСтоимость;
						ИначеЕсли Счетчик = 10 Тогда
							СредняяСтоимость3Кв = СредняяСтоимость;
							НеоблагаемаяСредняяСтоимость3Кв = НеоблагаемаяСредняяСтоимость;
						КонецЕсли;
						
					КонецЕсли;
					
				КонецЦикла;
				
				СтрокаТаблицы.СредняяСтоимость = Окр(ДелимоеСредняяСтоимость / Делитель);
				СтрокаТаблицы.НеоблагаемаяСредняяСтоимость = Окр(ДелимоеНеоблагаемаяСредняяСтоимость / Делитель);
				
				СтоимостьОблагаемогоНалогомИмущества = Макс(СтрокаТаблицы.СредняяСтоимость - СтрокаТаблицы.НеоблагаемаяСредняяСтоимость, 0);
				
				Если УчитыватьАвансы Тогда
					СтоимостьОблагаемогоНалогомИмущества1Кв = Макс(СредняяСтоимость1Кв - НеоблагаемаяСредняяСтоимость1Кв, 0);
					СтоимостьОблагаемогоНалогомИмущества2Кв = Макс(СредняяСтоимость2Кв - НеоблагаемаяСредняяСтоимость2Кв, 0);
					СтоимостьОблагаемогоНалогомИмущества3Кв = Макс(СредняяСтоимость3Кв - НеоблагаемаяСредняяСтоимость3Кв, 0);
				КонецЕсли;
				
				СтрокаТаблицы.НалоговаяБаза = Окр(СтоимостьОблагаемогоНалогомИмущества * ДоляСтоимости);	
				
				Если ГодовойРасчет Тогда
					СтрокаТаблицы.СуммаНалога = Окр(СтрокаТаблицы.НалоговаяБаза * СтрокаТаблицы.НалоговаяСтавка / 100);
				Иначе	
					СтрокаТаблицы.СуммаНалога = Окр(СтоимостьОблагаемогоНалогомИмущества
						* ДоляСтоимости * СтрокаТаблицы.НалоговаяСтавка / 100 / 4);
				КонецЕсли;
				
				Если УчитыватьАвансы Тогда
					
					СтрокаТаблицы.СуммаАвансовыхПлатежей1Кв = Окр(СтоимостьОблагаемогоНалогомИмущества1Кв 
						* ДоляСтоимости * СтрокаТаблицы.НалоговаяСтавка / 100 / 4);
					СтрокаТаблицы.СуммаАвансовыхПлатежей2Кв = Окр(СтоимостьОблагаемогоНалогомИмущества2Кв
						* ДоляСтоимости * СтрокаТаблицы.НалоговаяСтавка / 100 / 4);
					СтрокаТаблицы.СуммаАвансовыхПлатежей3Кв = Окр(СтоимостьОблагаемогоНалогомИмущества3Кв
						* ДоляСтоимости * СтрокаТаблицы.НалоговаяСтавка / 100 / 4);
					
				КонецЕсли;
				
				
				Если СтрокаТаблицы.ИФНС = РеквизитыОрганизации.РегистрацияВНалоговомОргане Тогда
				
					СтрокаТаблицы.СуммаУменьшенияСуммыНалога = Окр(СтрокаТаблицы.СуммаНалога * ПроцентУменьшенияСуммыНалога / 100);
					СтрокаТаблицы.СуммаНалогаКУплате = Макс(СтрокаТаблицы.СуммаНалога - СтрокаТаблицы.СуммаУменьшенияСуммыНалога, 0);
					
					Если УчитыватьАвансы Тогда
						
						СтрокаТаблицы.СуммаАвансовыхПлатежей1Кв = СтрокаТаблицы.СуммаАвансовыхПлатежей1Кв
							- Окр(СтрокаТаблицы.СуммаАвансовыхПлатежей1Кв * ПроцентУменьшенияСуммыНалога / 100);
						СтрокаТаблицы.СуммаАвансовыхПлатежей2Кв = СтрокаТаблицы.СуммаАвансовыхПлатежей2Кв
							- Окр(СтрокаТаблицы.СуммаАвансовыхПлатежей2Кв * ПроцентУменьшенияСуммыНалога / 100);
						СтрокаТаблицы.СуммаАвансовыхПлатежей3Кв = СтрокаТаблицы.СуммаАвансовыхПлатежей3Кв
							- Окр(СтрокаТаблицы.СуммаАвансовыхПлатежей3Кв * ПроцентУменьшенияСуммыНалога / 100);
							
					КонецЕсли;
					
				Иначе
					
					СтрокаТаблицы.СуммаНалогаКУплате = СтрокаТаблицы.СуммаНалога;
					
				КонецЕсли;
				
				// Распределим полученные суммы по объектам ОС
				
				ЗаполнитьЗначенияСвойств(Отбор, СтрокаТаблицы);
				РасчетНалогаПоОбъектамОС = РасчетНалога.Скопировать(Отбор);
					
				КоэффициентыРаспределения = Новый Массив;
				КоэффициентыРаспределения1Кв = Новый Массив;
				КоэффициентыРаспределения2Кв = Новый Массив;
				КоэффициентыРаспределения3Кв = Новый Массив;
				
				Для Каждого СтрокаПоОбъектуОС Из РасчетНалогаПоОбъектамОС Цикл
					
					ДелимоеСредняяСтоимость = 0;
					Для каждого КолонкаПериод Из КолонкиПериоды Цикл
						Счетчик = КолонкаПериод.Счетчик;
						
						СтрокаПоОбъектуОС[КолонкаПериод.ОстаточнаяСтоимостьИмя] = Окр(СтрокаПоОбъектуОС[КолонкаПериод.ОстаточнаяСтоимостьИмя], 2);
						ДелимоеСредняяСтоимость = ДелимоеСредняяСтоимость + СтрокаПоОбъектуОС[КолонкаПериод.ОстаточнаяСтоимостьИмя];
						
						Если УчитыватьАвансы Тогда
							Если Счетчик = 4 Тогда
								СредняяСтоимость1Кв = Окр(ДелимоеСредняяСтоимость / Счетчик, 2);
							ИначеЕсли Счетчик = 7 Тогда
								СредняяСтоимость2Кв = Окр(ДелимоеСредняяСтоимость / Счетчик, 2);
							ИначеЕсли Счетчик = 10 Тогда
								СредняяСтоимость3Кв = Окр(ДелимоеСредняяСтоимость / Счетчик, 2);
							КонецЕсли;			
						КонецЕсли;
						
					КонецЦикла;
					СредняяСтоимость = Окр(ДелимоеСредняяСтоимость / Делитель, 2);
					
					КоэффициентыРаспределения.Добавить(СредняяСтоимость);
					
					Если УчитыватьАвансы Тогда
						КоэффициентыРаспределения1Кв.Добавить(СредняяСтоимость1Кв);
						КоэффициентыРаспределения2Кв.Добавить(СредняяСтоимость2Кв);
						КоэффициентыРаспределения3Кв.Добавить(СредняяСтоимость3Кв);
					КонецЕсли;
					
				КонецЦикла;	
				
				Для каждого Колонка Из ДопКолонки Цикл
					
					РасчетНалогаПоОбъектамОС.Колонки.Добавить(Колонка.Ключ,
						ОбщегоНазначения.ОписаниеТипаЧисло(15, 2, ДопустимыйЗнак.Неотрицательный));
						
					Если Колонка.Ключ = "СуммаАвансовыхПлатежей1Кв" Тогда
						Коэффициенты = КоэффициентыРаспределения1Кв;
					ИначеЕсли Колонка.Ключ = "СуммаАвансовыхПлатежей2Кв" Тогда
						Коэффициенты = КоэффициентыРаспределения2Кв;
					ИначеЕсли Колонка.Ключ = "СуммаАвансовыхПлатежей3Кв" Тогда
						Коэффициенты = КоэффициентыРаспределения3Кв;
					Иначе
						Коэффициенты = КоэффициентыРаспределения;
					КонецЕсли;
						
					Если СтрокаТаблицы[Колонка.Ключ] > 0 Тогда
						РаспределенныеСуммы = ОбщегоНазначения.РаспределитьСуммуПропорциональноКоэффициентам(
												СтрокаТаблицы[Колонка.Ключ], Коэффициенты);
						Если РаспределенныеСуммы <> Неопределено Тогда
							РасчетНалогаПоОбъектамОС.ЗагрузитьКолонку(РаспределенныеСуммы, Колонка.Ключ);
						КонецЕсли;
					КонецЕсли;	
					
				КонецЦикла;
				
				Для Каждого СтрокаПоОбъектуОС Из РасчетНалогаПоОбъектамОС Цикл
					
					НоваяСтрока = ТаблицаРасчетНалога.Добавить();
					НоваяСтрока.ВидНалоговойБазы = Перечисления.НалоговаяБазаПоНалогуНаИмущество.СреднегодоваяСтоимость;
					НоваяСтрока.КодВидаИмущества = КодВидаИмущества;
					
					СвойстваПоСтрокеТаблицы = ""
					+ "ИФНС,"
					+ "КодПоОКТМО,"
					+ "КодНалоговойЛьготыОсвобождениеОтНалогообложения,"
					+ "НалоговаяСтавка,"
					+ "КБК,"
					+ "ПонижениеНалоговойСтавки";
					
					Если КодВидаИмущества = "02" Тогда
						СвойстваПоСтрокеТаблицы = СвойстваПоСтрокеТаблицы + ","
						+ "ДоляСтоимостиЧислитель,"
						+ "ДоляСтоимостиЗнаменатель";
					КонецЕсли;
					
					ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТаблицы, СвойстваПоСтрокеТаблицы);
					ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаПоОбъектуОС, ,СвойстваПоСтрокеТаблицы);
					
					Если УчитыватьАвансы Тогда
						
						НоваяСтрока.СуммаАвансовыхПлатежей = СтрокаПоОбъектуОС.СуммаАвансовыхПлатежей1Кв
															+ СтрокаПоОбъектуОС.СуммаАвансовыхПлатежей2Кв
															+ СтрокаПоОбъектуОС.СуммаАвансовыхПлатежей3Кв;
						
						НоваяСтрока.СуммаНалогаКУплате = НоваяСтрока.СуммаНалогаКУплате - НоваяСтрока.СуммаАвансовыхПлатежей;
						
					КонецЕсли;
					
					Если НЕ ГодовойРасчет Тогда
						
						НоваяСтрока.СуммаАвансовыхПлатежей = НоваяСтрока.СуммаНалогаКУплате;
						
					КонецЕсли;
						
				КонецЦикла;
				
			КонецЦикла;
						
		КонецЕсли;
			
	КонецЕсли;
	
	ПрименениеОСНО = УчетнаяПолитика.СистемаНалогообложения(Организация, ПериодРасчета) = Перечисления.СистемыНалогообложения.Общая;
	ПрименениеУСН = УчетнаяПолитика.СистемаНалогообложения(Организация, ПериодРасчета) = Перечисления.СистемыНалогообложения.Упрощенная;
	ПлательщикЕНВД = УчетнаяПолитика.ПлательщикЕНВД(Организация, ПериодРасчета);
	
	Если ПериодРасчета >= '20150101' ИЛИ ПрименениеОСНО 
		ИЛИ (ПериодРасчета >= '20140701' И ПериодРасчета < '20150101' И ПлательщикЕНВД)Тогда
	
		МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц; // Хранит НалоговыеОрганыСУстановленнойУплатойАвансов
		РегистрыСведений.ПорядокУплатыНалоговНаМестах.СоздатьНалоговыеОрганыСУстановленнойУплатойАвансов(
			МенеджерВременныхТаблиц, Организация, ПериодРасчета, "НалогНаИмущество");
		
		Запрос = Новый Запрос;
		Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
		
		Запрос.УстановитьПараметр("ПериодРасчета", ПериодРасчета);
		Запрос.УстановитьПараметр("Организация", Организация);
		Запрос.УстановитьПараметр("ОсновнойНалоговыйОрган", РеквизитыОрганизации.РегистрацияВНалоговомОргане);
		Запрос.УстановитьПараметр("ПрименениеУСН", ПрименениеУСН);
		
		Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВЫБОР
		|		КОГДА СтавкиНалогаНаИмуществоПоОтдельнымОсновнымСредствамСрезПоследних.ПостановкаНаУчетВНалоговомОргане = ЗНАЧЕНИЕ(Перечисление.ПостановкаНаУчетВНалоговомОргане.ВДругомНалоговомОргане)
		|			ТОГДА СтавкиНалогаНаИмуществоПоОтдельнымОсновнымСредствамСрезПоследних.НалоговыйОрган
		|		ИНАЧЕ &ОсновнойНалоговыйОрган
		|	КОНЕЦ КАК ИФНС,
		|	ВЫБОР
		|		КОГДА СтавкиНалогаНаИмуществоПоОтдельнымОсновнымСредствамСрезПоследних.ПостановкаНаУчетВНалоговомОргане = ЗНАЧЕНИЕ(Перечисление.ПостановкаНаУчетВНалоговомОргане.СДругимКодомПоОКАТО)
		|				ИЛИ СтавкиНалогаНаИмуществоПоОтдельнымОсновнымСредствамСрезПоследних.ПостановкаНаУчетВНалоговомОргане = ЗНАЧЕНИЕ(Перечисление.ПостановкаНаУчетВНалоговомОргане.ВДругомНалоговомОргане)
		|			ТОГДА СтавкиНалогаНаИмуществоПоОтдельнымОсновнымСредствамСрезПоследних.КодПоОКТМО
		|		ИНАЧЕ ЕСТЬNULL(СтавкиНалогаНаИмуществоСрезПоследних.Организация.РегистрацияВНалоговомОргане.КодПоОКТМО, """")
		|	КОНЕЦ КАК КодПоОКТМО,
		|	СтавкиНалогаНаИмуществоПоОтдельнымОсновнымСредствамСрезПоследних.ОсновноеСредство,
		|	СтавкиНалогаНаИмуществоПоОтдельнымОсновнымСредствамСрезПоследних.КадастровыйНомер КАК КадастровыйНомер,
		|	СтавкиНалогаНаИмуществоПоОтдельнымОсновнымСредствамСрезПоследних.КадастровыйНомерПомещения КАК КадастровыйНомерПомещения,
		|	СтавкиНалогаНаИмуществоПоОтдельнымОсновнымСредствамСрезПоследних.КадастроваяСтоимость,
		|	СтавкиНалогаНаИмуществоПоОтдельнымОсновнымСредствамСрезПоследних.НеоблагаемаяКадастроваяСтоимость,
		|	ВЫБОР
		|		КОГДА СтавкиНалогаНаИмуществоПоОтдельнымОсновнымСредствамСрезПоследних.ПорядокНалогообложения = ЗНАЧЕНИЕ(Перечисление.ПорядокНалогообложенияИмущества.ОсвобождаетсяОтНалогообложения)
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК ОсвобождениеОтНалогообложения,
		|	ВЫБОР
		|		КОГДА СтавкиНалогаНаИмуществоПоОтдельнымОсновнымСредствамСрезПоследних.ПорядокНалогообложения = ЗНАЧЕНИЕ(Перечисление.ПорядокНалогообложенияИмущества.ОсвобождаетсяОтНалогообложения)
		|			ТОГДА СтавкиНалогаНаИмуществоПоОтдельнымОсновнымСредствамСрезПоследних.КодНалоговойЛьготыОсвобождениеОтНалогообложения
		|		ИНАЧЕ СтавкиНалогаНаИмуществоСрезПоследних.КодНалоговойЛьготыОсвобождениеОтНалогообложения
		|	КОНЕЦ КАК КодНалоговойЛьготыОсвобождениеОтНалогообложения,
		|	ВЫБОР
		|		КОГДА СтавкиНалогаНаИмуществоПоОтдельнымОсновнымСредствамСрезПоследних.ПорядокНалогообложения = ЗНАЧЕНИЕ(Перечисление.ПорядокНалогообложенияИмущества.ОблагаетсяПоСниженнойСтавке)
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК ПонижениеНалоговойСтавки,
		|	СтавкиНалогаНаИмуществоПоОтдельнымОсновнымСредствамСрезПоследних.ДоляСтоимостиЧислитель,
		|	СтавкиНалогаНаИмуществоПоОтдельнымОсновнымСредствамСрезПоследних.ДоляСтоимостиЗнаменатель,
		|	ВЫБОР
		|		КОГДА СтавкиНалогаНаИмуществоПоОтдельнымОсновнымСредствамСрезПоследних.ПорядокНалогообложения = ЗНАЧЕНИЕ(Перечисление.ПорядокНалогообложенияИмущества.ОблагаетсяПоСниженнойСтавке)
		|			ТОГДА СтавкиНалогаНаИмуществоПоОтдельнымОсновнымСредствамСрезПоследних.СниженнаяНалоговаяСтавка
		|		ИНАЧЕ СтавкиНалогаНаИмуществоПоОтдельнымОсновнымСредствамСрезПоследних.НалоговаяСтавка
		|	КОНЕЦ КАК НалоговаяСтавка,
		|	СтавкиНалогаНаИмуществоПоОтдельнымОсновнымСредствамСрезПоследних.ДатаРегистрацииПраваСобственности,
		|	СтавкиНалогаНаИмуществоПоОтдельнымОсновнымСредствамСрезПоследних.ДатаПрекращенияПраваСобственности,
		|	&ПрименениеУСН
		|		ИЛИ СтавкиНалогаНаИмуществоПоОтдельнымОсновнымСредствамСрезПоследних.ИспользуетсяТолькоВДеятельностиОблагаемойЕНВД КАК ИспользуетсяТолькоВДеятельностиОблагаемойЕНВД,
		|	СтавкиНалогаНаИмуществоПоОтдельнымОсновнымСредствамСрезПоследних.КодВидаИмущества,
		|	СтавкиНалогаНаИмуществоПоОтдельнымОсновнымСредствамСрезПоследних.ДоляВПравеОбщейСобственностиЧислитель,
		|	СтавкиНалогаНаИмуществоПоОтдельнымОсновнымСредствамСрезПоследних.ДоляВПравеОбщейСобственностиЗнаменатель,
		|	СтавкиНалогаНаИмуществоПоОтдельнымОсновнымСредствамСрезПоследних.ДоляПлощадиЧислитель,
		|	СтавкиНалогаНаИмуществоПоОтдельнымОсновнымСредствамСрезПоследних.ДоляПлощадиЗнаменатель
		|ПОМЕСТИТЬ ОбъектыОблагаемыеПоКадастровойСтоимости
		|ИЗ
		|	РегистрСведений.СтавкиНалогаНаИмуществоПоОтдельнымОсновнымСредствам.СрезПоследних(КОНЕЦПЕРИОДА(&ПериодРасчета, МЕСЯЦ), Организация = &Организация) КАК СтавкиНалогаНаИмуществоПоОтдельнымОсновнымСредствамСрезПоследних
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтавкиНалогаНаИмущество.СрезПоследних(КОНЕЦПЕРИОДА(&ПериодРасчета, ГОД), Организация = &Организация) КАК СтавкиНалогаНаИмуществоСрезПоследних
		|		ПО (ИСТИНА)
		|ГДЕ
		|	СтавкиНалогаНаИмуществоПоОтдельнымОсновнымСредствамСрезПоследних.НалоговаяБаза = ЗНАЧЕНИЕ(Перечисление.НалоговаяБазаПоНалогуНаИмущество.КадастроваяСтоимость)
		|	И СтавкиНалогаНаИмуществоПоОтдельнымОсновнымСредствамСрезПоследних.ПорядокНалогообложения <> ЗНАЧЕНИЕ(Перечисление.ПорядокНалогообложенияИмущества.НеПодлежитНалогообложению)
		|	И НЕ СтавкиНалогаНаИмуществоПоОтдельнымОсновнымСредствамСрезПоследних.ДатаРегистрацииПраваСобственности > КОНЕЦПЕРИОДА(&ПериодРасчета, МЕСЯЦ)
		|	И ВЫБОР
		|			КОГДА СтавкиНалогаНаИмуществоПоОтдельнымОсновнымСредствамСрезПоследних.ДатаПрекращенияПраваСобственности = ДАТАВРЕМЯ(1, 1, 1)
		|				ТОГДА ИСТИНА
		|			ИНАЧЕ НЕ СтавкиНалогаНаИмуществоПоОтдельнымОсновнымСредствамСрезПоследних.ДатаПрекращенияПраваСобственности < НАЧАЛОПЕРИОДА(&ПериодРасчета, ГОД)
		|		КОНЕЦ
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ИФНС
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ОбъектыОблагаемыеПоКадастровойСтоимости.ИФНС,
		|	ОбъектыОблагаемыеПоКадастровойСтоимости.КодПоОКТМО,
		|	ОбъектыОблагаемыеПоКадастровойСтоимости.ОсновноеСредство,
		|	ОбъектыОблагаемыеПоКадастровойСтоимости.КадастровыйНомер,
		|	ОбъектыОблагаемыеПоКадастровойСтоимости.КадастровыйНомерПомещения,
		|	ОбъектыОблагаемыеПоКадастровойСтоимости.КадастроваяСтоимость,
		|	ОбъектыОблагаемыеПоКадастровойСтоимости.НеоблагаемаяКадастроваяСтоимость,
		|	ОбъектыОблагаемыеПоКадастровойСтоимости.ОсвобождениеОтНалогообложения,
		|	ОбъектыОблагаемыеПоКадастровойСтоимости.КодНалоговойЛьготыОсвобождениеОтНалогообложения,
		|	ОбъектыОблагаемыеПоКадастровойСтоимости.ПонижениеНалоговойСтавки,
		|	ОбъектыОблагаемыеПоКадастровойСтоимости.ДоляСтоимостиЧислитель,
		|	ОбъектыОблагаемыеПоКадастровойСтоимости.ДоляСтоимостиЗнаменатель,
		|	ОбъектыОблагаемыеПоКадастровойСтоимости.НалоговаяСтавка,
		|	ВЫБОР
		|		КОГДА ВТ_НалоговыеОрганыСУстановленнойУплатойАвансов.НалоговыйОрган ЕСТЬ NULL
		|			ТОГДА ЛОЖЬ
		|		ИНАЧЕ ИСТИНА
		|	КОНЕЦ КАК УплачиваютсяАвансы,
		|	ОбъектыОблагаемыеПоКадастровойСтоимости.ДатаРегистрацииПраваСобственности,
		|	ОбъектыОблагаемыеПоКадастровойСтоимости.ДатаПрекращенияПраваСобственности,
		|	ОбъектыОблагаемыеПоКадастровойСтоимости.ИспользуетсяТолькоВДеятельностиОблагаемойЕНВД,
		|	ОбъектыОблагаемыеПоКадастровойСтоимости.КодВидаИмущества,
		|	ОбъектыОблагаемыеПоКадастровойСтоимости.ДоляВПравеОбщейСобственностиЧислитель,
		|	ОбъектыОблагаемыеПоКадастровойСтоимости.ДоляВПравеОбщейСобственностиЗнаменатель,
		|	ОбъектыОблагаемыеПоКадастровойСтоимости.ДоляПлощадиЧислитель,
		|	ОбъектыОблагаемыеПоКадастровойСтоимости.ДоляПлощадиЗнаменатель
		|ИЗ
		|	ОбъектыОблагаемыеПоКадастровойСтоимости КАК ОбъектыОблагаемыеПоКадастровойСтоимости
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_НалоговыеОрганыСУстановленнойУплатойАвансов КАК ВТ_НалоговыеОрганыСУстановленнойУплатойАвансов
		|		ПО ОбъектыОблагаемыеПоКадастровойСтоимости.ИФНС = ВТ_НалоговыеОрганыСУстановленнойУплатойАвансов.НалоговыйОрган";
		
		Результат = Запрос.Выполнить();
		
		Если Не Результат.Пустой() Тогда
		
			РасчетНалогаНаИмуществоПоКадастровойСтоимости = Результат.Выгрузить();
		
			Для Каждого СтрокаТаблицы Из РасчетНалогаНаИмуществоПоКадастровойСтоимости Цикл
				
				Если НЕ ГодовойРасчет И НЕ СтрокаТаблицы.УплачиваютсяАвансы Тогда
					Продолжить;
				КонецЕсли;
				
				УчитыватьАвансы = ГодовойРасчет И СтрокаТаблицы.УплачиваютсяАвансы;
				
				Если ПериодРасчета < '20140701' И СтрокаТаблицы.ИспользуетсяТолькоВДеятельностиОблагаемойЕНВД Тогда
					Продолжить;
				КонецЕсли;
				
				Если НЕ ЗначениеЗаполнено(СтрокаТаблицы.ДатаРегистрацииПраваСобственности) Тогда
					Продолжить;
				КонецЕсли;
				
				ГодРасчета = Год(ПериодРасчета);
				
				Если ГодРасчета < 2016 ИЛИ ГодовойРасчет Тогда
					НачалоПериода = 1;
				Иначе
					НачалоПериода = Месяц(НачалоКвартала(ПериодРасчета));
				КонецЕсли;
				
				КоличествоМесяцевВладения = 0;
				КоличествоМесяцевВладенияЗаКвартал = 0;
				МесяцыВладения = Новый Соответствие;
				Для Сч = НачалоПериода По Месяц(ПериодРасчета) Цикл
					
					Если ГодРасчета < 2016 Тогда
						ПредельнаяДатаВозникновенияПрава = КонецМесяца(Дата(ГодРасчета, Сч, 1));
						ПредельнаяДатаПрекращенияПрава = Дата(ГодРасчета, Сч, 1);
					Иначе
						ПредельнаяДатаВозникновенияПрава = Дата(ГодРасчета, Сч, 15, 23, 59, 59);
						ПредельнаяДатаПрекращенияПрава = Дата(ГодРасчета, Сч, 16);
					КонецЕсли;
					
					Если СтрокаТаблицы.ДатаРегистрацииПраваСобственности <= ПредельнаяДатаВозникновенияПрава
						И (НЕ ЗначениеЗаполнено(СтрокаТаблицы.ДатаПрекращенияПраваСобственности)
							ИЛИ СтрокаТаблицы.ДатаПрекращенияПраваСобственности >= ПредельнаяДатаПрекращенияПрава) Тогда
							
						КоличествоМесяцевВладения = КоличествоМесяцевВладения + 1;
						КоличествоМесяцевВладенияЗаКвартал = КоличествоМесяцевВладенияЗаКвартал + 1;
					КонецЕсли;
					
					Если ГодовойРасчет И Сч%3 = 0 Тогда
						МесяцыВладения.Вставить(Сч, КоличествоМесяцевВладенияЗаКвартал);
						
						Если ГодРасчета >= 2016 Тогда
							КоличествоМесяцевВладенияЗаКвартал = 0;
						КонецЕсли;
					КонецЕсли;
					
				КонецЦикла;
				
				Если КоличествоМесяцевВладения = 0 Тогда
					Продолжить;
				КонецЕсли;
				
				НоваяСтрока = ТаблицаРасчетНалога.Добавить(); 
				
				ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТаблицы);
				
				НоваяСтрока.ВидНалоговойБазы = Перечисления.НалоговаяБазаПоНалогуНаИмущество.КадастроваяСтоимость;
				
				Если СтрокаТаблицы.ОсвобождениеОтНалогообложения Тогда
					НоваяСтрока.НеоблагаемаяКадастроваяСтоимость = НоваяСтрока.КадастроваяСтоимость;
				КонецЕсли;
				
				Если ГодовойРасчет
				   И ГодРасчета = 2014
				   И ПлательщикЕНВД
				   И СтрокаТаблицы.ИспользуетсяТолькоВДеятельностиОблагаемойЕНВД Тогда
				   
					НоваяСтрока.КадастроваяСтоимость = НоваяСтрока.КадастроваяСтоимость / 2;
					НоваяСтрока.НеоблагаемаяКадастроваяСтоимость = НоваяСтрока.НеоблагаемаяКадастроваяСтоимость / 2;
					
				КонецЕсли;
				
				Если СтрокаТаблицы.ДоляСтоимостиЧислитель > 0 И СтрокаТаблицы.ДоляСтоимостиЗнаменатель > 0 Тогда
					ДоляСтоимости = СтрокаТаблицы.ДоляСтоимостиЧислитель / СтрокаТаблицы.ДоляСтоимостиЗнаменатель;	
				Иначе
					ДоляСтоимости = 1;
				КонецЕсли;
				
				Если СтрокаТаблицы.ДоляВПравеОбщейСобственностиЧислитель > 0 И СтрокаТаблицы.ДоляВПравеОбщейСобственностиЗнаменатель > 0 Тогда
					ДоляВПравеОбщейСобственности = 
						СтрокаТаблицы.ДоляВПравеОбщейСобственностиЧислитель / СтрокаТаблицы.ДоляВПравеОбщейСобственностиЗнаменатель;
				Иначе
					ДоляВПравеОбщейСобственности = 1;
				КонецЕсли;
				
				НоваяСтрока.НалоговаяБаза = Окр(Макс(НоваяСтрока.КадастроваяСтоимость - НоваяСтрока.НеоблагаемаяКадастроваяСтоимость, 0)
					* ДоляСтоимости * ДоляВПравеОбщейСобственности);
				
				НоваяСтрока.КоличествоМесяцевВладения = КоличествоМесяцевВладения;
				КоэффициентК = НоваяСтрока.КоличествоМесяцевВладения / ?(ГодРасчета < 2016 ИЛИ ГодовойРасчет, Месяц(ПериодРасчета), 3);
				
				Если ГодовойРасчет Тогда
					НоваяСтрока.СуммаНалога = Окр(НоваяСтрока.НалоговаяБаза * КоэффициентК * НоваяСтрока.НалоговаяСтавка / 100);
				Иначе
					НоваяСтрока.СуммаНалога = Окр(Макс(НоваяСтрока.КадастроваяСтоимость - НоваяСтрока.НеоблагаемаяКадастроваяСтоимость, 0)
						* ДоляСтоимости * ДоляВПравеОбщейСобственности * КоэффициентК * НоваяСтрока.НалоговаяСтавка / 100 / 4);
				КонецЕсли;
				
				Если УчитыватьАвансы Тогда
					
					КоэффициентК3 = МесяцыВладения[3] / 3;
					СуммаАвансовыхПлатежей3 = Окр(Макс(НоваяСтрока.КадастроваяСтоимость - НоваяСтрока.НеоблагаемаяКадастроваяСтоимость, 0)
						* ДоляСтоимости * ДоляВПравеОбщейСобственности * КоэффициентК3 * НоваяСтрока.НалоговаяСтавка / 100 / 4);
					
					КоэффициентК6 = МесяцыВладения[6] / ?(ГодРасчета < 2016, 6, 3);
					СуммаАвансовыхПлатежей6 = Окр(Макс(НоваяСтрока.КадастроваяСтоимость - НоваяСтрока.НеоблагаемаяКадастроваяСтоимость, 0)
						* ДоляСтоимости * ДоляВПравеОбщейСобственности * КоэффициентК6 * НоваяСтрока.НалоговаяСтавка / 100 / 4);
					
					КоэффициентК9 = МесяцыВладения[9] / ?(ГодРасчета < 2016, 9, 3);
					СуммаАвансовыхПлатежей9 = Окр(Макс(НоваяСтрока.КадастроваяСтоимость - НоваяСтрока.НеоблагаемаяКадастроваяСтоимость, 0)
						* ДоляСтоимости * ДоляВПравеОбщейСобственности * КоэффициентК9 * НоваяСтрока.НалоговаяСтавка / 100 / 4);
					
				КонецЕсли;
				
				Если НоваяСтрока.ИФНС = РеквизитыОрганизации.РегистрацияВНалоговомОргане Тогда
				
					НоваяСтрока.СуммаУменьшенияСуммыНалога = Окр(НоваяСтрока.СуммаНалога * ПроцентУменьшенияСуммыНалога / 100);
					НоваяСтрока.СуммаНалогаКУплате = Макс(НоваяСтрока.СуммаНалога - НоваяСтрока.СуммаУменьшенияСуммыНалога, 0);
					
					Если УчитыватьАвансы Тогда
						СуммаАвансовыхПлатежей3 = Макс(СуммаАвансовыхПлатежей3
							- Окр(СуммаАвансовыхПлатежей3 * ПроцентУменьшенияСуммыНалога / 100), 0);
						СуммаАвансовыхПлатежей6 = Макс(СуммаАвансовыхПлатежей6
							- Окр(СуммаАвансовыхПлатежей6 * ПроцентУменьшенияСуммыНалога / 100), 0);
						СуммаАвансовыхПлатежей9 = Макс(СуммаАвансовыхПлатежей9
							- Окр(СуммаАвансовыхПлатежей9 * ПроцентУменьшенияСуммыНалога / 100), 0);
					КонецЕсли;
					
				Иначе
					
					НоваяСтрока.СуммаНалогаКУплате = НоваяСтрока.СуммаНалога;
					
				КонецЕсли;
				
				Если УчитыватьАвансы Тогда
					
					Если ГодРасчета = 2014
					   И ПлательщикЕНВД
					   И СтрокаТаблицы.ИспользуетсяТолькоВДеятельностиОблагаемойЕНВД Тогда
						НоваяСтрока.СуммаАвансовыхПлатежей = 2 * СуммаАвансовыхПлатежей9;
					Иначе
						НоваяСтрока.СуммаАвансовыхПлатежей = СуммаАвансовыхПлатежей3 + СуммаАвансовыхПлатежей6 + СуммаАвансовыхПлатежей9;
					КонецЕсли;
					НоваяСтрока.СуммаНалогаКУплате = НоваяСтрока.СуммаНалогаКУплате - НоваяСтрока.СуммаАвансовыхПлатежей;
					
				КонецЕсли;
				
				Если НЕ ГодовойРасчет Тогда
					НоваяСтрока.СуммаАвансовыхПлатежей = НоваяСтрока.СуммаНалогаКУплате;
				КонецЕсли;
				
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЕсли;
	
	ТаблицаРасчетНалога.ЗаполнитьЗначения(мДатаКонцаПериодаОтчета, "ПериодРасчета");
	ТаблицаРасчетНалога.ЗаполнитьЗначения(Организация, "Организация");
	
	Возврат ТаблицаРасчетНалога;
	
КонецФункции
	
	
	//	// Вставить содержимое метода.
//	Результат = ПродолжитьВызов(Организация, ПериодРасчета);
//	Возврат Результат;
//КонецФункции
