

&НаКлиенте
Процедура ПроводкиДляЗагрузкиНастройкаПроводокNAVОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если ТипЗнч(ВыбранноеЗначение) = Тип("Массив") Тогда
		СтандартнаяОбработка = Ложь;
		ЭтотОбъект.Объект.ПроводкиДляЗагрузки.Удалить(ЭтотОбъект.Объект.ПроводкиДляЗагрузки.Количество()-1);
		Для каждого ЭлементМ Из ВыбранноеЗначение Цикл
			Стр = ЭтотОбъект.Объект.ПроводкиДляЗагрузки.Добавить();
			Стр.НастройкаПроводокNAV = ЭлементМ;
		КонецЦикла;
	КОнецЕсли;
КонецПроцедуры


&НаСервере
Процедура ГруппаСписокПроводокВидимость()
	Если Объект.ТипЗадания = Перечисления.pcru_ex_ТипыРегламентныхЗаданий.ПроводкиИзСписка или Объект.ТипЗадания = Перечисления.pcru_ex_ТипыРегламентныхЗаданий.РеализацииПрошлыйМесяц Тогда
		Элементы.ГруппаСписокПроводок.Видимость = Истина;
	Иначе
		Элементы.ГруппаСписокПроводок.Видимость = Ложь;
	КонецЕсли; 
	
	Если Объект.ТипЗадания = Перечисления.pcru_ex_ТипыРегламентныхЗаданий.ЗагрузкаЗаймов Тогда
		Элементы.ГруппаСписокПроводок.Видимость = Истина;
		Элементы.ПроводкиДляЗагрузки.Видимость = Ложь;
	Иначе
		Элементы.ПроводкиДляЗагрузки.Видимость = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ГруппаСписокПроводокВидимость();
КонецПроцедуры

&НаКлиенте
Процедура ТипЗаданияПриИзменении(Элемент)
	ГруппаСписокПроводокВидимость();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Ключ.Пустая() Тогда
		Объект.ВыполнятьВФоне = Истина;
		Объект.Статус = Перечисления.pcru_ex_СтатусыОперации.ПустаяСсылка();
		Объект.ДатаНачалаВыполненияПлан = ТекущаяДата();
		Объект.ДатаНачалаВыполненияФакт = Дата('00010101');
		Объект.ДатаОкончанияВыполненияФакт = Дата('00010101');
		Объект.Результат = "";
		
		Объект.НачалоПериода = НачалоМесяца(НачалоМесяца(ТекущаяДата()) - 2);
		Объект.КонецПериода = КонецМесяца(НачалоМесяца(ТекущаяДата()) - 2);
	КонецЕсли;
	
КонецПроцедуры
