
&Вместо("БНФОПодготовитьПараметрыПроведения")
Функция pcru_ex_БНФОПодготовитьПараметрыПроведения(ДокументСсылка, Отказ, ДоговорДляОтложенногоПроведения)
	// Вставить содержимое метода.
	Результат = ПродолжитьВызов(ДокументСсылка, Отказ, ДоговорДляОтложенногоПроведения);
	
	Если Результат.Свойство("ДокументСсылка") И ТипЗнч(Результат.ДокументСсылка) = Тип("ДокументСсылка.СписаниеСРасчетногоСчета") Тогда
		Если Результат.ДокументСсылка.ВидОперации = Перечисления.ВидыОперацийСписаниеДенежныхСредств.ПеречислениеНалога Тогда
			Если Результат.ДокументСсылка.pcru_ex_РасшифровкаНалога.Количество() > 0 Тогда
				Если Результат.РасшифровкаПлатежаПрочее.Количество() = 1 Тогда
					ТЗ = Результат.РасшифровкаПлатежаПрочее.Скопировать();
					ИсходнаяСтрока = ТЗ[0];
					Результат.РасшифровкаПлатежаПрочее.Очистить();
					Для Каждого Строка Из Результат.ДокументСсылка.pcru_ex_РасшифровкаНалога Цикл
						СтрокаРасшифровка = Результат.РасшифровкаПлатежаПрочее.Добавить();
						ЗаполнитьЗначенияСвойств(СтрокаРасшифровка, ИсходнаяСтрока);
						СтрокаРасшифровка.СчетДт = Строка.СчетУчетаРасчетов;
						СтрокаРасшифровка.СуммаРуб = Строка.Сумма;
						СтрокаРасшифровка.ВалютнаяСумма = Строка.Сумма;
					КонецЦикла;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Результат;
КонецФункции
