
// Процедура - Pcru ex СРВНачать заполнение документа
//
&НаСервере
Процедура pcru_ex_СРВНачатьЗаполнениеДокумента()
	
	Для каждого СтрокаНДС Из Объект.РаспределяемыйНДС Цикл
		Если не ЗначениеЗаполнено(СтрокаНДС.СчетЗатрат) и СтрокаНДС.СчетФактура.Товары.Количество() > 0 Тогда
			СтрокаНДС.СчетЗатрат = СтрокаНДС.СчетФактура.Товары[0].СчетУчета;
			СтрокаНДС.Подразделение	=  СтрокаНДС.СчетФактура.ПодразделениеОрганизации;
			СтрокаНДС.БНФОСубконто1		= СтрокаНДС.СчетФактура.Товары[0].Номенклатура;
			СтрокаНДС.БНФОСубконто2		= СтрокаНДС.СчетФактура.Склад;
			СтрокаНДС.БНФОСубконто3		= СтрокаНДС.СчетФактура;
		КонецЕсли; 
		
		
		Если не ЗначениеЗаполнено(СтрокаНДС.СчетЗатрат) и СтрокаНДС.СчетФактура.Услуги.Количество() > 0 Тогда
			СтрокаНДС.СчетЗатрат = СтрокаНДС.СчетФактура.Услуги[0].СчетЗатрат;
			СтрокаНДС.Подразделение	=  СтрокаНДС.СчетФактура.ПодразделениеОрганизации;
			СтрокаНДС.БНФОСубконто1		= СтрокаНДС.СчетФактура.Услуги[0].БНФОСубконто1;
			СтрокаНДС.БНФОСубконто2		= СтрокаНДС.СчетФактура.Услуги[0].БНФОСубконто2;
			СтрокаНДС.БНФОСубконто3		= СтрокаНДС.СчетФактура.Услуги[0].БНФОСубконто3;
		КонецЕсли;
		   		//Если СтрокаНДС.ВидЦенности = Перечисления.ВидыЦенностей.НМА Тогда
		//	Запрос = Новый Запрос;
		//	Запрос.Текст = "ВЫБРАТЬ
		//	|	ПринятиеКУчетуНМА.СчетУчета КАК СчетУчета
		//	|ИЗ
		//	|	Документ.ПринятиеКУчетуНМА КАК ПринятиеКУчетуНМА
		//	|ГДЕ
		//	|	ПринятиеКУчетуНМА.НематериальныйАктив = &НематериальныйАктив";
		//	Запрос.УстановитьПараметр("НематериальныйАктив",СтрокаНДС.Субконто1);
		//	Выборка = Запрос.Выполнить().Выбрать();
		//	Пока Выборка.Следующий() Цикл
		//		СтрокаНДС.СчетЗатрат = Выборка.СчетУчета;
		//	КонецЦикла;
		//КонецЕсли; 
		//
		//
		//
		////                 СтрокаНДС.БНФОСубконто2Доступность = Истина;
		////                 СтрокаНДС.БНФОСубконто2 = 
		////				 
		////				 
		////СтрокаНДС.БНФОСубконто3
		////СтрокаНДС.БНФОСубконто3Доступность
		////СтрокаНДС.СчетФактура.товары[СтрокаНДС.НомерСтроки] = ;
		////СтрокаНДС.СчетУчетаНДС = ;
		////СтрокаНДС.СчетЗатрат = ;
		////СтрокаНДС.СуммаБезНДСУчитываетсяВCтоимостиЕНВД = ;
		////СтрокаНДС.СуммаБезНДСУчитываетсяВCтоимости = ;
		////СтрокаНДС.СуммаБезНДСПринимаетсяКВычету = ;
		////СтрокаНДС.СуммаБезНДСДляОперацийПо0 = ;
		////СтрокаНДС.СуммаБезНДС = ;
		////СтрокаНДС.Субконто3Доступность = ;
		////СтрокаНДС.Субконто3 = ;
		////СтрокаНДС.Субконто2Доступность = ;
		////СтрокаНДС.Субконто2 = ;
		////СтрокаНДС.Субконто1Доступность = ;
		////СтрокаНДС.Субконто1 = ;
		////СтрокаНДС.СтавкаНДС = ;
		////СтрокаНДС.Поставщик = ;
		////СтрокаНДС.ПодразделениеДоступность = ;
		////СтрокаНДС.Подразделение = ;
		////СтрокаНДС.Партия = ;
		////СтрокаНДС.НомерСтроки = ;
		////СтрокаНДС.НадписьСуммаНДС = ;
		////СтрокаНДС.НадписьСуммаБезНДС = ;
		////СтрокаНДС.НДСУчитываетсяВCтоимостиЕНВД = ;
		////СтрокаНДС.НДСУчитываетсяВCтоимости = ;
		////СтрокаНДС.НДСПринимаетсяКВычету = ;
		////СтрокаНДС.НДСДляОперацийПо0 = ;
		////СтрокаНДС.НДС = ;
		////СтрокаНДС.Модернизация = ;
		////СтрокаНДС.Количество = ;
		////СтрокаНДС.ИсходныйНомерСтроки = ;
		////СтрокаНДС.ВидЦенности = ;
		//
		//
		//Если СтрокаНДС.СчетЗатрат.Владелец.Код = "60401" Тогда
		//	СтрокаНДС.БНФОСубконто1Доступность = Истина;
		//	СтрокаНДС.БНФОСубконто1 = СтрокаНДС.Субконто1;
		//КонецЕсли; 
		//Если СтрокаНДС.СчетЗатрат.Владелец.Код = "60415" Тогда
		//	СтрокаНДС.БНФОСубконто1Доступность = Истина;
		//	СтрокаНДС.БНФОСубконто1 = СтрокаНДС.Субконто1;
		//	СтрокаНДС.БНФОСубконто2Доступность = Истина;
		//	СтрокаНДС.БНФОСубконто2 = СтрокаНДС.Субконто2;
		//	СтрокаНДС.БНФОСубконто3Доступность = Истина;
		//	СтрокаНДС.БНФОСубконто3 = СтрокаНДС.Субконто3;
		//	
		//КонецЕсли; 
		//
		//
		//Если СтрокаНДС.СчетЗатрат.Владелец.Код = "60906" Тогда
		//	СтрокаНДС.БНФОСубконто1Доступность = Истина;
		//	СтрокаНДС.БНФОСубконто1 = СтрокаНДС.Субконто1;
		//КонецЕсли; 
		//
		//Если СтрокаНДС.СчетЗатрат.Владелец.Код = "60901" Тогда
		//	СтрокаНДС.БНФОСубконто1Доступность = Истина;
		//	СтрокаНДС.БНФОСубконто1 = СтрокаНДС.Субконто1;
		//	СтрокаНДС.БНФОСубконто2Доступность = Истина;
		//	СтрокаНДС.БНФОСубконто2 = СтрокаНДС.Субконто2;
		//	СтрокаНДС.БНФОСубконто3Доступность = Истина;
		//	СтрокаНДС.БНФОСубконто3 = СтрокаНДС.Субконто3;
		//КонецЕсли; 
		//
		//Если СтрокаНДС.СчетЗатрат.Владелец.Код = "71802" Тогда
		//	СтрокаНДС.БНФОСубконто1Доступность = Истина;
		//	СтрокаНДС.БНФОСубконто1 = СтрокаНДС.Субконто1;
		//	СтрокаНДС.БНФОСубконто2Доступность = Истина;
		//	Если СтрокаНДС.СчетФактура.Услуги.Количество() = 0 Тогда
		//		Запрос = Новый Запрос;
		//		Запрос.Текст = "ВЫБРАТЬ
		//		|	НДСРаздельныйУчет.Регистратор.БНФОСубконто1 КАК РегистраторБНФОСубконто1,
		//		|	НДСРаздельныйУчет.Регистратор.БНФОСубконто2 КАК РегистраторБНФОСубконто2,
		//		|	НДСРаздельныйУчет.Регистратор.БНФОСубконто3 КАК РегистраторБНФОСубконто3
		//		|ИЗ
		//		|	РегистрНакопления.НДСРаздельныйУчет КАК НДСРаздельныйУчет
		//		|ГДЕ
		//		|	НДСРаздельныйУчет.Партия = &Партия";
		//		Запрос.УстановитьПараметр("Партия",СтрокаНДС.СчетФактура );
		//		Выборка = Запрос.Выполнить().Выбрать();
		//		Пока Выборка.Следующий() Цикл
		//			СтрокаНДС.БНФОСубконто2 = Выборка.РегистраторБНФОСубконто2;
		//		КонецЦикла;
		//	Иначе	
		//		СтрокаНДС.БНФОСубконто2 =  СтрокаНДС.СчетФактура.Услуги[СтрокаНДС.ИсходныйНомерСтроки].БНФОСубконто2;
		//	КонецЕсли; 
		//КонецЕсли; 
		//
		//Если СтрокаНДС.СчетЗатрат.Владелец.Код = "71702" Тогда
		//	СтрокаНДС.БНФОСубконто1Доступность = Истина;
		//	СтрокаНДС.БНФОСубконто1 = СтрокаНДС.Субконто1;
		//	СтрокаНДС.БНФОСубконто2Доступность = Истина;
		//	Если СтрокаНДС.СчетФактура.Услуги.Количество() = 0 Тогда
		//		Запрос = Новый Запрос;
		//		Запрос.Текст = "ВЫБРАТЬ
		//		|	НДСРаздельныйУчет.Регистратор.БНФОСубконто1 КАК РегистраторБНФОСубконто1,
		//		|	НДСРаздельныйУчет.Регистратор.БНФОСубконто2 КАК РегистраторБНФОСубконто2,
		//		|	НДСРаздельныйУчет.Регистратор.БНФОСубконто3 КАК РегистраторБНФОСубконто3
		//		|ИЗ
		//		|	РегистрНакопления.НДСРаздельныйУчет КАК НДСРаздельныйУчет
		//		|ГДЕ
		//		|	НДСРаздельныйУчет.Партия = &Партия";
		//		Запрос.УстановитьПараметр("Партия",СтрокаНДС.СчетФактура );
		//		Выборка = Запрос.Выполнить().Выбрать();
		//		Пока Выборка.Следующий() Цикл
		//			СтрокаНДС.БНФОСубконто2 = Выборка.РегистраторБНФОСубконто2;
		//		КонецЦикла;
		//	Иначе	
		//		СтрокаНДС.БНФОСубконто2 =  СтрокаНДС.СчетФактура.Услуги[СтрокаНДС.ИсходныйНомерСтроки].БНФОСубконто2;
		//	КонецЕсли; 
		//КонецЕсли; 
		//
		//Если СтрокаНДС.СчетЗатрат.Владелец.Код = "61008" Тогда
		//	СтрокаНДС.БНФОСубконто1Доступность = Истина;
		//	СтрокаНДС.БНФОСубконто1 = СтрокаНДС.Субконто1;
		//	СтрокаНДС.БНФОСубконто2Доступность = Истина;
		//	СтрокаНДС.БНФОСубконто2 = СтрокаНДС.Субконто2;
		//	СтрокаНДС.БНФОСубконто3Доступность = Истина;
		//	СтрокаНДС.БНФОСубконто3 = СтрокаНДС.Субконто3;
		//	
		//	//Если СтрокаНДС.СчетФактура.Услуги.Количество() = 0 Тогда
		//	//	 Запрос = Новый Запрос;
		//	//	 Запрос.Текст = "ВЫБРАТЬ
		//	//	 |	НДСРаздельныйУчет.Регистратор.БНФОСубконто1 КАК РегистраторБНФОСубконто1,
		//	//	 |	НДСРаздельныйУчет.Регистратор.БНФОСубконто2 КАК РегистраторБНФОСубконто2,
		//	//	 |	НДСРаздельныйУчет.Регистратор.БНФОСубконто3 КАК РегистраторБНФОСубконто3
		//	//	 |ИЗ
		//	//	 |	РегистрНакопления.НДСРаздельныйУчет КАК НДСРаздельныйУчет
		//	//	 |ГДЕ
		//	//	 |	НДСРаздельныйУчет.Партия = &Партия";
		//	//	 Запрос.УстановитьПараметр("Партия",СтрокаНДС.СчетФактура );
		//	//	 Выборка = Запрос.Выполнить().Выбрать();
		//	//	 Пока Выборка.Следующий() Цикл
		//	//	   СтрокаНДС.БНФОСубконто2 = Выборка.РегистраторБНФОСубконто2;
		//	//	 КонецЦикла;
		//	// Иначе	
		//	// СтрокаНДС.БНФОСубконто2 =  СтрокаНДС.СчетФактура.Услуги[СтрокаНДС.ИсходныйНомерСтроки].БНФОСубконто2;
		//	// КонецЕсли; 
		//КонецЕсли; 
		//
		
	КонецЦикла;         
	
КонецПроцедуры

&НаСервере
&После("ЗагрузитьПодготовленныеДанные")
Процедура pcru_ex_ЗагрузитьПодготовленныеДанные()
	pcru_ex_СРВНачатьЗаполнениеДокумента();
КонецПроцедуры
