
&После("ОбработкаПроведения")
Процедура pcru_ex_ОбработкаПроведения(Отказ, РежимПроведения)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	БНФОДоговорыКредитовИДепозитов.Номер КАК Номер,
	|	БНФОДоговорыКредитовИДепозитов.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.БНФОДоговорыКредитовИДепозитов КАК БНФОДоговорыКредитовИДепозитов
	|ГДЕ
	|	БНФОДоговорыКредитовИДепозитов.Контрагент = &Контрагент";
	Запрос.УстановитьПараметр("Контрагент",Контрагент );
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Ндог = 	Выборка.Номер;
	КонецЦикла;
	Для каждого Проводка Из  Движения.БНФОБанковский Цикл
		Если Лев(Проводка.СчетДт.Код,1) = "7" Тогда
			Если ЗначениеЗаполнено(Ндог)  Тогда
				Нск =  1;
				Для каждого ВидСубконто Из Проводка.СчетДт.ВидыСубконто Цикл
					Если  ВидСубконто.ВидСубконто.Наименование = "Тип затрат"  Тогда
						//ДатаВыплаты = pcru_ex_WSWORKS.DisbursementDate(Ндог);
						ДатаВыплаты = ?(ЗначениеЗаполнено(ДоговорКонтрагента.pcru_ex_ДатаВыдачи), ДоговорКонтрагента.pcru_ex_ДатаВыдачи, pcru_ex_WSWORKS.DisbursementDate(Ндог));
						Если ДатаВыплаты <> Неопределено Тогда                                          
							Если ДатаВыплаты < Дата(2020,5,1,0,0,0) Тогда    //Если ДоговорКонтрагента.pcru_ ДатаВыплаты < Дата(2020,5,1,0,0,0) Тогда  

								БНФОБухгалтерскийУчет.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, Нск, Справочники.БНФОСубконто.НайтиПоКоду("000000092")); 
							Иначе
								БНФОБухгалтерскийУчет.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, Нск, Справочники.БНФОСубконто.НайтиПоКоду("000000093")); 
							КонецЕсли;
						КонецЕсли; 
					КонецЕсли;
					Нск = Нск + 1;
				КонецЦикла; 
			КонецЕсли; 
		КонецЕсли; 
		Если Лев(Проводка.СчетКт.Код,1) = "7" Тогда
			Если ЗначениеЗаполнено(Ндог)  Тогда
				Нск =  1;
				Для каждого ВидСубконто Из Проводка.СчетКт.ВидыСубконто Цикл
					Если  ВидСубконто.ВидСубконто.Наименование = "Тип затрат"  Тогда
						//ДатаВыплаты = pcru_ex_WSWORKS.DisbursementDate(Ндог);
						ДатаВыплаты = ?(ЗначениеЗаполнено(ДоговорКонтрагента.pcru_ex_ДатаВыдачи), ДоговорКонтрагента.pcru_ex_ДатаВыдачи, pcru_ex_WSWORKS.DisbursementDate(Ндог));
						Если ДатаВыплаты <> Неопределено Тогда
							Если ДатаВыплаты < Дата(2020,5,1,0,0,0) Тогда
								БНФОБухгалтерскийУчет.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, Нск, Справочники.БНФОСубконто.НайтиПоКоду("000000092")); 
							Иначе
								БНФОБухгалтерскийУчет.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, Нск, Справочники.БНФОСубконто.НайтиПоКоду("000000093")); 
							КонецЕсли;
						КонецЕсли;
					КонецЕсли;
					Нск = Нск + 1;
				КонецЦикла; 
			КонецЕсли; 
		КонецЕсли; 
	КонецЦикла; 
	Движения.БНФОБанковский.Записывать = Истина;
	Движения.Записать();
КонецПроцедуры


&Перед("ОбработкаПроведения")
Процедура pcru_ex_ОбработкаПроведенияПЕРЕД(Отказ, РежимПроведения)
	
	ЭтоЗагрузкаИзНав = Ложь;
	Если ДополнительныеСвойства.Свойство("ЭтоЗагрузкаИзНав") Тогда
		ЭтоЗагрузкаИзНав = ДополнительныеСвойства.ЭтоЗагрузкаИзНав;
	КонецЕсли; 
	Если Не ЭтоЗагрузкаИзНав Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	pcru_ex_ЗапланированноеВыполнениеРегламентныхЗаданий.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.pcru_ex_ЗапланированноеВыполнениеРегламентныхЗаданий КАК pcru_ex_ЗапланированноеВыполнениеРегламентныхЗаданий
		|ГДЕ
		|	pcru_ex_ЗапланированноеВыполнениеРегламентныхЗаданий.Результат ПОДОБНО ""Задание Выполняется..""";
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			Отказ = Истина;
			Сообщить("Идет загрузка из НАВ!! проведение не возможно!! ");
			Возврат;
		КонецЕсли;  
	КонецЕсли; 	
КонецПроцедуры
