
&Вместо("ПриЗаписи")
Процедура pcru_ex_ПриЗаписи(Отказ)
		Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ДополнительноеСоглашение И Не ПометкаУдаления И ДополнительныеСвойства.РежимЗаписи <> РежимЗаписиДокумента.ОтменаПроведения Тогда
	//	АЭ_РегламентированныйУчет.ОткрытьЛицевыеСчетаОбщиегоДоровораРасчетовКонтрагента(ЭтотОбъект);
	КонецЕсли;	
	
	АЭ_РегламентированныйУчет.СоздатьИзменитьСвязанныйДоговорКонтрагента(ЭтотОбъект, Ложь, Отказ);
	
	АвтоматическиОткрыватьЛицевыеСчета = АЭ_РегламентированныйУчет.ПолучитьПризнакАвтоматическогоОткрытияЛицевыхСчетов(ЭтотОбъект, "БанковскийВклад");	
	Если АвтоматическиОткрыватьЛицевыеСчета	И Не ДополнительноеСоглашение И Не ПометкаУдаления Тогда
		
		СтруктураПараметров = Новый Структура("Дата,Организация,Контрагент,Займ,ДокументОснование,ДоговорКонтрагента,ДоговорКредитаДепозита,ВидЗаймаБУ");
		ЗаполнитьЗначенияСвойств(СтруктураПараметров, ЭтотОбъект);
		СтруктураПараметров.ДокументОснование = Ссылка;
		СтруктураПараметров.Займ = Ссылка;
		
		АЭ_РегламентированныйУчет.ОткрытьЛицевыеСчетаПоОбъектамАналитик(СтруктураПараметров, Отказ);	
		
	КонецЕсли;

КонецПроцедуры
