
&Вместо("РаспределитьСуммыАвансовПоТаблицамПоступлениеТоваровУслуг")
Процедура pcru_ex_РаспределитьСуммыАвансовПоТаблицамПоступлениеТоваровУслуг(СтруктураТаблицДокумента, ТаблицаВзаиморасчеты, РаспределятьСУчетомНДС)
	Если  ТаблицаВзаиморасчеты.количество() = 0 тогда
		Возврат;
	Конецесли;
	
	ВалютаВзаиморасчетов = ТаблицаВзаиморасчеты[0].ВалютаВзаиморасчетов;
	
	Если ВалютаВзаиморасчетов <> ОбщегоНазначенияБПВызовСервераПовтИсп.ПолучитьВалютуРегламентированногоУчета() Тогда	
		РаспределитьСуммыАвансовПоТаблицамПоступлениеТоваровУслугВалюта(СтруктураТаблицДокумента,ТаблицаВзаиморасчеты,РаспределятьСУчетомНДС);
		Возврат;			
	КонецЕсли;
	
	КолонкиСумм = "СуммаБУ,
	|СуммаВзаиморасчетов,
	|СуммаНДСВзаиморасчетов,
	|СуммаНДСРуб,
	|СуммаНУ,
	|СуммаРуб,
	|Количество";
	
	
	БНФОУчетВзаиморасчетов.РаспределитьВзаиморасчетыНаСтрокиДокумента(СтруктураТаблицДокумента.ТаблицаТовары,				ТаблицаВзаиморасчеты, КолонкиСумм, РаспределятьСУчетомНДС,,,,,,,,,,,Истина);
	БНФОУчетВзаиморасчетов.РаспределитьВзаиморасчетыНаСтрокиДокумента(СтруктураТаблицДокумента.ТаблицаОборудование,			ТаблицаВзаиморасчеты, КолонкиСумм, РаспределятьСУчетомНДС,,,,,,,,,,,Истина);
	
	КолонкиСумм = "СуммаБУ,
	|СуммаВзаиморасчетов,
	|СуммаНДСВзаиморасчетов,
	|СуммаНДСРуб,
	|СуммаНУ,
	|СуммаРуб";
	
	БНФОУчетВзаиморасчетов.РаспределитьВзаиморасчетыНаСтрокиДокумента(СтруктураТаблицДокумента.ТаблицаОбъектыСтроительства,	ТаблицаВзаиморасчеты, КолонкиСумм, РаспределятьСУчетомНДС,,,,,,,,,,,Истина);
	БНФОУчетВзаиморасчетов.РаспределитьВзаиморасчетыНаСтрокиДокумента(СтруктураТаблицДокумента.ТаблицаУслуги,				ТаблицаВзаиморасчеты, КолонкиСумм, РаспределятьСУчетомНДС,,,,,,,,,,,Истина);
	
КонецПроцедуры


