
Функция ДобавитьПолеВвода(Форма, Имя, Родитель, ПутьКДанным) Экспорт
	
	ПолеВвода = Форма.Элементы.Добавить(Имя, Тип("ПолеФормы"), Родитель);
	ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
	ПолеВвода.ПутьКДанным = ПутьКДанным;
	Возврат ПолеВвода;
	
КонецФункции

Функция ДобавитьПолеНадписи(Форма, Имя, Родитель, ПутьКДанным) Экспорт
	
	ПолеНадписи = Форма.Элементы.Добавить(Имя, Тип("ПолеФормы"), Родитель);
	ПолеНадписи.Вид = ВидПоляФормы.ПолеНадписи;
	ПолеНадписи.ПутьКДанным = ПутьКДанным;
	Возврат ПолеНадписи;
	
КонецФункции
