&НаКлиенте
Перем ВСтроке;
&НаКлиенте
Перем Счетчик;
// Массив команд выполнения раскрашивания текста
&НаКлиенте
Перем МассивКоманд;



&НаКлиенте
Процедура ЗапросОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка)
	ВСтроке = Ложь; // глобальная для многострочных строк
	// Получаем HTML документ из объекта ПолеHTMLДокумента
	HTMLДокумент = Элементы.ПолеHTMLДокумента;
	Попытка
		РаскраситьТекст();
		ИзменитьСтили();
	Исключение          
		Сообщить(ОписаниеОшибки());
	КонецПопытки;
	ДокументДокументСформирован(HTMLДокумент);

КонецПроцедуры


&НаКлиенте
Процедура КодФункцииПриИзменении(Элемент)
	КонецПроцедуры

&НаКлиенте
// Процедура изменения стиля HTML документа
// 
Процедура ИзменитьСтили()
	
	Команда = Новый Массив;
	Команда.Добавить("ИзменитьСтили"); // Имя команды
	МассивКоманд.Добавить(Команда);
	
КонецПроцедуры

// Процедура раскрашивания текста
// 
&НаКлиенте
Процедура РаскраситьТекст()
	Попытка
		РаскрашенныйТекст = РаскрашиваемТекст(Объект.Запрос);
		Команда = Новый Массив;
		Команда.Добавить("РаскрашиваемТекст"); // Имя команды
		Команда.Добавить(РаскрашенныйТекст);   // Параметр1
		МассивКоманд.Добавить(Команда);
	Исключение          
		Сообщить(ОписаниеОшибки());
	КонецПопытки;
КонецПроцедуры

&НаКлиенте
Функция РаскрашиваемТекст(Код)
	Буфер = "<pre>";
	// Последовательно перебираются все строки кода, окрашиваются
	// и записываются в буфер
	Для счт = 1 По СтрЧислоСтрок(Код) Цикл
		стр = СтрПолучитьСтроку(Код, счт);
		Буфер = Буфер + РаскрашиваемКод(стр) + Символы.ПС;
	КонецЦикла;
	Возврат Буфер + "</pre>";
КонецФункции
// Основная функция раскрашивания кода
// 
// Параметры:
//   СтрокаКода - Раскрашивание происходит построчно, этот параметр - текущая строка
//
// Возвращаемое значение:
//   СтрокаКода - раскрашенная строка кода
//
&НаКлиенте
Функция РаскрашиваемКод(СтрокаКода)
	
	Поз = 1;
	Состояние = 0;                                   
	Токен = "";
	НачалоСтроки = 1;
	
	// Последовательно перебираются все символы строки кода
	Пока Поз <> СтрДлина(СтрокаКода) + 1 Цикл
		
		ТекущийСимвол = ПолучитьСимвол(СтрокаКода, Поз);
		Если ТекущийСимвол = "-" Тогда             
			Состояние = 1;
		ИначеЕсли ТекущийСимвол = Символы.Таб Или
				  ТекущийСимвол = " "
				  Тогда
		          Состояние = 2;
		ИначеЕсли ТекущийСимвол = "'" Тогда
			Состояние = 3;
		ИначеЕсли ТекущийСимвол = "" Тогда
			Состояние = 5;
		ИначеЕсли ЭтоСпецСимволы(ТекущийСимвол) Тогда
			Состояние = 6;
		ИначеЕсли ТекущийСимвол = "%" Тогда
			Состояние = 8;
		Иначе
			Состояние = 4; 
		КонецЕсли;
		
		// Проверяется на комментарий или на символ деления
		Если Состояние = 1 Тогда
			Если Не ВСтроке Тогда 
				Если ПолучитьСимвол(СтрокаКода, Поз + 1) = "-" Тогда
					// Окрашиваем комментарий
					СтрокаКода = Лев(СтрокаКода, Поз - 1) + 
								"<span class=c>" + 
								Прав(СтрокаКода, СтрДлина(СтрокаКода) - Поз + 1) +
								"</span>";
					Возврат СтрокаКода;
				Иначе
					// Это символ деления
					РаскрашиваемТокен(СтрокаКода, ТекущийСимвол, Поз, "k");
					Токен = "";
				КонецЕсли;
			КонецЕсли;
		// Операции при встрече символа табуляции или пробела
		ИначеЕсли Состояние = 2 Тогда
			Если Не ВСтроке Тогда 
				Если Не ПустаяСтрока(Токен) Тогда
					Поз = Поз - 1;
					// Пробел после после токена, значит
					// токен - ключевое слово...
					Если ЭтоКлючевоеСлово(Токен) Тогда
						РаскрашиваемТокен(СтрокаКода, Токен, Поз, "k");
					Иначе
					// ... или число
						Попытка
							ч = Число(Токен);
							РаскрашиваемТокен(СтрокаКода, Токен, Поз, "n");
						Исключение
						КонецПопытки;
					КонецЕсли;
					Поз = Поз + 1;
					Токен = "";
				КонецЕсли;
			КонецЕсли;
		// Операции встрече символа "кавычка"
		ИначеЕсли Состояние = 3 Тогда
			// Нашли парную кавычку - окрашиваем как строку
			Если ВСтроке Тогда
				СтрокаКода = Лев(СтрокаКода, НачалоСтроки - 1) + 
							"<span class=s>" + 
							Сред(СтрокаКода, НачалоСтроки, Поз - НачалоСтроки + 1) +
							"</span>" +
							Прав(СтрокаКода, СтрДлина(СтрокаКода) - Поз);
				Поз = Поз + СтрДлина("<span class=s>" + "</span>");
				ВСтроке = Ложь;
				Токен = "";
			// Первая кавычка, запоминаем позицию и взводим флаг нахождения в строке
			Иначе
				НачалоСтроки = Поз;
				ВСтроке = Истина;
			КонецЕсли;
		// Встретился один из специальных символов
		ИначеЕсли Состояние = 6 Тогда
			Если Не ВСтроке Тогда 
				Если Не ПустаяСтрока(Токен) Тогда
					Поз = Поз - 1;
					// Дабы избежать окраски метода объекта с совпадающим
					// именем с одним из ключевых слов, проверяем текущий символ
					// на "."
					Если ЭтоКлючевоеСлово(Токен) и ТекущийСимвол <> "." Тогда
						РаскрашиваемТокен(СтрокаКода, Токен, Поз, "k");
					Иначе
						// Не ключевое слово - значит число
						Попытка
							ч = Число(Токен);
							РаскрашиваемТокен(СтрокаКода, Токен, Поз, "n");
						Исключение
						КонецПопытки;
					КонецЕсли;
					Поз = Поз + 1;
					Токен = "";
				КонецЕсли;
				// Один из специальных символов
				РаскрашиваемТокен(СтрокаКода, ТекущийСимвол, Поз, "k");
			КонецЕсли;
			
		// Встретился символ препроцессора
		ИначеЕсли Состояние = 8 Тогда
			
			Если ВСтроке Тогда
				СтрокаКода = Лев(СтрокаКода, НачалоСтроки - 1) + 
							"<span class=p>" + 
							Сред(СтрокаКода, НачалоСтроки, Поз - НачалоСтроки + 1) +
							"</span>" +
							Прав(СтрокаКода, СтрДлина(СтрокаКода) - Поз);
				Поз = Поз + СтрДлина("<span class=p>" + "</span>");
				ВСтроке = Ложь;
				Токен = "";
			Иначе
				НачалоСтроки = Поз;
				ВСтроке = Истина;
			КонецЕсли;

			
			//Если Не ВСтроке Тогда 
			//	Поз = СтрДлина(СтрокаКода);
			//	РаскрашиваемТокен(СтрокаКода, СтрокаКода, Поз, "p");
			//КонецЕсли;
		// Остальные символы
		ИначеЕсли Состояние = 4 Тогда
			Токен = Токен + ТекущийСимвол;
		// Конец
		ИначеЕсли Состояние = 5 Тогда
			Прервать;
		КонецЕсли;
		
		Поз = Поз + 1;
	КонецЦикла;                                   
	
	// Многострочная строка
	Если ВСтроке Тогда
		СтрокаКода = Лев(СтрокаКода, НачалоСтроки - 1) + 
					"<span class=s>" + 
					Сред(СтрокаКода, НачалоСтроки, Поз - НачалоСтроки + 1) +
					"</span>" +
					Прав(СтрокаКода, СтрДлина(СтрокаКода) - Поз);
		Поз = Поз + СтрДлина("<span class=s>" + "</span>");
		Токен = "";
	КонецЕсли;
	
	// Анализируем последний токен строки кода
	Если Не ПустаяСтрока(Токен) Тогда
		Если ЭтоКлючевоеСлово(Токен) Тогда
			Поз = Поз - 1;
			РаскрашиваемТокен(СтрокаКода, Токен, Поз, "k");
			Поз = Поз + 1;
		КонецЕсли;
	КонецЕсли;
	
	Возврат СтрокаКода;
	
КонецФункции

// Возвращается строка CSS
//
// Возвращаемое значение:
//   Строка CSS
//
&НаКлиенте
Функция ВернутьСтиль()
	
	Возврат
		"pre
		|{
		|   font-family: Courier;
		|   color: #0000FF;
		|   font-size: 10pt;
		|}
		|.k{
		|	color: red;
		|}
		|.c{
		|	color: green;
		|}
		|.s{
		|	color: black;
		|}
		|.n{
		|	color: black;
		|}
		|.p
		|{
		|	color: brown;
		|}"
		
КонецФункции

// Функция получения символа из строки в заданной позиции
// 
// Параметры:
//   Строка - Строка, из которой берется символ
//   Поз    - Позиция получаемого символа в строке
//
// Возвращаемое значение:
//   Символ из запрашиваемой позиции
//
&НаКлиенте
Функция ПолучитьСимвол(Строка, Поз)
	Возврат Сред(Строка, Поз, 1);
КонецФункции

// Токен проверяется на принадлежность к ключевым словам 
// встроенного языка 1С:Предприятие 8.0
//
// Параметры:
//   _Токен - проверяемый токен
//
// Возвращаемое значение:
//   Истина, если токен является ключевым словом встроенного языка, Ложь - не является.
//
&НаКлиенте
Функция ЭтоКлючевоеСлово(_Токен)
	
	Токен = ВРег(_Токен);
	Если
		Токен = "SELECT" Или
		Токен = "FROM"   Или
		Токен = "AS"     Или
		Токен = "ON"     Или
		Токен = "LEFT"   Или
		Токен = "OUTER"  Или
		Токен = "JOIN"   Или
		Токен = "INNER"  Или
		Токен = "FULL"   Или
		Токен = "AND" Или
		Токен = "UNION" Или
		Токен = "ALL" Или
		Токен = "GROUP" Или
		Токен = "BY" Или
		Токен = "CAST" Или
		Токен = "HAVING" Или
		Токен = "TOP" Или
		Токен = "LIKE" Или
		Токен = "CASE" Или
		Токен = "WHEN" Или
		Токен = "THEN" Или
		Токен = "ELSE" Или
		Токен = "END" Или
		Токен = "NOT" Или
		Токен = "ORDER" Или
		Токен = "TOTALS" Или
		Токен = "SUM" Или
		Токен = "MIN" Или
	    Токен = "WHERE" Или
		Токен = "MAX" 
		
	Тогда
		Возврат Истина;
	КонецЕсли;
	
	Возврат Ложь;

КонецФункции


// Проверяется символ на принадлежность к специальным символам
//
// Параметры:
//   _Символ - Проверяемый символ
//
// Возвращаемое значение:
//   Истина, если _Символ является специальным символом, Ложь - не является.
//
&НаКлиенте
Функция ЭтоСпецСимволы(_Символ)
	
	Символ = НРег(_Символ);
	Если Символ = ")" Или 
    	 Символ = "(" Или
		 Символ = "[" Или
		 Символ = "]" Или
		 Символ = "," Или
		 Символ = "=" Или
		 Символ = "+" Или
		 Символ = "-" Или
		 Символ = "<" Или
		 Символ = ">" Или
		 Символ = ";" Или
		 Символ = "?" Или
		 Символ = "*" 
	Тогда
		Возврат Истина;
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

// Процедура раскраски токена
//
// Параметры:
//   СтрокаКода - Текущая строка кода
//   Токен      - Токен, который окрашивается
//   Поз        - Позиция начала Токена в текущей строке
//   Класс      - Класс, к которому принадлежит токен
//
&НаКлиенте
Процедура РаскрашиваемТокен(СтрокаКода, Токен, Поз, Класс)
	
	ДлинаТокена = СтрДлина(Токен);
	
	СтрокаКода = Лев(СтрокаКода, Поз - ДлинаТокена) + 
				"<span class=" + Класс + ">" + 
				Сред(СтрокаКода, Поз - ДлинаТокена + 1, ДлинаТокена) +
				"</span>" + 
				Прав(СтрокаКода, СтрДлина(СтрокаКода) - Поз);
	Поз = Поз + СтрДлина("<span class=>" + "</span>" + Класс);
	
КонецПроцедуры


&НаКлиенте
Процедура ДокументДокументСформирован(Элемент)
	Пока МассивКоманд.Количество() > 0 Цикл
		Если Элемент.Документ.readyState <> "complete" Тогда
			Возврат;
		КонецЕсли;

		Команда = МассивКоманд[0][0];
		Если Команда = "РаскрашиваемТекст" Тогда
			
			Элемент.Документ.body.innerHTML = МассивКоманд[0][1];
			
		ИначеЕсли Команда = "ИзменитьСтили" Тогда

			// Получим стили HTML документа
			КоллекцияСтилей = Элемент.Документ.styleSheets;
			
			// Ситуация, когда стилей больше одного, не обрабатывается
			Если КоллекцияСтилей.length >= 1 Тогда 
				
				// Изменяем стиль на подготовленный
				Стили = КоллекцияСтилей.item(0);
				Стили.cssText = ВернутьСтиль();
						
			Иначе
						
				Если КоллекцияСтилей.length = 0 Тогда
					 НовыйСтиль = Элемент.Документ.createElement("style");
                     НовыйСтиль.type = "text/css";
                     НовыйСтиль.innerText = ВернутьСтиль();
                     Элемент.Документ.head.appendChild(НовыйСтиль);
				КонецЕсли;
						
			КонецЕсли;
			
		КонецЕсли;
		
		МассивКоманд.Удалить(0);
		
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура ЗапросПриИзменении(Элемент)
	ВСтроке = Ложь; // глобальная для многострочных строк
	// Получаем HTML документ из объекта ПолеHTMLДокумента
	HTMLДокумент = Элементы.ПолеHTMLДокумента;
	Попытка
		РаскраситьТекст();
		ИзменитьСтили();
	Исключение          
		Сообщить(ОписаниеОшибки());
	КонецПопытки;
	ДокументДокументСформирован(HTMLДокумент);

КонецПроцедуры



ВСтроке = Ложь; // глобальная для многострочных строк
Счетчик = 1;
МассивКоманд = Новый Массив;
