
&После("СформироватьДвижения")
Процедура pcru_ex_СформироватьДвижения(СтруктураШапкиДокумента, Отказ, Ошибки)
	
	Если СтруктураШапкиДокумента.ВидОперации = Перечисления.АЭ_ВидыРегламентныхОпераций.РегламентированныйУчетБанковскиеВкладыНачислениеПроцентов Тогда
		Для Каждого Строка Из Движения.БНФОБанковский Цикл
			БНФОБухгалтерскийУчет.УстановитьСубконто(Строка.СчетКт, Строка.СубконтоКт, ПланыВидовХарактеристик.БНФОВидыСубконтоБанковские.НайтиПоКоду("90012"), Справочники.БНФОСубконто.НайтиПоКоду("000000092"));
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры
