
&НаКлиенте
&После("СчетОрганизацииПриИзменении")
Процедура pcru_ex_СчетОрганизацииПриИзменении(Элемент)
	УстановитьСчетБанка();
КонецПроцедуры

&НаСервере
Процедура УстановитьСчетБанка()
	
	Если ЭтотОбъект.Объект.СчетОрганизации.НомерСчета = "40702810400000000944" Тогда
		ЭтотОбъект.Объект.СчетБанк   = Справочники.БНФОСчетаАналитическогоУчета.НайтиПоКоду("2050181000000000000500000");
	КонецЕсли;
	
	Если ЭтотОбъект.Объект.СчетОрганизации.НомерСчета = "40702810603300479930" Тогда
		ЭтотОбъект.Объект.СчетБанк   = Справочники.БНФОСчетаАналитическогоУчета.НайтиПоКоду("2050181000000000000100000");
	КонецЕсли;
	
	Если ЭтотОбъект.Объект.СчетОрганизации.НомерСчета = "40702810703200479930" Тогда
		ЭтотОбъект.Объект.СчетБанк   = Справочники.БНФОСчетаАналитическогоУчета.НайтиПоКоду("2050181000000000000200000");
	КонецЕсли;
	
	Если ЭтотОбъект.СчетОрганизации.НомерСчета = "40702810803100479930" Тогда
		ЭтотОбъект.Объект.СчетБанк   = Справочники.БНФОСчетаАналитическогоУчета.НайтиПоКоду("2050181000000000000300000");
	КонецЕсли;
	
	Если ЭтотОбъект.Объект.СчетОрганизации.НомерСчета = "40702810903000479930" Тогда
		ЭтотОбъект.Объект.СчетБанк   = Справочники.БНФОСчетаАналитическогоУчета.НайтиПоКоду("2050181000000000000400000");
	КонецЕсли;
	
	Если ЭтотОбъект.Объект.СчетОрганизации.НомерСчета = "40702978803000479930" Тогда
		ЭтотОбъект.Объект.СчетБанк   = Справочники.БНФОСчетаАналитическогоУчета.НайтиПоКоду("2050197800000000000100000");
	КонецЕсли;

КонецПроцедуры // УстановитьСчетБанка()

